piborisovich/microcontrollers/Milandr/Libraries/CMSIS/MDR32VF0xI/DeviceSupport/inc/MDR32VF0xI.h
/**
 *******************************************************************************
 * @file    MDR32VF0xI.h
 * @author  Milandr Application Team
 * @version V0.2.0
 * @date    23/05/2025
 * @brief   Device Peripheral Access Layer Header File for MDR32VF0xI.
 *******************************************************************************
 * <br><br>
 *
 * THE PRESENT FIRMWARE IS FOR GUIDANCE ONLY. IT AIMS AT PROVIDING CUSTOMERS
 * WITH CODING INFORMATION REGARDING MILANDR'S PRODUCTS IN ORDER TO FACILITATE
 * THE USE AND SAVE TIME. MILANDR SHALL NOT BE HELD LIABLE FOR ANY
 * DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES RESULTING
 * FROM THE CONTENT OF SUCH FIRMWARE AND/OR A USE MADE BY CUSTOMERS OF THE
 * CODING INFORMATION CONTAINED HEREIN IN THEIR PRODUCTS.
 *
 * <h2><center>&copy; COPYRIGHT 2025 Milandr</center></h2>
 *******************************************************************************
 */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef MDR32VF0xI_H
#define MDR32VF0xI_H

/** @addtogroup DEVICE_SUPPORT Device Support
 * @{
 */

/** @addtogroup MDR32VF0xI_DEVICE MDR32VF0xI
 * @{
 */

#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */

/* Includes ------------------------------------------------------------------*/
#include "core_config.h"

/** @addtogroup MDR32VF0xI_Memory_Map Memory Map
 * @{
 */

#if defined(USE_MDR32F02)
/**
 * @brief MDR32F02 base addresses and sizes.
 */

#define OTP_BOOT_BASE      (0x00020000UL)
#define OTP_BOOT_SIZE      (0x00004000UL)

#define FLASH_BASE         (0x10000000UL)
#define FLASH_SIZE         (0x00040000UL)

#define RAM_AHB_BASE       (0x20000000UL)
#define RAM_AHB_SIZE       (0x00004000UL)

#define PERIPH_BASE        (0x40000000UL)

#define CRYPTO_REGION_BASE (0x60000000UL)

#define OTP_BASE           (0x70000000UL)
#define OTP_MEM_BASE       OTP_BASE
#define OTP_MEM_SIZE       OTP_BOOT_SIZE

#define RAM_TCMA_BASE      (0x80000000UL)
#define RAM_TCMA_SIZE      (0x00010000UL)

#define RAM_TCMB_BASE      (0x80010000UL)
#define RAM_TCMB_SIZE      (0x00008000UL)

/**
 * @brief MDR32F02 OTP memory.
 */
#define OTP_MEM ((uint32_t*)OTP_MEM_BASE)

#elif defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)

/**
 * @brief MDR1206 base addresses and sizes.
 */

#if defined(USE_MDR1206FI)
#define FLASH_BOOT_BASE (0x00020000UL)
#define FLASH_BOOT_SIZE (0x00004000UL)
#elif defined(USE_MDR1206AFI)
#define FLASH_BOOT_BASE (0x00020000UL)
#define FLASH_BOOT_SIZE (0x00003C00UL)
#elif defined(USE_MDR1206)
#define FLASH_BOOT_MDR1206FI_BASE  (0x00020000UL)
#define FLASH_BOOT_MDR1206FI_SIZE  (0x00004000UL)
#define FLASH_BOOT_MDR1206AFI_BASE (0x00020000UL)
#define FLASH_BOOT_MDR1206AFI_SIZE (0x00003C00UL)
#endif

#define FLASH_BASE    (0x10000000UL)
#define FLASH_SIZE    (0x00080000UL)

#define RAM_AHB_BASE  (0x20000000UL)
#define RAM_AHB_SIZE  (0x00004000UL)

#define RAM_TCMA_BASE (0x40000000UL)
#define RAM_TCMA_SIZE (0x00010000UL)

#define RAM_TCMB_BASE (0x40010000UL)
#define RAM_TCMB_SIZE (0x00008000UL)

#define PERIPH_BASE   (0x50000000UL)

#endif

/** @defgroup MDR32VF0xI_Peripheral_Memory_Map MDR32VF0xI Peripheral Memory Map
 * @{
 */

#define MDR_SSP1_BASE    (PERIPH_BASE + 0x00000000UL)
#define MDR_UART1_BASE   (PERIPH_BASE + 0x00008000UL)
#define MDR_UART2_BASE   (PERIPH_BASE + 0x00010000UL)
#define MDR_FLASH_BASE   (PERIPH_BASE + 0x00018000UL)
#define MDR_RST_CLK_BASE (PERIPH_BASE + 0x00020000UL)
#define MDR_DMA_BASE     (PERIPH_BASE + 0x00028000UL)
#define MDR_I2C_BASE     (PERIPH_BASE + 0x00030000UL)
#define MDR_UART3_BASE   (PERIPH_BASE + 0x00038000UL)
#define MDR_ADC_BASE     (PERIPH_BASE + 0x00040000UL)
#define MDR_WWDG_BASE    (PERIPH_BASE + 0x00048000UL)
#define MDR_IWDG_BASE    (PERIPH_BASE + 0x00050000UL)
#define MDR_POWER_BASE   (PERIPH_BASE + 0x00058000UL)
#define MDR_BKP_BASE     (PERIPH_BASE + 0x00060000UL)
#define MDR_ADCUI_BASE   (PERIPH_BASE + 0x00068000UL)
#define MDR_TIMER1_BASE  (PERIPH_BASE + 0x00070000UL)
#define MDR_TIMER2_BASE  (PERIPH_BASE + 0x00078000UL)
#define MDR_PORTA_BASE   (PERIPH_BASE + 0x00080000UL)
#define MDR_PORTB_BASE   (PERIPH_BASE + 0x00088000UL)
#define MDR_PORTC_BASE   (PERIPH_BASE + 0x00090000UL)
#define MDR_CRC_BASE     (PERIPH_BASE + 0x00098000UL)
#if defined(USE_MDR32F02)
#define MDR_SENSORS_BASE     (PERIPH_BASE + 0x000A8000UL)
#define MDR_CLK_MEASURE_BASE (PERIPH_BASE + 0x000B0000UL)
#endif
#define MDR_RANDOM_BASE (PERIPH_BASE + 0x000B8000UL)
#define MDR_USART_BASE  (PERIPH_BASE + 0x000C0000UL)
#define MDR_SSP2_BASE   (PERIPH_BASE + 0x000C8000UL)
#define MDR_SSP3_BASE   (PERIPH_BASE + 0x000D0000UL)
#define MDR_TIMER3_BASE (PERIPH_BASE + 0x000D8000UL)
#define MDR_TIMER4_BASE (PERIPH_BASE + 0x000E0000UL)
#define MDR_UART4_BASE  (PERIPH_BASE + 0x000E8000UL)
#define MDR_PORTD_BASE  (PERIPH_BASE + 0x000F0000UL)

#if defined(USE_MDR32F02)
#define MDR_L_BLOCK_BASE  (CRYPTO_REGION_BASE + 0x00004000UL)
#define MDR_S_BLOCK0_BASE (CRYPTO_REGION_BASE + 0x00008000UL)
#define MDR_S_BLOCK1_BASE (CRYPTO_REGION_BASE + 0x0000C000UL)
#define MDR_S_BLOCK2_BASE (CRYPTO_REGION_BASE + 0x00010000UL)
#define MDR_S_BLOCK3_BASE (CRYPTO_REGION_BASE + 0x00014000UL)
#define MDR_S_BLOCK4_BASE (CRYPTO_REGION_BASE + 0x00018000UL)
#define MDR_S_BLOCK5_BASE (CRYPTO_REGION_BASE + 0x0001C000UL)
#define MDR_S_BLOCK6_BASE (CRYPTO_REGION_BASE + 0x00020000UL)
#define MDR_S_BLOCK7_BASE (CRYPTO_REGION_BASE + 0x00024000UL)
#define MDR_P_BYTE_BASE   (CRYPTO_REGION_BASE + 0x00028000UL)
#define MDR_P_BIT0_BASE   (CRYPTO_REGION_BASE + 0x0002C000UL)
#define MDR_P_BIT1_BASE   (CRYPTO_REGION_BASE + 0x00030000UL)
#define MDR_P_BIT2_BASE   (CRYPTO_REGION_BASE + 0x00034000UL)
#define MDR_P_BIT3_BASE   (CRYPTO_REGION_BASE + 0x00038000UL)
#define MDR_OTP_REG_BASE  (CRYPTO_REGION_BASE + 0x10010000UL)
#endif

#if defined(USE_MDR1206FI)
#define MDR_FLASH_SPECIAL_FIELDS_BASE (FLASH_BOOT_BASE + 0x00003FE0UL)
#elif defined(USE_MDR1206AFI)
#define MDR_FLASH_SPECIAL_FIELDS_BASE (FLASH_BOOT_BASE + 0x00003BE0UL)
#elif defined(USE_MDR1206)
#define MDR_FLASH_SPECIAL_FIELDS_MDR1206FI_BASE  (FLASH_BOOT_MDR1206FI_BASE + 0x00003FE0UL)
#define MDR_FLASH_SPECIAL_FIELDS_MDR1206AFI_BASE (FLASH_BOOT_MDR1206AFI_BASE + 0x00003BE0UL)
#endif

/** @} */ /* End of group MDR32VF0xI_Peripheral_Memory_Map */

/** @} */ /* End of group MDR32VF0xI_Memory_Map */

