piborisovich/microcontrollers/Milandr/Libraries/CMSIS/MDR32VF0xI/DeviceSupport/inc/MDR32VF0xI.h
/** @defgroup MDR32VF0xI_Hardware_Constants MDR32VF0xI Hardware Constants
 * @{
 */

#if defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)
#define CHIP_ID_MDR1206FI  217UL
#define CHIP_ID_MDR1206AFI 215UL
#endif

#if defined(USE_MDR32F02)
#define CLK_FREQUENCY_MAX_Hz 60000000UL
#elif defined(USE_MDR1206FI)
#define CLK_FREQUENCY_MAX_Hz 48000000UL
#elif defined(USE_MDR1206AFI)
#define CLK_FREQUENCY_MAX_Hz 42000000UL
#elif defined(USE_MDR1206)
#define CLK_MDR1206FI_FREQUENCY_MAX_Hz  48000000UL
#define CLK_MDR1206AFI_FREQUENCY_MAX_Hz 42000000UL
#endif

#if defined(USE_MDR32F02)
#define HSI_CLK_FREQUENCY_MIN_Hz 7900000UL
#define HSI_CLK_FREQUENCY_TYP_Hz 8000000UL
#define HSI_CLK_FREQUENCY_MAX_Hz 8100000UL
#elif defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)
#define HSI_CLK_FREQUENCY_MIN_Hz 7500000UL
#define HSI_CLK_FREQUENCY_TYP_Hz 8000000UL
#define HSI_CLK_FREQUENCY_MAX_Hz 8500000UL
#endif
#define HSIRDY_TIMEOUT_HARDWARE_TICK 3UL

#define HSE_OSC_CLK_FREQUENCY_MIN_Hz 8000000UL
#define HSE_OSC_CLK_FREQUENCY_MAX_Hz 16000000UL
#if defined(USE_MDR32F02) || defined(USE_MDR1206FI) || defined(USE_MDR1206AFI)
#define HSE_BYP_CLK_FREQUENCY_MAX_Hz CLK_FREQUENCY_MAX_Hz
#elif defined(USE_MDR1206)
#define HSE_BYP_CLK_MDR1206FI_FREQUENCY_MAX_Hz  CLK_MDR1206FI_FREQUENCY_MAX_Hz
#define HSE_BYP_CLK_MDR1206AFI_FREQUENCY_MAX_Hz CLK_MDR1206AFI_FREQUENCY_MAX_Hz
#endif
#define HSERDY_TIMEOUT_TYP_MS           5UL

#define LSI_CLK_FREQUENCY_MIN_Hz        (HSI_CLK_FREQUENCY_MIN_Hz / 256)
#define LSI_CLK_FREQUENCY_TYP_Hz        (HSI_CLK_FREQUENCY_TYP_Hz / 256)
#define LSI_CLK_FREQUENCY_MAX_Hz        (HSI_CLK_FREQUENCY_MAX_Hz / 256)
#define LSIRDY_TIMEOUT_HARDWARE_TICK    3UL

#define LSE_OSC_CLK_FREQUENCY_MIN_Hz    32000UL
#define LSE_OSC_CLK_FREQUENCY_MAX_Hz    33000UL
#define LSE_BYP_CLK_FREQUENCY_MAX_Hz    1000000UL
#define LSERDY_TIMEOUT_TYP_MS           1000UL

#define PLLCPU_CLK_IN_FREQUENCY_MIN_Hz  8000000UL
#define PLLCPU_CLK_IN_FREQUENCY_MAX_Hz  16000000UL

#define PLLCPU_CLK_OUT_FREQUENCY_MIN_Hz 8000000UL
#if defined(USE_MDR32F02) || defined(USE_MDR1206FI) || defined(USE_MDR1206AFI)
#define PLLCPU_CLK_OUT_FREQUENCY_MAX_Hz CLK_FREQUENCY_MAX_Hz
#elif defined(USE_MDR1206)
#define PLLCPU_CLK_OUT_MDR1206FI_FREQUENCY_MAX_Hz  CLK_MDR1206FI_FREQUENCY_MAX_Hz
#define PLLCPU_CLK_OUT_MDR1206AFI_FREQUENCY_MAX_Hz CLK_MDR1206AFI_FREQUENCY_MAX_Hz
#endif

#define PLLCPURDY_TIMEOUT_HARDWARE_US 34UL

#define ADC_CLK_FREQUENCY_MAX_Hz      28000000UL

#if defined(USE_MDR32F02)
#define ADCUI_CLK_FREQUENCY_MIN_Hz 900000UL
#define ADCUI_CLK_FREQUENCY_MAX_Hz 1100000UL
#elif defined(USE_MDR1206FI) || defined(USE_MDR1206AFI)
#define ADCUI_CLK_FREQUENCY_MIN_Hz 900000UL
#define ADCUI_CLK_FREQUENCY_MAX_Hz 4100000UL
#endif

#define VREF_INT_VOLTAGE_TYP_mV 2450UL

#if defined(USE_MDR1206FI)
#define TRIM_HSI_VALUE_TYP 0x1EUL
#define TRIM_BG_VALUE_TYP  0x14UL
#elif defined(USE_MDR1206AFI)
#define TRIM_HSI_VALUE_TYP 0x2BUL
#define TRIM_BG_VALUE_TYP  0x04UL
#elif defined(USE_MDR1206)
#define TRIM_HSI_MDR1206FI_VALUE_TYP  0x1EUL
#define TRIM_BG_MDR1206FI_VALUE_TYP   0x14UL
#define TRIM_HSI_MDR1206AFI_VALUE_TYP 0x2BUL
#define TRIM_BG_MDR1206AFI_VALUE_TYP  0x04UL
#endif

#define BKP_RTC_CLK_MUX_SWITCH_TICK 3UL

/** @} */ /* End of group MDR32VF0xI_Hardware_Constants */

/** @defgroup MDR32VF0xI_Peripheral_Units MDR32VF0xI Peripheral Units
 * @{
 */

/** @defgroup MDR32VF0xI_SSP MDR_SSP
 * @{
 */

/**
 * @brief MDR32VF0xI SSP control structure.
 */
typedef struct {
    __IO uint32_t CR0;   /*!<SSP Control0 Register */
    __IO uint32_t CR1;   /*!<SSP Control1 Register */
    __IO uint32_t DR;    /*!<SSP Data Register */
    __I uint32_t  SR;    /*!<SSP Status Register */
    __IO uint32_t CPSR;  /*!<SSP Clock Prescaler Register */
    __IO uint32_t IMSC;  /*!<SSP Interrupt Mask Register */
    __I uint32_t  RIS;   /*!<SSP Interrupt Pending Register */
    __I uint32_t  MIS;   /*!<SSP Masked Interrupt Pending Register */
    __O uint32_t  ICR;   /*!<SSP Interrupt Clear Register */
    __IO uint32_t DMACR; /*!<SSP DMA Control Register */
} MDR_SSP_TypeDef;

/** @defgroup MDR32VF0xI_SSP_Defines SSP Defines
 * @{
 */

/** @defgroup MDR32VF0xI_SSP_CR0 SSP CR0
 * @{
 */

#define SSP_CR0_DSS30_Pos     0
#define SSP_CR0_DSS30_Msk     (0xFUL << SSP_CR0_DSS30_Pos)
#define SSP_CR0_DSS_4BIT      (0x3UL << SSP_CR0_DSS30_Pos)
#define SSP_CR0_DSS_5BIT      (0x4UL << SSP_CR0_DSS30_Pos)
#define SSP_CR0_DSS_6BIT      (0x5UL << SSP_CR0_DSS30_Pos)
#define SSP_CR0_DSS_7BIT      (0x6UL << SSP_CR0_DSS30_Pos)
#define SSP_CR0_DSS_8BIT      (0x7UL << SSP_CR0_DSS30_Pos)
#define SSP_CR0_DSS_9BIT      (0x8UL << SSP_CR0_DSS30_Pos)
#define SSP_CR0_DSS_10BIT     (0x9UL << SSP_CR0_DSS30_Pos)
#define SSP_CR0_DSS_11BIT     (0xAUL << SSP_CR0_DSS30_Pos)
#define SSP_CR0_DSS_12BIT     (0xBUL << SSP_CR0_DSS30_Pos)
#define SSP_CR0_DSS_13BIT     (0xCUL << SSP_CR0_DSS30_Pos)
#define SSP_CR0_DSS_14BIT     (0xDUL << SSP_CR0_DSS30_Pos)
#define SSP_CR0_DSS_15BIT     (0xEUL << SSP_CR0_DSS30_Pos)
#define SSP_CR0_DSS_16BIT     (0xFUL << SSP_CR0_DSS30_Pos)

#define SSP_CR0_FRF_Pos       4
#define SSP_CR0_FRF_Msk       (0x3UL << SSP_CR0_FRF_Pos)
#define SSP_CR0_FRF_SPI       (0x0UL << SSP_CR0_FRF_Pos)
#define SSP_CR0_FRF_SSI       (0x1UL << SSP_CR0_FRF_Pos)
#define SSP_CR0_FRF_MICROWIRE (0x2UL << SSP_CR0_FRF_Pos)

#define SSP_CR0_SPO_Pos       6
#define SSP_CR0_SPO_Msk       (0x1UL << SSP_CR0_SPO_Pos)
#define SSP_CR0_SPO           SSP_CR0_SPO_Msk

#define SSP_CR0_SPH_Pos       7
#define SSP_CR0_SPH_Msk       (0x1UL << SSP_CR0_SPH_Pos)
#define SSP_CR0_SPH           SSP_CR0_SPH_Msk

#define SSP_CR0_SCR_Pos       8
#define SSP_CR0_SCR_Msk       (0xFFUL << SSP_CR0_SCR_Pos)

#if defined(USE_MDR32F02_REV_1X)

#define SSP_CR0_DSS_Msk SSP_CR0_DSS30_Msk

#elif defined(USE_MDR32F02_REV_2) || defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)

#define SSP_CR0_DSS4_Pos   16
#define SSP_CR0_DSS4_Msk   (0x1UL << SSP_CR0_DSS4_Pos)
#define SSP_CR0_DSS4       SSP_CR0_DSS4_Msk

#define SSP_CR0_DSS_Msk    (SSP_CR0_DSS30_Msk | SSP_CR0_DSS4_Msk)
#define SSP_CR0_DSS_17BIT  ((0x0UL << SSP_CR0_DSS30_Pos) | SSP_CR0_DSS4)
#define SSP_CR0_DSS_18BIT  ((0x1UL << SSP_CR0_DSS30_Pos) | SSP_CR0_DSS4)
#define SSP_CR0_DSS_19BIT  ((0x2UL << SSP_CR0_DSS30_Pos) | SSP_CR0_DSS4)
#define SSP_CR0_DSS_20BIT  ((0x3UL << SSP_CR0_DSS30_Pos) | SSP_CR0_DSS4)
#define SSP_CR0_DSS_21BIT  ((0x4UL << SSP_CR0_DSS30_Pos) | SSP_CR0_DSS4)
#define SSP_CR0_DSS_22BIT  ((0x5UL << SSP_CR0_DSS30_Pos) | SSP_CR0_DSS4)
#define SSP_CR0_DSS_23BIT  ((0x6UL << SSP_CR0_DSS30_Pos) | SSP_CR0_DSS4)
#define SSP_CR0_DSS_24BIT  ((0x7UL << SSP_CR0_DSS30_Pos) | SSP_CR0_DSS4)
#define SSP_CR0_DSS_25BIT  ((0x8UL << SSP_CR0_DSS30_Pos) | SSP_CR0_DSS4)
#define SSP_CR0_DSS_26BIT  ((0x9UL << SSP_CR0_DSS30_Pos) | SSP_CR0_DSS4)
#define SSP_CR0_DSS_27BIT  ((0xAUL << SSP_CR0_DSS30_Pos) | SSP_CR0_DSS4)
#define SSP_CR0_DSS_28BIT  ((0xBUL << SSP_CR0_DSS30_Pos) | SSP_CR0_DSS4)
#define SSP_CR0_DSS_29BIT  ((0xCUL << SSP_CR0_DSS30_Pos) | SSP_CR0_DSS4)
#define SSP_CR0_DSS_30BIT  ((0xDUL << SSP_CR0_DSS30_Pos) | SSP_CR0_DSS4)
#define SSP_CR0_DSS_31BIT  ((0xEUL << SSP_CR0_DSS30_Pos) | SSP_CR0_DSS4)
#define SSP_CR0_DSS_32BIT  ((0xFUL << SSP_CR0_DSS30_Pos) | SSP_CR0_DSS4)

#define SSP_CR0_SSPFRX_Pos 17
#define SSP_CR0_SSPFRX_Msk (0x1UL << SSP_CR0_SSPFRX_Pos)
#define SSP_CR0_SSPFRX     SSP_CR0_SSPFRX_Msk

#endif

/** @} */ /* End of group MDR32VF0xI_SSP_CR0 */

/** @defgroup MDR32VF0xI_SSP_CR1 SSP CR1
 * @{
 */

#define SSP_CR1_LBM_Pos 0
#define SSP_CR1_LBM_Msk (0x1UL << SSP_CR1_LBM_Pos)
#define SSP_CR1_LBM     SSP_CR1_LBM_Msk

#define SSP_CR1_SSE_Pos 1
#define SSP_CR1_SSE_Msk (0x1UL << SSP_CR1_SSE_Pos)
#define SSP_CR1_SSE     SSP_CR1_SSE_Msk

#define SSP_CR1_MS_Pos  2
#define SSP_CR1_MS_Msk  (0x1UL << SSP_CR1_MS_Pos)
#define SSP_CR1_MS      SSP_CR1_MS_Msk

#define SSP_CR1_SOD_Pos 3
#define SSP_CR1_SOD_Msk (0x1UL << SSP_CR1_SOD_Pos)
#define SSP_CR1_SOD     SSP_CR1_SOD_Msk

#if defined(USE_MDR32F02_REV_2) || defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)

