piborisovich/microcontrollers/Milandr/Libraries/CMSIS/MDR32VF0xI/DeviceSupport/inc/MDR32VF0xI.h
#define SSP_CR1_RESTXFIFO_Pos 4
#define SSP_CR1_RESTXFIFO_Msk (0x1UL << SSP_CR1_RESTXFIFO_Pos)
#define SSP_CR1_RESTXFIFO     SSP_CR1_RESTXFIFO_Msk

#endif

/** @} */ /* End of group MDR32VF0xI_SSP_CR1 */

/** @defgroup MDR32VF0xI_SSP_DR SSP DR
 * @{
 */

#define SSP_DR_DATA_Pos 0
#if defined(USE_MDR32F02_REV_1X)
#define SSP_DR_DATA_Msk (0xFFFFUL << SSP_DR_DATA_Pos)
#else
#define SSP_DR_DATA_Msk (0xFFFFFFFFUL << SSP_DR_DATA_Pos)
#endif

/** @} */ /* End of group MDR32VF0xI_SSP_DR */

/** @defgroup MDR32VF0xI_SSP_SR SSP SR
 * @{
 */

#define SSP_SR_TFE_Pos 0
#define SSP_SR_TFE_Msk (0x1UL << SSP_SR_TFE_Pos)
#define SSP_SR_TFE     SSP_SR_TFE_Msk

#define SSP_SR_TNF_Pos 1
#define SSP_SR_TNF_Msk (0x1UL << SSP_SR_TNF_Pos)
#define SSP_SR_TNF     SSP_SR_TNF_Msk

#define SSP_SR_RNE_Pos 2
#define SSP_SR_RNE_Msk (0x1UL << SSP_SR_RNE_Pos)
#define SSP_SR_RNE     SSP_SR_RNE_Msk

#define SSP_SR_RFF_Pos 3
#define SSP_SR_RFF_Msk (0x1UL << SSP_SR_RFF_Pos)
#define SSP_SR_RFF     SSP_SR_RFF_Msk

#define SSP_SR_BSY_Pos 4
#define SSP_SR_BSY_Msk (0x1UL << SSP_SR_BSY_Pos)
#define SSP_SR_BSY     SSP_SR_BSY_Msk

/** @} */ /* End of group MDR32VF0xI_SSP_SR */

/** @defgroup MDR32VF0xI_SSP_CPSR SSP CPSR
 * @{
 */

#define SSP_CPSR_CPSDVSR_Pos 0
#define SSP_CPSR_CPSDVSR_Msk (0xFFUL << SSP_CPSR_CPSDVSR_Pos)

/** @} */ /* End of group MDR32VF0xI_SSP_CPSR */

/** @defgroup MDR32VF0xI_SSP_IMSC SSP IMSC
 * @{
 */

#define SSP_IMSC_RORIM_Pos 0
#define SSP_IMSC_RORIM_Msk (0x1UL << SSP_IMSC_RORIM_Pos)
#define SSP_IMSC_RORIM     SSP_IMSC_RORIM_Msk

#define SSP_IMSC_RTIM_Pos  1
#define SSP_IMSC_RTIM_Msk  (0x1UL << SSP_IMSC_RTIM_Pos)
#define SSP_IMSC_RTIM      SSP_IMSC_RTIM_Msk

#define SSP_IMSC_RXIM_Pos  2
#define SSP_IMSC_RXIM_Msk  (0x1UL << SSP_IMSC_RXIM_Pos)
#define SSP_IMSC_RXIM      SSP_IMSC_RXIM_Msk

#define SSP_IMSC_TXIM_Pos  3
#define SSP_IMSC_TXIM_Msk  (0x1UL << SSP_IMSC_TXIM_Pos)
#define SSP_IMSC_TXIM      SSP_IMSC_TXIM_Msk

#if defined(USE_MDR32F02_REV_2) || defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)

#define SSP_IMSC_RNEIM_Pos   4
#define SSP_IMSC_RNEIM_Msk   (0x1UL << SSP_IMSC_RNEIM_Pos)
#define SSP_IMSC_RNEIM       SSP_IMSC_RNEIM_Msk

#define SSP_IMSC_TFEIM_Pos   5
#define SSP_IMSC_TFEIM_Msk   (0x1UL << SSP_IMSC_TFEIM_Pos)
#define SSP_IMSC_TFEIM       SSP_IMSC_TFEIM_Msk

#define SSP_IMSC_TNBSYIM_Pos 6
#define SSP_IMSC_TNBSYIM_Msk (0x1UL << SSP_IMSC_TNBSYIM_Pos)
#define SSP_IMSC_TNBSYIM     SSP_IMSC_TNBSYIM_Msk

#endif

/** @} */ /* End of group MDR32VF0xI_SSP_IMSC */

/** @defgroup MDR32VF0xI_SSP_RIS SSP RIS
 * @{
 */

#define SSP_RIS_RORRIS_Pos 0
#define SSP_RIS_RORRIS_Msk (0x1UL << SSP_RIS_RORRIS_Pos)
#define SSP_RIS_RORRIS     SSP_RIS_RORRIS_Msk

#define SSP_RIS_RTRIS_Pos  1
#define SSP_RIS_RTRIS_Msk  (0x1UL << SSP_RIS_RTRIS_Pos)
#define SSP_RIS_RTRIS      SSP_RIS_RTRIS_Msk

#define SSP_RIS_RXRIS_Pos  2
#define SSP_RIS_RXRIS_Msk  (0x1UL << SSP_RIS_RXRIS_Pos)
#define SSP_RIS_RXRIS      SSP_RIS_RXRIS_Msk

#define SSP_RIS_TXRIS_Pos  3
#define SSP_RIS_TXRIS_Msk  (0x1UL << SSP_RIS_TXRIS_Pos)
#define SSP_RIS_TXRIS      SSP_RIS_TXRIS_Msk

#if defined(USE_MDR32F02_REV_2) || defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)

#define SSP_IMSC_RNERIS_Pos   4
#define SSP_IMSC_RNERIS_Msk   (0x1UL << SSP_IMSC_RNERIS_Pos)
#define SSP_IMSC_RNERIS       SSP_IMSC_RNERIS_Msk

#define SSP_IMSC_TFERIS_Pos   5
#define SSP_IMSC_TFERIS_Msk   (0x1UL << SSP_IMSC_TFERIS_Pos)
#define SSP_IMSC_TFERIS       SSP_IMSC_TFERIS_Msk

#define SSP_IMSC_TNBSYRIS_Pos 6
#define SSP_IMSC_TNBSYRIS_Msk (0x1UL << SSP_IMSC_TNBSYRIS_Pos)
#define SSP_IMSC_TNBSYRIS     SSP_IMSC_TNBSYRIS_Msk

#endif

/** @} */ /* End of group MDR32VF0xI_SSP_RIS */

/** @defgroup MDR32VF0xI_SSP_MIS SSP MIS
 * @{
 */

#define SSP_MIS_RORMIS_Pos 0
#define SSP_MIS_RORMIS_Msk (0x1UL << SSP_MIS_RORMIS_Pos)
#define SSP_MIS_RORMIS     SSP_MIS_RORMIS_Msk

#define SSP_MIS_RTMIS_Pos  1
#define SSP_MIS_RTMIS_Msk  (0x1UL << SSP_MIS_RTMIS_Pos)
#define SSP_MIS_RTMIS      SSP_MIS_RTMIS_Msk

#define SSP_MIS_RXMIS_Pos  2
#define SSP_MIS_RXMIS_Msk  (0x1UL << SSP_MIS_RXMIS_Pos)
#define SSP_MIS_RXMIS      SSP_MIS_RXMIS_Msk

#define SSP_MIS_TXMIS_Pos  3
#define SSP_MIS_TXMIS_Msk  (0x1UL << SSP_MIS_TXMIS_Pos)
#define SSP_MIS_TXMIS      SSP_MIS_TXMIS_Msk

#if defined(USE_MDR32F02_REV_2) || defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)

#define SSP_MIS_RNEMIS_Pos   4
#define SSP_MIS_RNEMIS_Msk   (0x1UL << SSP_MIS_RNEMIS_Pos)
#define SSP_MIS_RNERIS       SSP_MIS_RNEMIS_Msk

#define SSP_MIS_TFEMIS_Pos   5
#define SSP_MIS_TFEMIS_Msk   (0x1UL << SSP_MIS_TFEMIS_Pos)
#define SSP_MIS_TFERIS       SSP_MIS_TFEMIS_Msk

#define SSP_MIS_TNBSYMIS_Pos 6
#define SSP_MIS_TNBSYMIS_Msk (0x1UL << SSP_MIS_TNBSYMIS_Pos)
#define SSP_MIS_TNBSYRIS     SSP_MIS_TNBSYMIS_Msk

#endif

/** @} */ /* End of group MDR32VF0xI_SSP_MIS */

/** @defgroup MDR32VF0xI_SSP_ICR SSP ICR
 * @{
 */

#define SSP_ICR_RORIC_Pos 0
#define SSP_ICR_RORIC_Msk (0x1UL << SSP_ICR_RORIC_Pos)
#define SSP_ICR_RORIC     SSP_ICR_RORIC_Msk

#define SSP_ICR_RTIC_Pos  1
#define SSP_ICR_RTIC_Msk  (0x1UL << SSP_ICR_RTIC_Pos)
#define SSP_ICR_RTIC      SSP_ICR_RTIC_Msk

/** @} */ /* End of group MDR32VF0xI_SSP_ICR */

/** @defgroup MDR32VF0xI_SSP_DMACR SSP DMACR
 * @{
 */

#define SSP_DMACR_RXDMAE_Pos 0
#define SSP_DMACR_RXDMAE_Msk (0x1UL << SSP_DMACR_RXDMAE_Pos)
#define SSP_DMACR_RXDMAE     SSP_DMACR_RXDMAE_Msk

#define SSP_DMACR_TXDMAE_Pos 1
#define SSP_DMACR_TXDMAE_Msk (0x1UL << SSP_DMACR_TXDMAE_Pos)
#define SSP_DMACR_TXDMAE     SSP_DMACR_TXDMAE_Msk

/** @} */ /* End of group MDR32VF0xI_SSP_DMACR */

/** @} */ /* End of group MDR32VF0xI_SSP_Defines */

/** @} */ /* End of group MDR32VF0xI_SSP */

/** @defgroup MDR32VF0xI_UART MDR_UART
 * @{
 */

/**
 * @brief MDR32VF0xI UART control structure.
 */
typedef struct {
    __IO uint32_t DR;      /*!<UART Data Register */
    __IO uint32_t RSR_ECR; /*!<UART Receive Status Register / Error Clear Register */
    __I uint32_t  RESERVED0[4];
    __I uint32_t  FR; /*!<UART Flag Register */
    __I uint32_t  RESERVED1;
    __IO uint32_t ILPR;  /*!<UART IrDA Low-Power Counter Register */
    __IO uint32_t IBRD;  /*!<UART Integer Baud Rate Register */
    __IO uint32_t FBRD;  /*!<UART Fractional Baud Rate Register */
    __IO uint32_t LCR_H; /*!<UART Line Control Register */
    __IO uint32_t CR;    /*!<UART Control Register */
    __IO uint32_t IFLS;  /*!<UART Interrupt FIFO Level Select Register */
    __IO uint32_t IMSC;  /*!<UART Interrupt Mask Set/Clear Register */
    __I uint32_t  RIS;   /*!<UART Raw Interrupt Status Register */
    __I uint32_t  MIS;   /*!<UART Masked Interrupt Status Register */
    __O uint32_t  ICR;   /*!<UART Interrupt Clear Register */
    __IO uint32_t DMACR; /*!<UART DMA Control Register */
    __I uint32_t  RESERVED2[13];
    __IO uint32_t TCR; /*!<UART Test Control Register */
} MDR_UART_TypeDef;

/** @defgroup MDR32VF0xI_UART_Defines UART Defines
 * @{
 */

/** @defgroup MDR32VF0xI_UART_DR UART DR
 * @{
 */

#define UART_DR_DATA_Pos 0
#define UART_DR_DATA_Msk (0x1FFUL << UART_DR_DATA_Pos)

