piborisovich/microcontrollers/Milandr/Libraries/CMSIS/MDR32VF0xI/DeviceSupport/inc/MDR32VF0xI.h
#define UART_IFLS_RXIFLSEL_Pos    3
#define UART_IFLS_RXIFLSEL_Msk    (0x7UL << UART_IFLS_RXIFLSEL_Pos)
#define UART_IFLS_RXIFLSEL_2WORD  (0x0UL << UART_IFLS_RXIFLSEL_Pos)
#define UART_IFLS_RXIFLSEL_4WORD  (0x1UL << UART_IFLS_RXIFLSEL_Pos)
#define UART_IFLS_RXIFLSEL_8WORD  (0x2UL << UART_IFLS_RXIFLSEL_Pos)
#define UART_IFLS_RXIFLSEL_12WORD (0x3UL << UART_IFLS_RXIFLSEL_Pos)
#define UART_IFLS_RXIFLSEL_14WORD (0x4UL << UART_IFLS_RXIFLSEL_Pos)

/** @} */ /* End of group MDR32VF0xI_UART_IFLS */

/** @defgroup MDR32VF0xI_UART_IMSC UART IMSC
 * @{
 */

#define UART_IMSC_RIMIM_Pos   0
#define UART_IMSC_RIMIM_Msk   (0x1UL << UART_IMSC_RIMIM_Pos)
#define UART_IMSC_RIMIM       UART_IMSC_RIMIM_Msk

#define UART_IMSC_CTSMIM_Pos  1
#define UART_IMSC_CTSMIM_Msk  (0x1UL << UART_IMSC_CTSMIM_Pos)
#define UART_IMSC_CTSMIM      UART_IMSC_CTSMIM_Msk

#define UART_IMSC_DCDMIM_Pos  2
#define UART_IMSC_DCDMIM_Msk  (0x1UL << UART_IMSC_DCDMIM_Pos)
#define UART_IMSC_DCDMIM      UART_IMSC_DCDMIM_Msk

#define UART_IMSC_DSRMIM_Pos  3
#define UART_IMSC_DSRMIM_Msk  (0x1UL << UART_IMSC_DSRMIM_Pos)
#define UART_IMSC_DSRMIM      UART_IMSC_DSRMIM_Msk

#define UART_IMSC_RXIM_Pos    4
#define UART_IMSC_RXIM_Msk    (0x1UL << UART_IMSC_RXIM_Pos)
#define UART_IMSC_RXIM        UART_IMSC_RXIM_Msk

#define UART_IMSC_TXIM_Pos    5
#define UART_IMSC_TXIM_Msk    (0x1UL << UART_IMSC_TXIM_Pos)
#define UART_IMSC_TXIM        UART_IMSC_TXIM_Msk

#define UART_IMSC_RTIM_Pos    6
#define UART_IMSC_RTIM_Msk    (0x1UL << UART_IMSC_RTIM_Pos)
#define UART_IMSC_RTIM        UART_IMSC_RTIM_Msk

#define UART_IMSC_FEIM_Pos    7
#define UART_IMSC_FEIM_Msk    (0x1UL << UART_IMSC_FEIM_Pos)
#define UART_IMSC_FEIM        UART_IMSC_FEIM_Msk

#define UART_IMSC_PEIM_Pos    8
#define UART_IMSC_PEIM_Msk    (0x1UL << UART_IMSC_PEIM_Pos)
#define UART_IMSC_PEIM        UART_IMSC_PEIM_Msk

#define UART_IMSC_BEIM_Pos    9
#define UART_IMSC_BEIM_Msk    (0x1UL << UART_IMSC_BEIM_Pos)
#define UART_IMSC_BEIM        UART_IMSC_BEIM_Msk

#define UART_IMSC_OEIM_Pos    10
#define UART_IMSC_OEIM_Msk    (0x1UL << UART_IMSC_OEIM_Pos)
#define UART_IMSC_OEIM        UART_IMSC_OEIM_Msk

#define UART_IMSC_RNEIM_Pos   11
#define UART_IMSC_RNEIM_Msk   (0x1UL << UART_IMSC_RNEIM_Pos)
#define UART_IMSC_RNEIM       UART_IMSC_RNEIM_Msk

#define UART_IMSC_TFEIM_Pos   12
#define UART_IMSC_TFEIM_Msk   (0x1UL << UART_IMSC_TFEIM_Pos)
#define UART_IMSC_TFEIM       UART_IMSC_TFEIM_Msk

#define UART_IMSC_TNBSYIM_Pos 13
#define UART_IMSC_TNBSYIM_Msk (0x1UL << UART_IMSC_TNBSYIM_Pos)
#define UART_IMSC_TNBSYIM     UART_IMSC_TNBSYIM_Msk

/** @} */ /* End of group MDR32VF0xI_UART_IMSC */

/** @defgroup MDR32VF0xI_UART_RIS UART RIS
 * @{
 */

#define UART_RIS_RIRMIS_Pos   0
#define UART_RIS_RIRMIS_Msk   (0x1UL << UART_RIS_RIRMIS_Pos)
#define UART_RIS_RIRMIS       UART_RIS_RIRMIS_Msk

#define UART_RIS_CTSRMIS_Pos  1
#define UART_RIS_CTSRMIS_Msk  (0x1UL << UART_RIS_CTSRMIS_Pos)
#define UART_RIS_CTSRMIS      UART_RIS_CTSRMIS_Msk

#define UART_RIS_DCDRMIS_Pos  2
#define UART_RIS_DCDRMIS_Msk  (0x1UL << UART_RIS_DCDRMIS_Pos)
#define UART_RIS_DCDRMIS      UART_RIS_DCDRMIS_Msk

#define UART_RIS_DSRRMIS_Pos  3
#define UART_RIS_DSRRMIS_Msk  (0x1UL << UART_RIS_DSRRMIS_Pos)
#define UART_RIS_DSRRMIS      UART_RIS_DSRRMIS_Msk

#define UART_RIS_RXRIS_Pos    4
#define UART_RIS_RXRIS_Msk    (0x1UL << UART_RIS_RXRIS_Pos)
#define UART_RIS_RXRIS        UART_RIS_RXRIS_Msk

#define UART_RIS_TXRIS_Pos    5
#define UART_RIS_TXRIS_Msk    (0x1UL << UART_RIS_TXRIS_Pos)
#define UART_RIS_TXRIS        UART_RIS_TXRIS_Msk

#define UART_RIS_RTRIS_Pos    6
#define UART_RIS_RTRIS_Msk    (0x1UL << UART_RIS_RTRIS_Pos)
#define UART_RIS_RTRIS        UART_RIS_RTRIS_Msk

#define UART_RIS_FERIS_Pos    7
#define UART_RIS_FERIS_Msk    (0x1UL << UART_RIS_FERIS_Pos)
#define UART_RIS_FERIS        UART_RIS_FERIS_Msk

#define UART_RIS_PERIS_Pos    8
#define UART_RIS_PERIS_Msk    (0x1UL << UART_RIS_PERIS_Pos)
#define UART_RIS_PERIS        UART_RIS_PERIS_Msk

#define UART_RIS_BERIS_Pos    9
#define UART_RIS_BERIS_Msk    (0x1UL << UART_RIS_BERIS_Pos)
#define UART_RIS_BERIS        UART_RIS_BERIS_Msk

#define UART_RIS_OERIS_Pos    10
#define UART_RIS_OERIS_Msk    (0x1UL << UART_RIS_OERIS_Pos)
#define UART_RIS_OERIS        UART_RIS_OERIS_Msk

#define UART_RIS_RNERIS_Pos   11
#define UART_RIS_RNERIS_Msk   (0x1UL << UART_RIS_RNERIS_Pos)
#define UART_RIS_RNERIS       UART_RIS_RNERIS_Msk

#define UART_RIS_TFERIS_Pos   12
#define UART_RIS_TFERIS_Msk   (0x1UL << UART_RIS_TFERIS_Pos)
#define UART_RIS_TFERIS       UART_RIS_TFERIS_Msk

#define UART_RIS_TNBSYRIS_Pos 13
#define UART_RIS_TNBSYRIS_Msk (0x1UL << UART_RIS_TNBSYRIS_Pos)
#define UART_RIS_TNBSYRIS     UART_RIS_TNBSYRIS_Msk

/** @} */ /* End of group MDR32VF0xI_UART_RIS */

/** @defgroup MDR32VF0xI_UART_MIS UART MIS
 * @{
 */

#define UART_MIS_RIMMIS_Pos   0
#define UART_MIS_RIMMIS_Msk   (0x1UL << UART_MIS_RIMMIS_Pos)
#define UART_MIS_RIMMIS       UART_MIS_RIMMIS_Msk

#define UART_MIS_CTSMMIS_Pos  1
#define UART_MIS_CTSMMIS_Msk  (0x1UL << UART_MIS_CTSMMIS_Pos)
#define UART_MIS_CTSMMIS      UART_MIS_CTSMMIS_Msk

#define UART_MIS_DCDMMIS_Pos  2
#define UART_MIS_DCDMMIS_Msk  (0x1UL << UART_MIS_DCDMMIS_Pos)
#define UART_MIS_DCDMMIS      UART_MIS_DCDMMIS_Msk

#define UART_MIS_DSRMMIS_Pos  3
#define UART_MIS_DSRMMIS_Msk  (0x1UL << UART_MIS_DSRMMIS_Pos)
#define UART_MIS_DSRMMIS      UART_MIS_DSRMMIS_Msk

#define UART_MIS_RXMIS_Pos    4
#define UART_MIS_RXMIS_Msk    (0x1UL << UART_MIS_RXMIS_Pos)
#define UART_MIS_RXMIS        UART_MIS_RXMIS_Msk

#define UART_MIS_TXMIS_Pos    5
#define UART_MIS_TXMIS_Msk    (0x1UL << UART_MIS_TXMIS_Pos)
#define UART_MIS_TXMIS        UART_MIS_TXMIS_Msk

#define UART_MIS_RTMIS_Pos    6
#define UART_MIS_RTMIS_Msk    (0x1UL << UART_MIS_RTMIS_Pos)
#define UART_MIS_RTMIS        UART_MIS_RTMIS_Msk

#define UART_MIS_FEMIS_Pos    7
#define UART_MIS_FEMIS_Msk    (0x1UL << UART_MIS_FEMIS_Pos)
#define UART_MIS_FEMIS        UART_MIS_FEMIS_Msk

#define UART_MIS_PEMIS_Pos    8
#define UART_MIS_PEMIS_Msk    (0x1UL << UART_MIS_PEMIS_Pos)
#define UART_MIS_PEMIS        UART_MIS_PEMIS_Msk

#define UART_MIS_BEMIS_Pos    9
#define UART_MIS_BEMIS_Msk    (0x1UL << UART_MIS_BEMIS_Pos)
#define UART_MIS_BEMIS        UART_MIS_BEMIS_Msk

#define UART_MIS_OEMIS_Pos    10
#define UART_MIS_OEMIS_Msk    (0x1UL << UART_MIS_OEMIS_Pos)
#define UART_MIS_OEMIS        UART_MIS_OEMIS_Msk

#define UART_MIS_RNEMIS_Pos   11
#define UART_MIS_RNEMIS_Msk   (0x1UL << UART_MIS_RNEMIS_Pos)
#define UART_MIS_RNEMIS       UART_MIS_RNEMIS_Msk

#define UART_MIS_TFEMIS_Pos   12
#define UART_MIS_TFEMIS_Msk   (0x1UL << UART_MIS_TFEMIS_Pos)
#define UART_MIS_TFEMIS       UART_MIS_TFEMIS_Msk

#define UART_MIS_TNBSYMIS_Pos 13
#define UART_MIS_TNBSYMIS_Msk (0x1UL << UART_MIS_TNBSYMIS_Pos)
#define UART_MIS_TNBSYMIS     UART_MIS_TNBSYMIS_Msk

/** @} */ /* End of group MDR32VF0xI_UART_MIS */

/** @defgroup MDR32VF0xI_UART_ICR UART ICR
 * @{
 */

#define UART_ICR_RIMIC_Pos  0
#define UART_ICR_RIMIC_Msk  (0x1UL << UART_ICR_RIMIC_Pos)
#define UART_ICR_RIMIC      UART_ICR_RIMIC_Msk

#define UART_ICR_CTSMIC_Pos 1
#define UART_ICR_CTSMIC_Msk (0x1UL << UART_ICR_CTSMIC_Pos)
#define UART_ICR_CTSMIC     UART_ICR_CTSMIC_Msk

#define UART_ICR_DCDMIC_Pos 2
#define UART_ICR_DCDMIC_Msk (0x1UL << UART_ICR_DCDMIC_Pos)
#define UART_ICR_DCDMIC     UART_ICR_DCDMIC_Msk

#define UART_ICR_DSRMIC_Pos 3
#define UART_ICR_DSRMIC_Msk (0x1UL << UART_ICR_DSRMIC_Pos)
#define UART_ICR_DSRMIC     UART_ICR_DSRMIC_Msk

#define UART_ICR_RXIC_Pos   4
#define UART_ICR_RXIC_Msk   (0x1UL << UART_ICR_RXIC_Pos)
#define UART_ICR_RXIC       UART_ICR_RXIC_Msk

#define UART_ICR_TXIC_Pos   5
#define UART_ICR_TXIC_Msk   (0x1UL << UART_ICR_TXIC_Pos)
#define UART_ICR_TXIC       UART_ICR_TXIC_Msk

