piborisovich/microcontrollers/Milandr/Libraries/CMSIS/MDR32VF0xI/DeviceSupport/inc/MDR32VF0xI.h
#define UART_ICR_RTIC_Pos   6
#define UART_ICR_RTIC_Msk   (0x1UL << UART_ICR_RTIC_Pos)
#define UART_ICR_RTIC       UART_ICR_RTIC_Msk

#define UART_ICR_FEIC_Pos   7
#define UART_ICR_FEIC_Msk   (0x1UL << UART_ICR_FEIC_Pos)
#define UART_ICR_FEIC       UART_ICR_FEIC_Msk

#define UART_ICR_PEIC_Pos   8
#define UART_ICR_PEIC_Msk   (0x1UL << UART_ICR_PEIC_Pos)
#define UART_ICR_PEIC       UART_ICR_PEIC_Msk

#define UART_ICR_BEIC_Pos   9
#define UART_ICR_BEIC_Msk   (0x1UL << UART_ICR_BEIC_Pos)
#define UART_ICR_BEIC       UART_ICR_BEIC_Msk

#define UART_ICR_OEIC_Pos   10
#define UART_ICR_OEIC_Msk   (0x1UL << UART_ICR_OEIC_Pos)
#define UART_ICR_OEIC       UART_ICR_OEIC_Msk

/** @} */ /* End of group MDR32VF0xI_UART_ICR */

/** @defgroup MDR32VF0xI_UART_DMACR UART DMACR
 * @{
 */

#define UART_DMACR_RXDMAE_Pos   0
#define UART_DMACR_RXDMAE_Msk   (0x1UL << UART_DMACR_RXDMAE_Pos)
#define UART_DMACR_RXDMAE       UART_DMACR_RXDMAE_Msk

#define UART_DMACR_TXDMAE_Pos   1
#define UART_DMACR_TXDMAE_Msk   (0x1UL << UART_DMACR_TXDMAE_Pos)
#define UART_DMACR_TXDMAE       UART_DMACR_TXDMAE_Msk

#define UART_DMACR_DMAONERR_Pos 2
#define UART_DMACR_DMAONERR_Msk (0x1UL << UART_DMACR_DMAONERR_Pos)
#define UART_DMACR_DMAONERR     UART_DMACR_DMAONERR_Msk

/** @} */ /* End of group MDR32VF0xI_UART_DMACR */

/** @defgroup MDR32VF0xI_UART_TCR UART TCR
 * @{
 */

#define UART_TCR_ITEN_Pos     0
#define UART_TCR_ITEN_Msk     (0x1UL << UART_TCR_ITEN_Pos)
#define UART_TCR_ITEN         UART_TCR_ITEN_Msk

#define UART_TCR_TESTFIFO_Pos 1
#define UART_TCR_TESTFIFO_Msk (0x1UL << UART_TCR_TESTFIFO_Pos)
#define UART_TCR_TESTFIFO     UART_TCR_TESTFIFO_Msk

#define UART_TCR_SIRTEST_Pos  2
#define UART_TCR_SIRTEST_Msk  (0x1UL << UART_TCR_SIRTEST_Pos)
#define UART_TCR_SIRTEST      UART_TCR_SIRTEST_Msk

/** @} */ /* End of group MDR32VF0xI_UART_TCR */

/** @} */ /* End of group MDR32VF0xI_UART_Defines */

/** @} */ /* End of group MDR32VF0xI_UART */

/** @defgroup MDR32VF0xI_FLASH MDR_FLASH
 * @{
 */

/**
 * @brief MDR32VF0xI FLASH control structure.
 */
typedef struct {
    __IO uint32_t CMD; /*!<FLASH Command Register */
    __IO uint32_t ADR; /*!<FLASH Address Register */
    __IO uint32_t DI;  /*!<FLASH Write Data Register */
    __I uint32_t  DO;  /*!<FLASH Read Data Register */
    __IO uint32_t KEY; /*!<FLASH Key Register */
#if defined(USE_MDR1206AFI) || defined(USE_MDR1206)
    __IO uint32_t CTRL; /*!<FLASH Control and Test Register */
#endif
#if defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)
    __IO uint32_t CHIP_ID_CTRL; /*!<FLASH Chip ID and OTP Control Register */
    __IO uint32_t OTP_KEY;      /*!<FLASH OTP Key Register */
#endif
} MDR_FLASH_TypeDef;

/** @defgroup MDR32VF0xI_FLASH_Defines FLASH Defines
 * @{
 */

/** @defgroup MDR32VF0xI_FLASH_CMD FLASH CMD
 * @{
 */

#if defined(USE_MDR32F02) || defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)

#define FLASH_CMD_CON_Pos   0
#define FLASH_CMD_CON_Msk   (0x1UL << FLASH_CMD_CON_Pos)
#define FLASH_CMD_CON       FLASH_CMD_CON_Msk

#define FLASH_CMD_ERASE_Pos 10
#define FLASH_CMD_ERASE_Msk (0x1UL << FLASH_CMD_ERASE_Pos)
#define FLASH_CMD_ERASE     FLASH_CMD_ERASE_Msk

#define FLASH_CMD_PROG_Pos  12
#define FLASH_CMD_PROG_Msk  (0x1UL << FLASH_CMD_PROG_Pos)
#define FLASH_CMD_PROG      FLASH_CMD_PROG_Msk

#endif

#if defined(USE_MDR32F02) || defined(USE_MDR1206FI) || defined(USE_MDR1206)

#define FLASH_CMD_DELAY_Pos     3
#define FLASH_CMD_DELAY_Msk     (0x7UL << FLASH_CMD_DELAY_Pos)
#define FLASH_CMD_DELAY_CYCLE_0 (0x0UL << FLASH_CMD_DELAY_Pos)
#define FLASH_CMD_DELAY_CYCLE_1 (0x1UL << FLASH_CMD_DELAY_Pos)

#define FLASH_CMD_XE_Pos        6
#define FLASH_CMD_XE_Msk        (0x1UL << FLASH_CMD_XE_Pos)
#define FLASH_CMD_XE            FLASH_CMD_XE_Msk

#define FLASH_CMD_YE_Pos        7
#define FLASH_CMD_YE_Msk        (0x1UL << FLASH_CMD_YE_Pos)
#define FLASH_CMD_YE            FLASH_CMD_YE_Msk

#define FLASH_CMD_SE_Pos        8
#define FLASH_CMD_SE_Msk        (0x1UL << FLASH_CMD_SE_Pos)
#define FLASH_CMD_SE            FLASH_CMD_SE_Msk

#define FLASH_CMD_IFREN_Pos     9
#define FLASH_CMD_IFREN_Msk     (0x1UL << FLASH_CMD_IFREN_Pos)
#define FLASH_CMD_IFREN         FLASH_CMD_IFREN_Msk

#define FLASH_CMD_MAS1_Pos      11
#define FLASH_CMD_MAS1_Msk      (0x1UL << FLASH_CMD_MAS1_Pos)
#define FLASH_CMD_MAS1          FLASH_CMD_MAS1_Msk

#define FLASH_CMD_NVSTR_Pos     13
#define FLASH_CMD_NVSTR_Msk     (0x1UL << FLASH_CMD_NVSTR_Pos)
#define FLASH_CMD_NVSTR         FLASH_CMD_NVSTR_Msk

#define FLASH_CMD_TMR_Pos       14
#define FLASH_CMD_TMR_Msk       (0x1UL << FLASH_CMD_TMR_Pos)
#define FLASH_CMD_TMR           FLASH_CMD_TMR_Msk

#endif

#if defined(USE_MDR1206AFI) || defined(USE_MDR1206)

#define FLASH_CMD_CE_Pos    6
#define FLASH_CMD_CE_Msk    (0x1UL << FLASH_CMD_CE_Pos)
#define FLASH_CMD_CE        FLASH_CMD_CE_Msk

#define FLASH_CMD_WE_Pos    7
#define FLASH_CMD_WE_Msk    (0x1UL << FLASH_CMD_WE_Pos)
#define FLASH_CMD_WE        FLASH_CMD_WE_Msk

#define FLASH_CMD_RE_Pos    8
#define FLASH_CMD_RE_Msk    (0x1UL << FLASH_CMD_RE_Pos)
#define FLASH_CMD_RE        FLASH_CMD_RE_Msk

#define FLASH_CMD_NVR_Pos   9
#define FLASH_CMD_NVR_Msk   (0x1UL << FLASH_CMD_NVR_Pos)
#define FLASH_CMD_NVR       FLASH_CMD_NVR_Msk

#define FLASH_CMD_CHIP_Pos  11
#define FLASH_CMD_CHIP_Msk  (0x1UL << FLASH_CMD_CHIP_Pos)
#define FLASH_CMD_CHIP      FLASH_CMD_CHIP_Msk

#define FLASH_CMD_PROG2_Pos 13
#define FLASH_CMD_PROG2_Msk (0x1UL << FLASH_CMD_PROG2_Pos)
#define FLASH_CMD_PROG2     FLASH_CMD_PROG2_Msk

#define FLASH_CMD_TMEN_Pos  14
#define FLASH_CMD_TMEN_Msk  (0x1UL << FLASH_CMD_TMEN_Pos)
#define FLASH_CMD_TMEN      FLASH_CMD_TMEN_Msk

#endif

/** @} */ /* End of group MDR32VF0xI_FLASH_CMD */

/** @defgroup MDR32VF0xI_FLASH_ADR FLASH ADR
 * @{
 */

#if defined(USE_MDR32F02) || defined(USE_MDR1206FI) || defined(USE_MDR1206)

#define FLASH_ADR_YADR_Pos           2
#define FLASH_ADR_YADR_Msk           (0x7FUL << FLASH_ADR_YADR_Pos)

#define FLASH_ADR_XADR_Pos           9

#define FLASH_ADR_XADR_ROW_Pos       FLASH_ADR_XADR_Pos
#define FLASH_ADR_XADR_ROW_Msk       (0x7UL << FLASH_ADR_XADR_ROW_Pos)

#define FLASH_ADR_INFO_XADR_Pos      FLASH_ADR_XADR_Pos
#define FLASH_ADR_INFO_XADR_Msk      (0xFUL << FLASH_ADR_INFO_XADR_Pos)

#define FLASH_ADR_INFO_XADR_PAGE_Pos 12
#define FLASH_ADR_INFO_XADR_PAGE_Msk (0x1UL << FLASH_ADR_INFO_XADR_PAGE_Pos)

#define FLASH_ADR_MAIN_XADR_Pos      FLASH_ADR_XADR_Pos
#define FLASH_ADR_MAIN_XADR_Msk      (0x1FFUL << FLASH_ADR_MAIN_XADR_Pos)

#define FLASH_ADR_MAIN_XADR_PAGE_Pos 12
#define FLASH_ADR_MAIN_XADR_PAGE_Msk (0x3FUL << FLASH_ADR_MAIN_XADR_PAGE_Pos)

#endif

#if defined(USE_MDR1206FI) || defined(USE_MDR1206)

#define FLASH_ADR_INFO_BLOCK_Pos 13
#define FLASH_ADR_INFO_BLOCK_Msk (0x1UL << FLASH_ADR_INFO_BLOCK_Pos)
#define FLASH_ADR_INFO_BLOCK_0   (0x0UL << FLASH_ADR_INFO_BLOCK_Pos)
#define FLASH_ADR_INFO_BLOCK_1   (0x1UL << FLASH_ADR_INFO_BLOCK_Pos)

#define FLASH_ADR_MAIN_BLOCK_Pos 18
#define FLASH_ADR_MAIN_BLOCK_Msk (0x1UL << FLASH_ADR_MAIN_BLOCK_Pos)
#define FLASH_ADR_MAIN_BLOCK_0   (0x0UL << FLASH_ADR_MAIN_BLOCK_Pos)
#define FLASH_ADR_MAIN_BLOCK_1   (0x1UL << FLASH_ADR_MAIN_BLOCK_Pos)

#endif

#if defined(USE_MDR1206AFI) || defined(USE_MDR1206)

#define FLASH_ADR_WORD_Pos        2
#define FLASH_ADR_WORD_Msk        (0x1FUL << FLASH_ADR_WORD_Pos)

