piborisovich/microcontrollers/Milandr/Libraries/CMSIS/MDR32VF0xI/DeviceSupport/inc/MDR32VF0xI.h
#define FLASH_ADR_ROW_Pos         7
#define FLASH_ADR_ROW_Msk         (0x3UL << FLASH_ADR_ROW_Pos)

#define FLASH_ADR_PAGE_Pos        9

#define FLASH_ADR_INFO_PAGE_Pos   FLASH_ADR_PAGE_Pos
#define FLASH_ADR_INFO_PAGE_Msk   (0xFUL << FLASH_ADR_INFO_PAGE_Pos)

#define FLASH_ADR_MAIN_PAGE_Pos   FLASH_ADR_PAGE_Pos
#define FLASH_ADR_MAIN_PAGE_Msk   (0x1FFUL << FLASH_ADR_MAIN_PAGE_Pos)

#define FLASH_ADR_INFO_SECTOR_Pos 13
#define FLASH_ADR_INFO_SECTOR_Msk (0x1UL << FLASH_ADR_INFO_SECTOR_Pos)
#define FLASH_ADR_INFO_SECTOR_A   (0x0UL << FLASH_ADR_INFO_SECTOR_Pos)
#define FLASH_ADR_INFO_SECTOR_B   (0x1UL << FLASH_ADR_INFO_SECTOR_Pos)

#define FLASH_ADR_MAIN_SECTOR_Pos 18
#define FLASH_ADR_MAIN_SECTOR_Msk (0x1UL << FLASH_ADR_MAIN_SECTOR_Pos)
#define FLASH_ADR_MAIN_SECTOR_A   (0x0UL << FLASH_ADR_MAIN_SECTOR_Pos)
#define FLASH_ADR_MAIN_SECTOR_B   (0x1UL << FLASH_ADR_MAIN_SECTOR_Pos)

#endif

/** @} */ /* End of group MDR32VF0xI_FLASH_ADR */

/** @defgroup MDR32VF0xI_FLASH_DI FLASH DI
 * @{
 */

#define FLASH_DI_DATA_Pos 0
#define FLASH_DI_DATA_Msk (0xFFFFFFFFUL << FLASH_DI_DATA_Pos)

/** @} */ /* End of group MDR32VF0xI_FLASH_DI */

/** @defgroup MDR32VF0xI_FLASH_DO FLASH DO
 * @{
 */

#define FLASH_DO_DATA_Pos 0
#define FLASH_DO_DATA_Msk (0xFFFFFFFFUL << FLASH_DO_DATA_Pos)

/** @} */ /* End of group MDR32VF0xI_FLASH_DO */

/** @defgroup MDR32VF0xI_FLASH_KEY FLASH KEY
 * @{
 */

#define FLASH_KEY_KEY_Pos    0
#define FLASH_KEY_KEY_Msk    (0xFFFFFFFFUL << FLASH_KEY_KEY_Pos)
#define FLASH_KEY_KEY_LOCK   (0x00000000UL)
#define FLASH_KEY_KEY_UNLOCK (0x8AAA5551UL)

/** @} */ /* End of group MDR32VF0xI_FLASH_KEY */

#if defined(USE_MDR1206AFI) || defined(USE_MDR1206)

/** @defgroup MDR32VF0xI_FLASH_CTRL FLASH CTRL
 * @{
 */

#define FLASH_CTRL_BYTE_Pos   0
#define FLASH_CTRL_BYTE_Msk   (0xFUL << FLASH_CTRL_BYTE_Pos)
#define FLASH_CTRL_BYTE_0     (0x1UL << FLASH_CTRL_BYTE_Pos)
#define FLASH_CTRL_BYTE_1     (0x2UL << FLASH_CTRL_BYTE_Pos)
#define FLASH_CTRL_BYTE_2     (0x4UL << FLASH_CTRL_BYTE_Pos)
#define FLASH_CTRL_BYTE_3     (0x8UL << FLASH_CTRL_BYTE_Pos)

#define FLASH_CTRL_CONFEN_Pos 4
#define FLASH_CTRL_CONFEN_Msk (0x1UL << FLASH_CTRL_CONFEN_Pos)
#define FLASH_CTRL_CONFEN     FLASH_CTRL_CONFEN_Msk

#define FLASH_CTRL_READM0_Pos 5
#define FLASH_CTRL_READM0_Msk (0x1UL << FLASH_CTRL_READM0_Pos)
#define FLASH_CTRL_READM0     FLASH_CTRL_READM0_Msk

#define FLASH_CTRL_READM1_Pos 6
#define FLASH_CTRL_READM1_Msk (0x1UL << FLASH_CTRL_READM1_Pos)
#define FLASH_CTRL_READM1     FLASH_CTRL_READM1_Msk

#define FLASH_CTRL_READCF_Pos 7
#define FLASH_CTRL_READCF_Msk (0x1UL << FLASH_CTRL_READCF_Pos)
#define FLASH_CTRL_READCF     FLASH_CTRL_READCF_Msk

#define FLASH_CTRL_RCELL_Pos  8
#define FLASH_CTRL_RCELL_Msk  (0x1UL << FLASH_CTRL_RCELL_Pos)
#define FLASH_CTRL_RCELL      FLASH_CTRL_RCELL_Msk

#define FLASH_CTRL_TERS_Pos   9
#define FLASH_CTRL_TERS_Msk   (0x1UL << FLASH_CTRL_TERS_Pos)
#define FLASH_CTRL_TERS       FLASH_CTRL_TERS_Msk

/** @} */ /* End of group MDR32VF0xI_FLASH_CTRL */

#endif

#if defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)

/** @defgroup MDR32VF0xI_FLASH_CHIP_ID_CTRL FLASH CHIP_ID_CTRL
 * @{
 */

#define FLASH_CHIP_ID_CTRL_OTP_PROG_Pos 0
#define FLASH_CHIP_ID_CTRL_OTP_PROG_Msk (0x1UL << FLASH_CHIP_ID_CTRL_OTP_PROG_Pos)
#define FLASH_CHIP_ID_CTRL_OTP_PROG     FLASH_CHIP_ID_CTRL_OTP_PROG_Msk

#define FLASH_CHIP_ID_CTRL_OTPTST2_Pos  1
#define FLASH_CHIP_ID_CTRL_OTPTST2_Msk  (0x1UL << FLASH_CHIP_ID_CTRL_OTPTST2_Pos)
#define FLASH_CHIP_ID_CTRL_OTPTST2      FLASH_CHIP_ID_CTRL_OTPTST2_Msk

#define FLASH_CHIP_ID_CTRL_CHIP_ID_Pos  2
#define FLASH_CHIP_ID_CTRL_CHIP_ID_Msk  (0xFFUL << FLASH_CHIP_ID_CTRL_CHIP_ID_Pos)
#define FLASH_CHIP_ID_CTRL_CHIP_ID217   (0xD9UL << FLASH_CHIP_ID_CTRL_CHIP_ID_Pos)
#define FLASH_CHIP_ID_CTRL_CHIP_ID215   (0xD7UL << FLASH_CHIP_ID_CTRL_CHIP_ID_Pos)

/** @} */ /* End of group MDR32VF0xI_FLASH_CHIP_ID_CTRL */

/** @defgroup MDR32VF0xI_FLASH_OTP_KEY FLASH OTP_KEY
 * @{
 */

#define FLASH_OTP_KEY_OTP_KEY_Pos    0
#define FLASH_OTP_KEY_OTP_KEY_Msk    (0xFFFFFFFFUL << FLASH_OTP_KEY_OTP_KEY_Pos)
#define FLASH_OTP_KEY_OTP_KEY_LOCK   (0x00000000UL)
#define FLASH_OTP_KEY_OTP_KEY_UNLOCK (0x1555AAA8UL)

/** @} */ /* End of group MDR32VF0xI_FLASH_OTP_KEY */

#endif

/** @} */ /* End of group MDR32VF0xI_FLASH_Defines */

/** @} */ /* End of group MDR32VF0xI_FLASH */

#if defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)

/** @defgroup MDR32VF0xI_FLASH_SPECIAL_FIELDS MDR_FLASH_SPECIAL_FIELDS
 * @{
 */

/**
 * @brief MDR32VF0xI FLASH_SPECIAL_FIELDS structure.
 */
typedef struct {
    __I uint32_t UNIQUE_ID[5]; /*!<FLASH_SPECIAL_FIELDS Unique Chip Identifier Fields */
    __I uint8_t  TRIM_HSI;     /*!<FLASH_SPECIAL_FIELDS HSI and LSI Trimming Field */
    __I uint8_t  TRIM_BG;      /*!<FLASH_SPECIAL_FIELDS BandGap Reference Voltage Trimming Field */
    __I uint8_t  TRIM_LDO;     /*!<FLASH_SPECIAL_FIELDS LDO Reference Voltage Trimming Field */
    __I uint8_t  TRIM_TS;      /*!<FLASH_SPECIAL_FIELDS TS Voltage Offset Field */
    __I uint8_t  TRIM_CS;      /*!<FLASH_SPECIAL_FIELDS Checksum Field */
    __I uint8_t  RESERVED0[3];
    __I uint32_t PROTECTION; /*!<FLASH_SPECIAL_FIELDS Flash Protection Word Field */
} MDR_FLASH_SpecialFields_TypeDef;

/** @defgroup MDR32VF0xI_FLASH_SPECIAL_FIELDS_Defines FLASH_SPECIAL_FIELDS Defines
 * @{
 */

/** @defgroup MDR32VF0xI_FLASH_SPECIAL_FIELDS_UNIQUE_ID FLASH_SPECIAL_FIELDS UNIQUE_ID
 * @{
 */

#define FLASH_SPECIAL_FIELDS_UNIQUE_IDx_UNIQUE_ID_Pos 0
#define FLASH_SPECIAL_FIELDS_UNIQUE_IDx_UNIQUE_ID_Msk (0xFFFFFFFFUL << FLASH_SPECIAL_FIELDS_UNIQUE_IDx_UNIQUE_ID_Pos)

/** @} */ /* End of group MDR32VF0xI_FLASH_SPECIAL_FIELDS_UNIQUE_ID */

/** @defgroup MDR32VF0xI_FLASH_SPECIAL_FIELDS_TRIM_HSI FLASH_SPECIAL_FIELDS TRIM_HSI
 * @{
 */

#define FLASH_SPECIAL_FIELDS_TRIM_HSI_TRIM_HSI_Pos 0
#define FLASH_SPECIAL_FIELDS_TRIM_HSI_TRIM_HSI_Msk (0xFFUL << FLASH_SPECIAL_FIELDS_TRIM_HSI_TRIM_HSI_Pos)

/** @} */ /* End of group MDR32VF0xI_FLASH_SPECIAL_FIELDS_TRIM_HSI */

/** @defgroup MDR32VF0xI_FLASH_SPECIAL_FIELDS_TRIM_BG FLASH_SPECIAL_FIELDS TRIM_BG
 * @{
 */

#define FLASH_SPECIAL_FIELDS_TRIM_BG_TRIM_BG_Pos 0
#define FLASH_SPECIAL_FIELDS_TRIM_BG_TRIM_BG_Msk (0xFFUL << FLASH_SPECIAL_FIELDS_TRIM_BG_TRIM_BG_Pos)

/** @} */ /* End of group MDR32VF0xI_FLASH_SPECIAL_FIELDS_TRIM_BG */

/** @defgroup MDR32VF0xI_FLASH_SPECIAL_FIELDS_TRIM_LDO FLASH_SPECIAL_FIELDS TRIM_LDO
 * @{
 */

#define FLASH_SPECIAL_FIELDS_TRIM_LDO_TRIM_LDO_Pos 0
#define FLASH_SPECIAL_FIELDS_TRIM_LDO_TRIM_LDO_Msk (0xFFUL << FLASH_SPECIAL_FIELDS_TRIM_LDO_TRIM_LDO_Pos)

/** @} */ /* End of group MDR32VF0xI_FLASH_SPECIAL_FIELDS_TRIM_LDO */

