piborisovich/microcontrollers/Milandr/Libraries/CMSIS/MDR32VF0xI/DeviceSupport/inc/MDR32VF0xI.h
/** @defgroup MDR32VF0xI_FLASH_SPECIAL_FIELDS_TRIM_TS FLASH_SPECIAL_FIELDS TRIM_TS
 * @{
 */

#define FLASH_SPECIAL_FIELDS_TRIM_TS_TRIM_TS_Pos 0
#define FLASH_SPECIAL_FIELDS_TRIM_TS_TRIM_TS_Msk (0xFFUL << FLASH_SPECIAL_FIELDS_TRIM_TS_TRIM_TS_Pos)

/** @} */ /* End of group MDR32VF0xI_FLASH_SPECIAL_FIELDS_TRIM_TS */

/** @defgroup MDR32VF0xI_FLASH_SPECIAL_FIELDS_TRIM_CS FLASH_SPECIAL_FIELDS TRIM_CS
 * @{
 */

#define FLASH_SPECIAL_FIELDS_TRIM_CS_TRIM_CS_Pos 0
#define FLASH_SPECIAL_FIELDS_TRIM_CS_TRIM_CS_Msk (0xFFUL << FLASH_SPECIAL_FIELDS_TRIM_CS_TRIM_CS_Pos)

/** @} */ /* End of group MDR32VF0xI_FLASH_SPECIAL_FIELDS_TRIM_CS */

/** @defgroup MDR32VF0xI_FLASH_SPECIAL_FIELDS_PROTECTION FLASH_SPECIAL_FIELDS PROTECTION
 * @{
 */

#define FLASH_SPECIAL_FIELDS_PROTECTION_REGIONS_Pos 0
#define FLASH_SPECIAL_FIELDS_PROTECTION_REGIONS_Msk (0xFFUL << FLASH_SPECIAL_FIELDS_PROTECTION_REGIONS_Pos)

#define FLASH_SPECIAL_FIELDS_PROTECTION_KEY_Pos     8
#define FLASH_SPECIAL_FIELDS_PROTECTION_KEY_Msk     (0xFFFFFFUL << FLASH_SPECIAL_FIELDS_PROTECTION_KEY_Pos)
#define FLASH_SPECIAL_FIELDS_PROTECTION_KEY_LOCK    (0xFFFFFFUL << FLASH_SPECIAL_FIELDS_PROTECTION_KEY_Pos)
#define FLASH_SPECIAL_FIELDS_PROTECTION_KEY_UNLOCK  (0x1234BCUL << FLASH_SPECIAL_FIELDS_PROTECTION_KEY_Pos)

/** @} */ /* End of group MDR32VF0xI_FLASH_SPECIAL_FIELDS_PROTECTION */

/** @} */ /* End of group MDR32VF0xI_FLASH_SPECIAL_FIELDS_Defines */

/** @} */ /* End of group MDR32VF0xI_FLASH_SPECIAL_FIELDS */

#endif

/** @defgroup MDR32VF0xI_RST_CLK MDR_RST_CLK
 * @{
 */

/**
 * @brief MDR32VF0xI RST_CLK control structure.
 */
typedef struct {
    __I uint32_t  CLOCK_STATUS; /*!<RST_CLK Clock Status Register */
    __IO uint32_t PLL_CONTROL;  /*!<RST_CLK PLL Control Register */
    __IO uint32_t HS_CONTROL;   /*!<RST_CLK HS Control Register */
    __IO uint32_t CPU_CLOCK;    /*!<RST_CLK CPU Clock Register */
    __IO uint32_t PER1_CLOCK;   /*!<RST_CLK PER1 Clock Register */
    __IO uint32_t ADC_CLOCK;    /*!<RST_CLK ADC Clock Register */
    __IO uint32_t RTC_CLOCK;    /*!<RST_CLK RTC Clock Register */
    __IO uint32_t PER2_CLOCK;   /*!<RST_CLK Peripheral Clock Enable Register */
#if defined(USE_MDR32F02_REV_1X)
    __I uint32_t RESERVED0; /*!<Reserved */
#else
    __IO uint32_t DMA_DONE_STICK; /*!<DMA_DONE Fixation Register */
#endif
    __IO uint32_t TIM_CLOCK;  /*!<RST_CLK Timer Clock Register */
    __IO uint32_t UART_CLOCK; /*!<RST_CLK UART Clock Register */
    __IO uint32_t SSP_CLOCK;  /*!<RST_CLK SSP Clock Register */
#if defined(USE_MDR32F02_REV_2) || defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)
    __IO uint32_t DIV_SYS_TIM; /*!<Machine Timer Prescaler Register */
#endif
} MDR_RST_CLK_TypeDef;

/** @defgroup MDR32VF0xI_RST_CLK_Defines RST_CLK Defines
 * @{
 */

/** @defgroup MDR32VF0xI_RST_CLK_CLOCK_STATUS RST_CLK CLOCK_STATUS
 * @{
 */

#define RST_CLK_CLOCK_STATUS_PLL_CPU_RDY_Pos 1
#define RST_CLK_CLOCK_STATUS_PLL_CPU_RDY_Msk (0x1UL << RST_CLK_CLOCK_STATUS_PLL_CPU_RDY_Pos)
#define RST_CLK_CLOCK_STATUS_PLL_CPU_RDY     RST_CLK_CLOCK_STATUS_PLL_CPU_RDY_Msk

#define RST_CLK_CLOCK_STATUS_HSE_RDY_Pos     2
#define RST_CLK_CLOCK_STATUS_HSE_RDY_Msk     (0x1UL << RST_CLK_CLOCK_STATUS_HSE_RDY_Pos)
#define RST_CLK_CLOCK_STATUS_HSE_RDY         RST_CLK_CLOCK_STATUS_HSE_RDY_Msk

/** @} */ /* End of group MDR32VF0xI_RST_CLK_CLOCK_STATUS */

/** @defgroup MDR32VF0xI_RST_CLK_PLL_CONTROL RST_CLK PLL_CONTROL
 * @{
 */

#define RST_CLK_PLL_CONTROL_PLL_CPU_ON_Pos  2
#define RST_CLK_PLL_CONTROL_PLL_CPU_ON_Msk  (0x1UL << RST_CLK_PLL_CONTROL_PLL_CPU_ON_Pos)
#define RST_CLK_PLL_CONTROL_PLL_CPU_ON      RST_CLK_PLL_CONTROL_PLL_CPU_ON_Msk

#define RST_CLK_PLL_CONTROL_PLL_CPU_SEL_Pos 3
#define RST_CLK_PLL_CONTROL_PLL_CPU_SEL_Msk (0x1UL << RST_CLK_PLL_CONTROL_PLL_CPU_SEL_Pos)
#define RST_CLK_PLL_CONTROL_PLL_CPU_SEL     RST_CLK_PLL_CONTROL_PLL_CPU_SEL_Msk

#define RST_CLK_PLL_CONTROL_PLL_CPU_MUL_Pos 8
#define RST_CLK_PLL_CONTROL_PLL_CPU_MUL_Msk (0x7UL << RST_CLK_PLL_CONTROL_PLL_CPU_MUL_Pos)

/** @} */ /* End of group MDR32VF0xI_RST_CLK_PLL_CONTROL */

/** @defgroup MDR32VF0xI_RST_CLK_HS_CONTROL RST_CLK HS_CONTROL
 * @{
 */

#define RST_CLK_HS_CONTROL_HSE_ON_Pos  0
#define RST_CLK_HS_CONTROL_HSE_ON_Msk  (0x1UL << RST_CLK_HS_CONTROL_HSE_ON_Pos)
#define RST_CLK_HS_CONTROL_HSE_ON      RST_CLK_HS_CONTROL_HSE_ON_Msk

#define RST_CLK_HS_CONTROL_HSE_BYP_Pos 1
#define RST_CLK_HS_CONTROL_HSE_BYP_Msk (0x1UL << RST_CLK_HS_CONTROL_HSE_BYP_Pos)
#define RST_CLK_HS_CONTROL_HSE_BYP     RST_CLK_HS_CONTROL_HSE_BYP_Msk

/** @} */ /* End of group MDR32VF0xI_RST_CLK_HS_CONTROL */

/** @defgroup MDR32VF0xI_RST_CLK_CPU_CLOCK RST_CLK CPU_CLOCK
 * @{
 */

#define RST_CLK_CPU_CLOCK_CPU_C1_SEL_Pos       0
#define RST_CLK_CPU_CLOCK_CPU_C1_SEL_Msk       (0x3UL << RST_CLK_CPU_CLOCK_CPU_C1_SEL_Pos)
#define RST_CLK_CPU_CLOCK_CPU_C1_SEL_HSI       (0x0UL << RST_CLK_CPU_CLOCK_CPU_C1_SEL_Pos)
#define RST_CLK_CPU_CLOCK_CPU_C1_SEL_HSI_DIV_2 (0x1UL << RST_CLK_CPU_CLOCK_CPU_C1_SEL_Pos)
#define RST_CLK_CPU_CLOCK_CPU_C1_SEL_HSE       (0x2UL << RST_CLK_CPU_CLOCK_CPU_C1_SEL_Pos)
#define RST_CLK_CPU_CLOCK_CPU_C1_SEL_HSE_DIV_2 (0x3UL << RST_CLK_CPU_CLOCK_CPU_C1_SEL_Pos)

#define RST_CLK_CPU_CLOCK_CPU_C2_SEL_Pos       2
#define RST_CLK_CPU_CLOCK_CPU_C2_SEL_Msk       (0x1UL << RST_CLK_CPU_CLOCK_CPU_C2_SEL_Pos)
#define RST_CLK_CPU_CLOCK_CPU_C2_SEL           RST_CLK_CPU_CLOCK_CPU_C2_SEL_Msk

#define RST_CLK_CPU_CLOCK_CPU_C3_SEL_Pos       4
#define RST_CLK_CPU_CLOCK_CPU_C3_SEL_Msk       (0xFUL << RST_CLK_CPU_CLOCK_CPU_C3_SEL_Pos)

#define RST_CLK_CPU_CLOCK_HCLK_SEL_Pos         8
#define RST_CLK_CPU_CLOCK_HCLK_SEL_Msk         (0x3UL << RST_CLK_CPU_CLOCK_HCLK_SEL_Pos)
#define RST_CLK_CPU_CLOCK_HCLK_SEL_HSI         (0x0UL << RST_CLK_CPU_CLOCK_HCLK_SEL_Pos)
#define RST_CLK_CPU_CLOCK_HCLK_SEL_CPU_C3      (0x1UL << RST_CLK_CPU_CLOCK_HCLK_SEL_Pos)
#define RST_CLK_CPU_CLOCK_HCLK_SEL_LSE         (0x2UL << RST_CLK_CPU_CLOCK_HCLK_SEL_Pos)
#define RST_CLK_CPU_CLOCK_HCLK_SEL_LSI         (0x3UL << RST_CLK_CPU_CLOCK_HCLK_SEL_Pos)

