piborisovich/microcontrollers/Milandr/Libraries/CMSIS/MDR32VF0xI/DeviceSupport/inc/MDR32VF0xI.h
#define RST_CLK_TIM_CLOCK_TIM3_BRG_Pos     16
#define RST_CLK_TIM_CLOCK_TIM3_BRG_Msk     (0x7UL << RST_CLK_TIM_CLOCK_TIM3_BRG_Pos)
#define RST_CLK_TIM_CLOCK_TIM3_BRG_DIV_1   (0x0UL << RST_CLK_TIM_CLOCK_TIM3_BRG_Pos)
#define RST_CLK_TIM_CLOCK_TIM3_BRG_DIV_2   (0x1UL << RST_CLK_TIM_CLOCK_TIM3_BRG_Pos)
#define RST_CLK_TIM_CLOCK_TIM3_BRG_DIV_4   (0x2UL << RST_CLK_TIM_CLOCK_TIM3_BRG_Pos)
#define RST_CLK_TIM_CLOCK_TIM3_BRG_DIV_8   (0x3UL << RST_CLK_TIM_CLOCK_TIM3_BRG_Pos)
#define RST_CLK_TIM_CLOCK_TIM3_BRG_DIV_16  (0x4UL << RST_CLK_TIM_CLOCK_TIM3_BRG_Pos)
#define RST_CLK_TIM_CLOCK_TIM3_BRG_DIV_32  (0x5UL << RST_CLK_TIM_CLOCK_TIM3_BRG_Pos)
#define RST_CLK_TIM_CLOCK_TIM3_BRG_DIV_64  (0x6UL << RST_CLK_TIM_CLOCK_TIM3_BRG_Pos)
#define RST_CLK_TIM_CLOCK_TIM3_BRG_DIV_128 (0x7UL << RST_CLK_TIM_CLOCK_TIM3_BRG_Pos)

#define RST_CLK_TIM_CLOCK_TIM4_BRG_Pos     19
#define RST_CLK_TIM_CLOCK_TIM4_BRG_Msk     (0x7UL << RST_CLK_TIM_CLOCK_TIM4_BRG_Pos)
#define RST_CLK_TIM_CLOCK_TIM4_BRG_DIV_1   (0x0UL << RST_CLK_TIM_CLOCK_TIM4_BRG_Pos)
#define RST_CLK_TIM_CLOCK_TIM4_BRG_DIV_2   (0x1UL << RST_CLK_TIM_CLOCK_TIM4_BRG_Pos)
#define RST_CLK_TIM_CLOCK_TIM4_BRG_DIV_4   (0x2UL << RST_CLK_TIM_CLOCK_TIM4_BRG_Pos)
#define RST_CLK_TIM_CLOCK_TIM4_BRG_DIV_8   (0x3UL << RST_CLK_TIM_CLOCK_TIM4_BRG_Pos)
#define RST_CLK_TIM_CLOCK_TIM4_BRG_DIV_16  (0x4UL << RST_CLK_TIM_CLOCK_TIM4_BRG_Pos)
#define RST_CLK_TIM_CLOCK_TIM4_BRG_DIV_32  (0x5UL << RST_CLK_TIM_CLOCK_TIM4_BRG_Pos)
#define RST_CLK_TIM_CLOCK_TIM4_BRG_DIV_64  (0x6UL << RST_CLK_TIM_CLOCK_TIM4_BRG_Pos)
#define RST_CLK_TIM_CLOCK_TIM4_BRG_DIV_128 (0x7UL << RST_CLK_TIM_CLOCK_TIM4_BRG_Pos)

#define RST_CLK_TIM_CLOCK_TIM1_CLK_EN_Pos  24
#define RST_CLK_TIM_CLOCK_TIM1_CLK_EN_Msk  (0x1UL << RST_CLK_TIM_CLOCK_TIM1_CLK_EN_Pos)
#define RST_CLK_TIM_CLOCK_TIM1_CLK_EN      RST_CLK_TIM_CLOCK_TIM1_CLK_EN_Msk

#define RST_CLK_TIM_CLOCK_TIM2_CLK_EN_Pos  25
#define RST_CLK_TIM_CLOCK_TIM2_CLK_EN_Msk  (0x1UL << RST_CLK_TIM_CLOCK_TIM2_CLK_EN_Pos)
#define RST_CLK_TIM_CLOCK_TIM2_CLK_EN      RST_CLK_TIM_CLOCK_TIM2_CLK_EN_Msk

#define RST_CLK_TIM_CLOCK_TIM3_CLK_EN_Pos  26
#define RST_CLK_TIM_CLOCK_TIM3_CLK_EN_Msk  (0x1UL << RST_CLK_TIM_CLOCK_TIM3_CLK_EN_Pos)
#define RST_CLK_TIM_CLOCK_TIM3_CLK_EN      RST_CLK_TIM_CLOCK_TIM3_CLK_EN_Msk

#define RST_CLK_TIM_CLOCK_TIM4_CLK_EN_Pos  27
#define RST_CLK_TIM_CLOCK_TIM4_CLK_EN_Msk  (0x1UL << RST_CLK_TIM_CLOCK_TIM4_CLK_EN_Pos)
#define RST_CLK_TIM_CLOCK_TIM4_CLK_EN      RST_CLK_TIM_CLOCK_TIM4_CLK_EN_Msk

/** @} */ /* End of group MDR32VF0xI_RST_CLK_TIM_CLOCK */

/** @defgroup MDR32VF0xI_RST_CLK_UART_CLOCK RST_CLK UART_CLOCK
 * @{
 */

#define RST_CLK_UART_CLOCK_UART1_BRG_Pos     0
#define RST_CLK_UART_CLOCK_UART1_BRG_Msk     (0x7UL << RST_CLK_UART_CLOCK_UART1_BRG_Pos)
#define RST_CLK_UART_CLOCK_UART1_BRG_DIV_1   (0x0UL << RST_CLK_UART_CLOCK_UART1_BRG_Pos)
#define RST_CLK_UART_CLOCK_UART1_BRG_DIV_2   (0x1UL << RST_CLK_UART_CLOCK_UART1_BRG_Pos)
#define RST_CLK_UART_CLOCK_UART1_BRG_DIV_4   (0x2UL << RST_CLK_UART_CLOCK_UART1_BRG_Pos)
#define RST_CLK_UART_CLOCK_UART1_BRG_DIV_8   (0x3UL << RST_CLK_UART_CLOCK_UART1_BRG_Pos)
#define RST_CLK_UART_CLOCK_UART1_BRG_DIV_16  (0x4UL << RST_CLK_UART_CLOCK_UART1_BRG_Pos)
#define RST_CLK_UART_CLOCK_UART1_BRG_DIV_32  (0x5UL << RST_CLK_UART_CLOCK_UART1_BRG_Pos)
#define RST_CLK_UART_CLOCK_UART1_BRG_DIV_64  (0x6UL << RST_CLK_UART_CLOCK_UART1_BRG_Pos)
#define RST_CLK_UART_CLOCK_UART1_BRG_DIV_128 (0x7UL << RST_CLK_UART_CLOCK_UART1_BRG_Pos)

#define RST_CLK_UART_CLOCK_UART2_BRG_Pos     8
#define RST_CLK_UART_CLOCK_UART2_BRG_Msk     (0x7UL << RST_CLK_UART_CLOCK_UART2_BRG_Pos)
#define RST_CLK_UART_CLOCK_UART2_BRG_DIV_1   (0x0UL << RST_CLK_UART_CLOCK_UART2_BRG_Pos)
#define RST_CLK_UART_CLOCK_UART2_BRG_DIV_2   (0x1UL << RST_CLK_UART_CLOCK_UART2_BRG_Pos)
#define RST_CLK_UART_CLOCK_UART2_BRG_DIV_4   (0x2UL << RST_CLK_UART_CLOCK_UART2_BRG_Pos)
#define RST_CLK_UART_CLOCK_UART2_BRG_DIV_8   (0x3UL << RST_CLK_UART_CLOCK_UART2_BRG_Pos)
#define RST_CLK_UART_CLOCK_UART2_BRG_DIV_16  (0x4UL << RST_CLK_UART_CLOCK_UART2_BRG_Pos)
#define RST_CLK_UART_CLOCK_UART2_BRG_DIV_32  (0x5UL << RST_CLK_UART_CLOCK_UART2_BRG_Pos)
#define RST_CLK_UART_CLOCK_UART2_BRG_DIV_64  (0x6UL << RST_CLK_UART_CLOCK_UART2_BRG_Pos)
#define RST_CLK_UART_CLOCK_UART2_BRG_DIV_128 (0x7UL << RST_CLK_UART_CLOCK_UART2_BRG_Pos)

#define RST_CLK_UART_CLOCK_UART3_BRG_Pos     16
#define RST_CLK_UART_CLOCK_UART3_BRG_Msk     (0x7UL << RST_CLK_UART_CLOCK_UART3_BRG_Pos)
#define RST_CLK_UART_CLOCK_UART3_BRG_DIV_1   (0x0UL << RST_CLK_UART_CLOCK_UART3_BRG_Pos)
#define RST_CLK_UART_CLOCK_UART3_BRG_DIV_2   (0x1UL << RST_CLK_UART_CLOCK_UART3_BRG_Pos)
#define RST_CLK_UART_CLOCK_UART3_BRG_DIV_4   (0x2UL << RST_CLK_UART_CLOCK_UART3_BRG_Pos)
#define RST_CLK_UART_CLOCK_UART3_BRG_DIV_8   (0x3UL << RST_CLK_UART_CLOCK_UART3_BRG_Pos)
#define RST_CLK_UART_CLOCK_UART3_BRG_DIV_16  (0x4UL << RST_CLK_UART_CLOCK_UART3_BRG_Pos)
#define RST_CLK_UART_CLOCK_UART3_BRG_DIV_32  (0x5UL << RST_CLK_UART_CLOCK_UART3_BRG_Pos)
#define RST_CLK_UART_CLOCK_UART3_BRG_DIV_64  (0x6UL << RST_CLK_UART_CLOCK_UART3_BRG_Pos)
#define RST_CLK_UART_CLOCK_UART3_BRG_DIV_128 (0x7UL << RST_CLK_UART_CLOCK_UART3_BRG_Pos)

#define RST_CLK_UART_CLOCK_UART1_CLK_EN_Pos  24
#define RST_CLK_UART_CLOCK_UART1_CLK_EN_Msk  (0x1UL << RST_CLK_UART_CLOCK_UART1_CLK_EN_Pos)
#define RST_CLK_UART_CLOCK_UART1_CLK_EN      RST_CLK_UART_CLOCK_UART1_CLK_EN_Msk

#define RST_CLK_UART_CLOCK_UART2_CLK_EN_Pos  25
#define RST_CLK_UART_CLOCK_UART2_CLK_EN_Msk  (0x1UL << RST_CLK_UART_CLOCK_UART2_CLK_EN_Pos)
#define RST_CLK_UART_CLOCK_UART2_CLK_EN      RST_CLK_UART_CLOCK_UART2_CLK_EN_Msk

#define RST_CLK_UART_CLOCK_UART3_CLK_EN_Pos  26
#define RST_CLK_UART_CLOCK_UART3_CLK_EN_Msk  (0x1UL << RST_CLK_UART_CLOCK_UART3_CLK_EN_Pos)
#define RST_CLK_UART_CLOCK_UART3_CLK_EN      RST_CLK_UART_CLOCK_UART3_CLK_EN_Msk

#define RST_CLK_UART_CLOCK_UART4_BRG_Pos     27
#define RST_CLK_UART_CLOCK_UART4_BRG_Msk     (0x7UL << RST_CLK_UART_CLOCK_UART4_BRG_Pos)
#define RST_CLK_UART_CLOCK_UART4_BRG_DIV_1   (0x0UL << RST_CLK_UART_CLOCK_UART4_BRG_Pos)
#define RST_CLK_UART_CLOCK_UART4_BRG_DIV_2   (0x1UL << RST_CLK_UART_CLOCK_UART4_BRG_Pos)
#define RST_CLK_UART_CLOCK_UART4_BRG_DIV_4   (0x2UL << RST_CLK_UART_CLOCK_UART4_BRG_Pos)
#define RST_CLK_UART_CLOCK_UART4_BRG_DIV_8   (0x3UL << RST_CLK_UART_CLOCK_UART4_BRG_Pos)
#define RST_CLK_UART_CLOCK_UART4_BRG_DIV_16  (0x4UL << RST_CLK_UART_CLOCK_UART4_BRG_Pos)
#define RST_CLK_UART_CLOCK_UART4_BRG_DIV_32  (0x5UL << RST_CLK_UART_CLOCK_UART4_BRG_Pos)
#define RST_CLK_UART_CLOCK_UART4_BRG_DIV_64  (0x6UL << RST_CLK_UART_CLOCK_UART4_BRG_Pos)
#define RST_CLK_UART_CLOCK_UART4_BRG_DIV_128 (0x7UL << RST_CLK_UART_CLOCK_UART4_BRG_Pos)

