piborisovich/microcontrollers/Milandr/Libraries/CMSIS/MDR32VF0xI/DeviceSupport/inc/MDR32VF0xI.h
#define RST_CLK_UART_CLOCK_UART4_CLK_EN_Pos  30
#define RST_CLK_UART_CLOCK_UART4_CLK_EN_Msk  (0x1UL << RST_CLK_UART_CLOCK_UART4_CLK_EN_Pos)
#define RST_CLK_UART_CLOCK_UART4_CLK_EN      RST_CLK_UART_CLOCK_UART4_CLK_EN_Msk

/** @} */ /* End of group MDR32VF0xI_RST_CLK_UART_CLOCK */

/** @defgroup MDR32VF0xI_RST_CLK_SSP_CLOCK RST_CLK SSP_CLOCK
 * @{
 */

#define RST_CLK_SSP_CLOCK_SSP1_BRG_Pos     0
#define RST_CLK_SSP_CLOCK_SSP1_BRG_Msk     (0x7UL << RST_CLK_SSP_CLOCK_SSP1_BRG_Pos)
#define RST_CLK_SSP_CLOCK_SSP1_BRG_DIV_1   (0x0UL << RST_CLK_SSP_CLOCK_SSP1_BRG_Pos)
#define RST_CLK_SSP_CLOCK_SSP1_BRG_DIV_2   (0x1UL << RST_CLK_SSP_CLOCK_SSP1_BRG_Pos)
#define RST_CLK_SSP_CLOCK_SSP1_BRG_DIV_4   (0x2UL << RST_CLK_SSP_CLOCK_SSP1_BRG_Pos)
#define RST_CLK_SSP_CLOCK_SSP1_BRG_DIV_8   (0x3UL << RST_CLK_SSP_CLOCK_SSP1_BRG_Pos)
#define RST_CLK_SSP_CLOCK_SSP1_BRG_DIV_16  (0x4UL << RST_CLK_SSP_CLOCK_SSP1_BRG_Pos)
#define RST_CLK_SSP_CLOCK_SSP1_BRG_DIV_32  (0x5UL << RST_CLK_SSP_CLOCK_SSP1_BRG_Pos)
#define RST_CLK_SSP_CLOCK_SSP1_BRG_DIV_64  (0x6UL << RST_CLK_SSP_CLOCK_SSP1_BRG_Pos)
#define RST_CLK_SSP_CLOCK_SSP1_BRG_DIV_128 (0x7UL << RST_CLK_SSP_CLOCK_SSP1_BRG_Pos)

#define RST_CLK_SSP_CLOCK_SSP2_BRG_Pos     8
#define RST_CLK_SSP_CLOCK_SSP2_BRG_Msk     (0x7UL << RST_CLK_SSP_CLOCK_SSP2_BRG_Pos)
#define RST_CLK_SSP_CLOCK_SSP2_BRG_DIV_1   (0x0UL << RST_CLK_SSP_CLOCK_SSP2_BRG_Pos)
#define RST_CLK_SSP_CLOCK_SSP2_BRG_DIV_2   (0x1UL << RST_CLK_SSP_CLOCK_SSP2_BRG_Pos)
#define RST_CLK_SSP_CLOCK_SSP2_BRG_DIV_4   (0x2UL << RST_CLK_SSP_CLOCK_SSP2_BRG_Pos)
#define RST_CLK_SSP_CLOCK_SSP2_BRG_DIV_8   (0x3UL << RST_CLK_SSP_CLOCK_SSP2_BRG_Pos)
#define RST_CLK_SSP_CLOCK_SSP2_BRG_DIV_16  (0x4UL << RST_CLK_SSP_CLOCK_SSP2_BRG_Pos)
#define RST_CLK_SSP_CLOCK_SSP2_BRG_DIV_32  (0x5UL << RST_CLK_SSP_CLOCK_SSP2_BRG_Pos)
#define RST_CLK_SSP_CLOCK_SSP2_BRG_DIV_64  (0x6UL << RST_CLK_SSP_CLOCK_SSP2_BRG_Pos)
#define RST_CLK_SSP_CLOCK_SSP2_BRG_DIV_128 (0x7UL << RST_CLK_SSP_CLOCK_SSP2_BRG_Pos)

#define RST_CLK_SSP_CLOCK_SSP3_BRG_Pos     16
#define RST_CLK_SSP_CLOCK_SSP3_BRG_Msk     (0x7UL << RST_CLK_SSP_CLOCK_SSP3_BRG_Pos)
#define RST_CLK_SSP_CLOCK_SSP3_BRG_DIV_1   (0x0UL << RST_CLK_SSP_CLOCK_SSP3_BRG_Pos)
#define RST_CLK_SSP_CLOCK_SSP3_BRG_DIV_2   (0x1UL << RST_CLK_SSP_CLOCK_SSP3_BRG_Pos)
#define RST_CLK_SSP_CLOCK_SSP3_BRG_DIV_4   (0x2UL << RST_CLK_SSP_CLOCK_SSP3_BRG_Pos)
#define RST_CLK_SSP_CLOCK_SSP3_BRG_DIV_8   (0x3UL << RST_CLK_SSP_CLOCK_SSP3_BRG_Pos)
#define RST_CLK_SSP_CLOCK_SSP3_BRG_DIV_16  (0x4UL << RST_CLK_SSP_CLOCK_SSP3_BRG_Pos)
#define RST_CLK_SSP_CLOCK_SSP3_BRG_DIV_32  (0x5UL << RST_CLK_SSP_CLOCK_SSP3_BRG_Pos)
#define RST_CLK_SSP_CLOCK_SSP3_BRG_DIV_64  (0x6UL << RST_CLK_SSP_CLOCK_SSP3_BRG_Pos)
#define RST_CLK_SSP_CLOCK_SSP3_BRG_DIV_128 (0x7UL << RST_CLK_SSP_CLOCK_SSP3_BRG_Pos)

#define RST_CLK_SSP_CLOCK_SSP1_CLK_EN_Pos  24
#define RST_CLK_SSP_CLOCK_SSP1_CLK_EN_Msk  (0x1UL << RST_CLK_SSP_CLOCK_SSP1_CLK_EN_Pos)
#define RST_CLK_SSP_CLOCK_SSP1_CLK_EN      RST_CLK_SSP_CLOCK_SSP1_CLK_EN_Msk

#define RST_CLK_SSP_CLOCK_SSP2_CLK_EN_Pos  25
#define RST_CLK_SSP_CLOCK_SSP2_CLK_EN_Msk  (0x1UL << RST_CLK_SSP_CLOCK_SSP2_CLK_EN_Pos)
#define RST_CLK_SSP_CLOCK_SSP2_CLK_EN      RST_CLK_SSP_CLOCK_SSP2_CLK_EN_Msk

#define RST_CLK_SSP_CLOCK_SSP3_CLK_EN_Pos  26
#define RST_CLK_SSP_CLOCK_SSP3_CLK_EN_Msk  (0x1UL << RST_CLK_SSP_CLOCK_SSP3_CLK_EN_Pos)
#define RST_CLK_SSP_CLOCK_SSP3_CLK_EN      RST_CLK_SSP_CLOCK_SSP3_CLK_EN_Msk

/** @} */ /* End of group MDR32VF0xI_RST_CLK_SSP_CLOCK */

#if !defined(USE_MDR32F02_REV_1X)

/** @defgroup MDR32VF0xI_RST_CLK_DIV_SYS_TIM RST_CLK DIV_SYS_TIM
 * @{
 */

#define RST_CLK_DIV_SYS_TIM_DIV_SYS_TIM_Pos 0
#define RST_CLK_DIV_SYS_TIM_DIV_SYS_TIM_Msk (0xFFUL << RST_CLK_DIV_SYS_TIM_DIV_SYS_TIM_Pos)

/** @} */ /* End of group MDR32VF0xI_RST_CLK_DIV_SYS_TIM */

#endif

/** @} */ /* End of group MDR32VF0xI_RST_CLK_Defines */

/** @} */ /* End of group MDR32VF0xI_RST_CLK */

/** @defgroup MDR32VF0xI_DMA MDR_DMA
 * @{
 */

/**
 * @brief MDR32VF0xI DMA control structure.
 */
typedef struct {
    __I uint32_t  STATUS;            /*!<DMA Status Register */
    __O uint32_t  CFG;               /*!<DMA Configuration Register */
    __IO uint32_t CTRL_BASE_PTR;     /*!<DMA Channel Control Data Base Pointer Register */
    __I uint32_t  ALT_CTRL_BASE_PTR; /*!<DMA Channel Alternate Control Data Base Pointer Register */
    __I uint32_t  WAITONREQ_STATUS;  /*!<DMA Channel Wait on Request Status Register */
    __O uint32_t  CHNL_SW_REQUEST;   /*!<DMA Channel Software Request Register */
    __IO uint32_t CHNL_USEBURST_SET; /*!<DMA Channel Use Burst Set Register */
    __O uint32_t  CHNL_USEBURST_CLR; /*!<DMA Channel Use Burst Clear Register */
    __IO uint32_t CHNL_REQ_MASK_SET; /*!<DMA Channel Request Mask Set Register */
    __O uint32_t  CHNL_REQ_MASK_CLR; /*!<DMA Channel Request Mask Clear Register */
    __IO uint32_t CHNL_ENABLE_SET;   /*!<DMA Channel Enable Set Register */
    __O uint32_t  CHNL_ENABLE_CLR;   /*!<DMA Channel Enable Clear Register */
    __IO uint32_t CHNL_PRI_ALT_SET;  /*!<DMA Channel Primary-Alternate set Register */
    __O uint32_t  CHNL_PRI_ALT_CLR;  /*!<DMA Channel Primary-Alternate clear Register */
    __IO uint32_t CHNL_PRIORITY_SET; /*!<DMA Channel Priority Set Register */
    __O uint32_t  CHNL_PRIORITY_CLR; /*!<DMA Channel Priority Clear Register */
    __I uint32_t  RESERVED0[3];      /*!<Reserved */
    __IO uint32_t ERR_CLR;           /*!<DMA Bus Error Flag Clear Register */
} MDR_DMA_TypeDef;

/** @defgroup MDR32VF0xI_DMA_Defines DMA Defines
 * @{
 */

/** @defgroup MDR32VF0xI_DMA_STATUS DMA STATUS
 * @{
 */

#define DMA_STATUS_MASTER_ENABLE_Pos 0
#define DMA_STATUS_MASTER_ENABLE_Msk (0x1UL << DMA_STATUS_MASTER_ENABLE_Pos)
#define DMA_STATUS_MASTER_ENABLE     DMA_STATUS_MASTER_ENABLE_Msk

#define DMA_STATUS_STATE_Pos         4
#define DMA_STATUS_STATE_Msk         (0xFUL << DMA_STATUS_STATE_Pos)

#define DMA_STATUS_CHNLS_MINUS1_Pos  16
#define DMA_STATUS_CHNLS_MINUS1_Msk  (0x1FUL << DMA_STATUS_CHNLS_MINUS1_Pos)

#define DMA_STATUS_TEST_STATUS_Pos   28
#define DMA_STATUS_TEST_STATUS_Msk   (0xFUL << DMA_STATUS_TEST_STATUS_Pos)

