piborisovich/microcontrollers/Milandr/Libraries/CMSIS/MDR32VF0xI/DeviceSupport/inc/MDR32VF0xI.h
/** @} */ /* End of group MDR32VF0xI_I2C_PRL */

/** @defgroup MDR32VF0xI_I2C_PRH I2C PRH
 * @{
 */

#define I2C_PRH_PR_Pos 0
#define I2C_PRH_PR_Msk (0xFFUL << I2C_PRH_PR_Pos)

/** @} */ /* End of group MDR32VF0xI_I2C_PRH */

/** @defgroup MDR32VF0xI_I2C_CTR I2C CTR
 * @{
 */

#define I2C_CTR_EN_INT_Pos 6
#define I2C_CTR_EN_INT_Msk (0x1UL << I2C_CTR_EN_INT_Pos)
#define I2C_CTR_EN_INT     I2C_CTR_EN_INT_Msk

#define I2C_CTR_EN_I2C_Pos 7
#define I2C_CTR_EN_I2C_Msk (0x1UL << I2C_CTR_EN_I2C_Pos)
#define I2C_CTR_EN_I2C     I2C_CTR_EN_I2C_Msk

/** @} */ /* End of group MDR32VF0xI_I2C_CTR */

/** @defgroup MDR32VF0xI_I2C_RXD I2C RXD
 * @{
 */

#define I2C_RXD_RXD_Pos 0
#define I2C_RXD_RXD_Msk (0xFFUL << I2C_RXD_RXD_Pos)

/** @} */ /* End of group MDR32VF0xI_I2C_RXD */

/** @defgroup MDR32VF0xI_I2C_STA I2C STA
 * @{
 */

#define I2C_STA_INT_Pos      0
#define I2C_STA_INT_Msk      (0x1UL << I2C_STA_INT_Pos)
#define I2C_STA_INT          I2C_STA_INT_Msk

#define I2C_STA_TR_PROG_Pos  1
#define I2C_STA_TR_PROG_Msk  (0x1UL << I2C_STA_TR_PROG_Pos)
#define I2C_STA_TR_PROG      I2C_STA_TR_PROG_Msk

#define I2C_STA_LOST_ARB_Pos 5
#define I2C_STA_LOST_ARB_Msk (0x1UL << I2C_STA_LOST_ARB_Pos)
#define I2C_STA_LOST_ARB     I2C_STA_LOST_ARB_Msk

#define I2C_STA_BUSY_Pos     6
#define I2C_STA_BUSY_Msk     (0x1UL << I2C_STA_BUSY_Pos)
#define I2C_STA_BUSY         I2C_STA_BUSY_Msk

#define I2C_STA_RX_ACK_Pos   7
#define I2C_STA_RX_ACK_Msk   (0x1UL << I2C_STA_RX_ACK_Pos)
#define I2C_STA_RX_ACK       I2C_STA_RX_ACK_Msk

/** @} */ /* End of group MDR32VF0xI_I2C_STA */

/** @defgroup MDR32VF0xI_I2C_TXD I2C TXD
 * @{
 */

#define I2C_TXD_TXD_Pos 0
#define I2C_TXD_TXD_Msk (0xFFUL << I2C_TXD_TXD_Pos)

/** @} */ /* End of group MDR32VF0xI_I2C_TXD */

/** @defgroup MDR32VF0xI_I2C_CMD I2C CMD
 * @{
 */

#define I2C_CMD_CLRINT_Pos 0
#define I2C_CMD_CLRINT_Msk (0x1UL << I2C_CMD_CLRINT_Pos)
#define I2C_CMD_CLRINT     I2C_CMD_CLRINT_Msk

#define I2C_CMD_ACK_Pos    3
#define I2C_CMD_ACK_Msk    (0x1UL << I2C_CMD_ACK_Pos)
#define I2C_CMD_ACK        I2C_CMD_ACK_Msk

#define I2C_CMD_WR_Pos     4
#define I2C_CMD_WR_Msk     (0x1UL << I2C_CMD_WR_Pos)
#define I2C_CMD_WR         I2C_CMD_WR_Msk

#define I2C_CMD_RD_Pos     5
#define I2C_CMD_RD_Msk     (0x1UL << I2C_CMD_RD_Pos)
#define I2C_CMD_RD         I2C_CMD_RD_Msk

#define I2C_CMD_STOP_Pos   6
#define I2C_CMD_STOP_Msk   (0x1UL << I2C_CMD_STOP_Pos)
#define I2C_CMD_STOP       I2C_CMD_STOP_Msk

#define I2C_CMD_START_Pos  7
#define I2C_CMD_START_Msk  (0x1UL << I2C_CMD_START_Pos)
#define I2C_CMD_START      I2C_CMD_START_Msk

/** @} */ /* End of group MDR32VF0xI_I2C_CMD */

/** @} */ /* End of group MDR32VF0xI_I2C_Defines */

/** @} */ /* End of group MDR32VF0xI_I2C */

/** @defgroup MDR32VF0xI_ADC MDR_ADC
 * @{
 */

/**
 * @brief MDR32VF0xI ADC control structure.
 */
typedef struct {
    __IO uint32_t ADC1_CFG;     /*!<ADC1 Configuration Register */
    __I uint32_t  RESERVED0;    /*!<Reserved */
    __IO uint32_t ADC1_H_LEVEL; /*!<ADC1 High Level Register */
    __I uint32_t  RESERVED1;    /*!<Reserved */
    __IO uint32_t ADC1_L_LEVEL; /*!<ADC1 Low Level Register */
    __I uint32_t  RESERVED2;    /*!<Reserved */
    __IO uint32_t ADC1_RESULT;  /*!<ADC1 Result Register */
    __I uint32_t  RESERVED3;    /*!<Reserved */
    __IO uint32_t ADC1_STATUS;  /*!<ADC1 Status Register */
    __I uint32_t  RESERVED4;    /*!<Reserved */
    __IO uint32_t ADC1_CHSEL;   /*!<ADC1 Channel Selector Register */
    __I uint32_t  RESERVED5;    /*!<Reserved */
    __IO uint32_t ADC_TRIM;     /*!<ADC Reference Voltage Trim Register */
} MDR_ADC_TypeDef;

/** @defgroup MDR32VF0xI_ADC_Defines ADC Defines
 * @{
 */

/** @defgroup MDR32VF0xI_ADC1_CFG ADC ADC1_CFG
 * @{
 */

#define ADC1_CFG_REG_ADON_Pos   0
#define ADC1_CFG_REG_ADON_Msk   (0x1UL << ADC1_CFG_REG_ADON_Pos)
#define ADC1_CFG_REG_ADON       ADC1_CFG_REG_ADON_Msk

#define ADC1_CFG_REG_GO_Pos     1
#define ADC1_CFG_REG_GO_Msk     (0x1UL << ADC1_CFG_REG_GO_Pos)
#define ADC1_CFG_REG_GO         ADC1_CFG_REG_GO_Msk

#define ADC1_CFG_REG_CLKS_Pos   2
#define ADC1_CFG_REG_CLKS_Msk   (0x1UL << ADC1_CFG_REG_CLKS_Pos)
#define ADC1_CFG_REG_CLKS       ADC1_CFG_REG_CLKS_Msk

#define ADC1_CFG_REG_SAMPLE_Pos 3
#define ADC1_CFG_REG_SAMPLE_Msk (0x1UL << ADC1_CFG_REG_SAMPLE_Pos)
#define ADC1_CFG_REG_SAMPLE     ADC1_CFG_REG_SAMPLE_Msk

#define ADC1_CFG_REG_CHS_Pos    4
#define ADC1_CFG_REG_CHS_Msk    (0x7UL << ADC1_CFG_REG_CHS_Pos)

#define ADC1_CFG_REG_CHCH_Pos   9
#define ADC1_CFG_REG_CHCH_Msk   (0x1UL << ADC1_CFG_REG_CHCH_Pos)
#define ADC1_CFG_REG_CHCH       ADC1_CFG_REG_CHCH_Msk

#define ADC1_CFG_REG_RNGC_Pos   10
#define ADC1_CFG_REG_RNGC_Msk   (0x1UL << ADC1_CFG_REG_RNGC_Pos)
#define ADC1_CFG_REG_RNGC       ADC1_CFG_REG_RNGC_Msk

#define ADC1_CFG_M_REF_Pos      11
#define ADC1_CFG_M_REF_Msk      (0x1UL << ADC1_CFG_M_REF_Pos)
#define ADC1_CFG_M_REF          ADC1_CFG_M_REF_Msk

#define ADC1_CFG_REG_DIVCLK_Pos 12
#define ADC1_CFG_REG_DIVCLK_Msk (0xFUL << ADC1_CFG_REG_DIVCLK_Pos)

#if defined(USE_MDR32F02)
#define ADC1_CFG_EN_NOISE_RNG_Pos 19
#define ADC1_CFG_EN_NOISE_RNG_Msk (0x1UL << ADC1_CFG_EN_NOISE_RNG_Pos)
#define ADC1_CFG_EN_NOISE_RNG     ADC1_CFG_EN_NOISE_RNG_Msk
#endif

#define ADC1_CFG_DELAY_GO_Pos 25
#define ADC1_CFG_DELAY_GO_Msk (0x7UL << ADC1_CFG_DELAY_GO_Pos)

/** @} */ /* End of group MDR32VF0xI_ADC1_CFG */

/** @defgroup MDR32VF0xI_ADC1_H_LEVEL ADC ADC1_H_LEVEL
 * @{
 */

#define ADC1_H_LEVEL_REG_H_LEVEL_Pos 0
#define ADC1_H_LEVEL_REG_H_LEVEL_Msk (0x3FFUL << ADC1_H_LEVEL_REG_H_LEVEL_Pos)

/** @} */ /* End of group MDR32VF0xI_ADC1_H_LEVEL */

/** @defgroup MDR32VF0xI_ADC1_L_LEVEL ADC ADC1_L_LEVEL
 * @{
 */

#define ADC1_L_LEVEL_REG_L_LEVEL_Pos 0
#define ADC1_L_LEVEL_REG_L_LEVEL_Msk (0x3FFUL << ADC1_L_LEVEL_REG_L_LEVEL_Pos)

/** @} */ /* End of group MDR32VF0xI_ADC1_L_LEVEL */

/** @defgroup MDR32VF0xI_ADC1_RESULT ADC ADC1_RESULT
 * @{
 */

#define ADC1_RESULT_RESULT_Pos  0
#define ADC1_RESULT_RESULT_Msk  (0x3FFUL << ADC1_RESULT_RESULT_Pos)

#define ADC1_RESULT_CHANNEL_Pos 16
#define ADC1_RESULT_CHANNEL_Msk (0x7UL << ADC1_RESULT_CHANNEL_Pos)

