piborisovich/microcontrollers/Milandr/Libraries/CMSIS/MDR32VF0xI/DeviceSupport/inc/MDR32VF0xI.h
/** @} */ /* End of group MDR32VF0xI_ADC1_RESULT */

/** @defgroup MDR32VF0xI_ADC1_STATUS ADC ADC1_STATUS
 * @{
 */

#define ADC1_STATUS_FLG_REG_OVERWRITE_Pos 0
#define ADC1_STATUS_FLG_REG_OVERWRITE_Msk (0x1UL << ADC1_STATUS_FLG_REG_OVERWRITE_Pos)
#define ADC1_STATUS_FLG_REG_OVERWRITE     ADC1_STATUS_FLG_REG_OVERWRITE_Msk

#define ADC1_STATUS_FLG_REG_AWOIFEN_Pos   1
#define ADC1_STATUS_FLG_REG_AWOIFEN_Msk   (0x1UL << ADC1_STATUS_FLG_REG_AWOIFEN_Pos)
#define ADC1_STATUS_FLG_REG_AWOIFEN       ADC1_STATUS_FLG_REG_AWOIFEN_Msk

#define ADC1_STATUS_FLG_REG_EOCIF_Pos     2
#define ADC1_STATUS_FLG_REG_EOCIF_Msk     (0x1UL << ADC1_STATUS_FLG_REG_EOCIF_Pos)
#define ADC1_STATUS_FLG_REG_EOCIF         ADC1_STATUS_FLG_REG_EOCIF_Msk

#define ADC1_STATUS_AWOIF_IE_Pos          3
#define ADC1_STATUS_AWOIF_IE_Msk          (0x1UL << ADC1_STATUS_AWOIF_IE_Pos)
#define ADC1_STATUS_AWOIF_IE              ADC1_STATUS_AWOIF_IE_Msk

#define ADC1_STATUS_ECOIF_IE_Pos          4
#define ADC1_STATUS_ECOIF_IE_Msk          (0x1UL << ADC1_STATUS_ECOIF_IE_Pos)
#define ADC1_STATUS_ECOIF_IE              ADC1_STATUS_ECOIF_IE_Msk

/** @} */ /* End of group MDR32VF0xI_ADC1_STATUS */

/** @defgroup MDR32VF0xI_ADC1_CHSEL ADC ADC1_CHSEL
 * @{
 */

#define ADC1_CHSEL_SL_CH_CH_REF0_Pos 0
#define ADC1_CHSEL_SL_CH_CH_REF0_Msk (0x1UL << ADC1_CHSEL_SL_CH_CH_REF0_Pos)
#define ADC1_CHSEL_SL_CH_CH_REF0     ADC1_CHSEL_SL_CH_CH_REF0_Msk

#define ADC1_CHSEL_SL_CH_CH_REF1_Pos 1
#define ADC1_CHSEL_SL_CH_CH_REF1_Msk (0x1UL << ADC1_CHSEL_SL_CH_CH_REF1_Pos)
#define ADC1_CHSEL_SL_CH_CH_REF1     ADC1_CHSEL_SL_CH_CH_REF1_Msk

#define ADC1_CHSEL_SL_CH_CH_REF2_Pos 2
#define ADC1_CHSEL_SL_CH_CH_REF2_Msk (0x1UL << ADC1_CHSEL_SL_CH_CH_REF2_Pos)
#define ADC1_CHSEL_SL_CH_CH_REF2     ADC1_CHSEL_SL_CH_CH_REF2_Msk

#define ADC1_CHSEL_SL_CH_CH_REF3_Pos 3
#define ADC1_CHSEL_SL_CH_CH_REF3_Msk (0x1UL << ADC1_CHSEL_SL_CH_CH_REF3_Pos)
#define ADC1_CHSEL_SL_CH_CH_REF3     ADC1_CHSEL_SL_CH_CH_REF3_Msk

#define ADC1_CHSEL_SL_CH_CH_REF4_Pos 4
#define ADC1_CHSEL_SL_CH_CH_REF4_Msk (0x1UL << ADC1_CHSEL_SL_CH_CH_REF4_Pos)
#define ADC1_CHSEL_SL_CH_CH_REF4     ADC1_CHSEL_SL_CH_CH_REF4_Msk

#define ADC1_CHSEL_SL_CH_CH_REF5_Pos 5
#define ADC1_CHSEL_SL_CH_CH_REF5_Msk (0x1UL << ADC1_CHSEL_SL_CH_CH_REF5_Pos)
#define ADC1_CHSEL_SL_CH_CH_REF5     ADC1_CHSEL_SL_CH_CH_REF5_Msk

#define ADC1_CHSEL_SL_CH_CH_REF6_Pos 6
#define ADC1_CHSEL_SL_CH_CH_REF6_Msk (0x1UL << ADC1_CHSEL_SL_CH_CH_REF6_Pos)
#define ADC1_CHSEL_SL_CH_CH_REF6     ADC1_CHSEL_SL_CH_CH_REF6_Msk

#define ADC1_CHSEL_SL_CH_CH_REF7_Pos 7
#define ADC1_CHSEL_SL_CH_CH_REF7_Msk (0x1UL << ADC1_CHSEL_SL_CH_CH_REF7_Pos)
#define ADC1_CHSEL_SL_CH_CH_REF7     ADC1_CHSEL_SL_CH_CH_REF7_Msk

/** @} */ /* End of group MDR32VF0xI_ADC1_CHSEL */

/** @defgroup MDR32VF0xI_ADC_TRIM ADC ADC_TRIM
 * @{
 */

#define ADC_TRIM_BG_TRIM_Pos 1
#define ADC_TRIM_BG_TRIM_Msk (0x1FUL << ADC_TRIM_BG_TRIM_Pos)

/** @} */ /* End of group MDR32VF0xI_ADC_TRIM */

/** @} */ /* End of group MDR32VF0xI_ADC_Defines */

/** @} */ /* End of group MDR32VF0xI_ADC */

/** @defgroup MDR32VF0xI_WWDG MDR_WWDG
 * @{
 */

/**
 * @brief MDR32VF0xI WWDG control structure.
 */
typedef struct {
    __IO uint32_t CR;  /*!<WWDG Command Register */
    __IO uint32_t CFR; /*!<WWDG Configuration Register */
    __IO uint32_t SR;  /*!<WWDG Status Register */
} MDR_WWDG_TypeDef;

/** @defgroup MDR32VF0xI_IWDG_Defines IWDG Defines
 * @{
 */

/** @defgroup MDR32VF0xI_WWDG_CR WWDG_CR
 * @{
 */

#define WWDG_CR_T_Pos    0
#define WWDG_CR_T_Msk    (0x7FUL << WWDG_CR_T_Pos)

#define WWDG_CR_WDGA_Pos 7
#define WWDG_CR_WDGA_Msk (0x1UL << WWDG_CR_WDGA_Pos)
#define WWDG_CR_WDGA     WWDG_CR_WDGA_Msk

/** @} */ /* End of group MDR32VF0xI_WWDG_CR */

/** @defgroup MDR32VF0xI_WWDG_CFR WWDG CFR
 * @{
 */

#define WWDG_CFR_W_Pos       0
#define WWDG_CFR_W_Msk       (0x7FUL << WWDG_CFR_W_Pos)

#define WWDG_CFR_WDGTB_Pos   7
#define WWDG_CFR_WDGTB_Msk   (0x3UL << WWDG_CFR_WDGTB_Pos)
#define WWDG_CFR_WDGTB_DIV_1 (0x0UL << IWDG_PR_PR_Pos)
#define WWDG_CFR_WDGTB_DIV_2 (0x1UL << IWDG_PR_PR_Pos)
#define WWDG_CFR_WDGTB_DIV_4 (0x2UL << IWDG_PR_PR_Pos)
#define WWDG_CFR_WDGTB_DIV_8 (0x3UL << IWDG_PR_PR_Pos)

#define WWDG_CFR_EWI_Pos     9
#define WWDG_CFR_EWI_Msk     (0x1UL << WWDG_CFR_EWI_Pos)
#define WWDG_CFR_EWI         WWDG_CFR_EWI_Msk

/** @} */ /* End of group MDR32VF0xI_WWDG_CFR */

/** @defgroup MDR32VF0xI_WWDG_SR WWDG_SR
 * @{
 */

#define WWDG_SR_EWIF_Pos    0
#define WWDG_SR_EWIF_Msk    (0x1UL << WWDG_SR_EWIF_Pos)
#define WWDG_SR_EWIF        WWDG_SR_EWIF_Msk

#define WWDG_SR_WDG_WEC_Pos 1
#define WWDG_SR_WDG_WEC_Msk (0x1UL << WWDG_SR_WDG_WEC_Pos)
#define WWDG_SR_WDG_WEC     WWDG_SR_WDG_WEC_Msk

/** @} */ /* End of group MDR32VF0xI_WWDG_SR */

/** @} */ /* End of group MDR32VF0xI_WWDG_Defines */

/** @} */ /* End of group MDR32VF0xI_WWDG */

/** @defgroup MDR32VF0xI_IWDG MDR_IWDG
 * @{
 */

/**
 * @brief MDR32VF0xI IWDG control structure.
 */
typedef struct {
    __O uint32_t  KR;  /*!<IWDG Key Register */
    __IO uint32_t PR;  /*!<IWDG Clock Prescaler Register */
    __IO uint32_t RLR; /*!<IWDG Reload Register */
    __I uint32_t  SR;  /*!<IWDG Status Register */
} MDR_IWDG_TypeDef;

/** @defgroup MDR32VF0xI_IWDG_Defines IWDG Defines
 * @{
 */

/** @defgroup MDR32VF0xI_IWDG_KR IWDG_KR
 * @{
 */

#define IWDG_KR_KEY_Pos          0
#define IWDG_KR_KEY_Msk          (0xFFFFUL << IWDG_KR_KEY_Pos)
#define IWDG_KR_KEY_RELOAD       0x0000AAAAUL
#define IWDG_KR_KEY_ENABLE       0x0000CCCCUL
#define IWDG_KR_KEY_WRITE_ENABLE 0x00005555UL

/** @} */ /* End of group MDR32VF0xI_IWDG_KR */

/** @defgroup MDR32VF0xI_IWDG_PR IWDG_PR
 * @{
 */

#define IWDG_PR_PR_Pos     0
#define IWDG_PR_PR_Msk     (0x7UL << IWDG_PR_PR_Pos)
#define IWDG_PR_PR_DIV_4   (0x0UL << IWDG_PR_PR_Pos)
#define IWDG_PR_PR_DIV_8   (0x1UL << IWDG_PR_PR_Pos)
#define IWDG_PR_PR_DIV_16  (0x2UL << IWDG_PR_PR_Pos)
#define IWDG_PR_PR_DIV_32  (0x3UL << IWDG_PR_PR_Pos)
#define IWDG_PR_PR_DIV_64  (0x4UL << IWDG_PR_PR_Pos)
#define IWDG_PR_PR_DIV_128 (0x5UL << IWDG_PR_PR_Pos)
#define IWDG_PR_PR_DIV_256 (0x6UL << IWDG_PR_PR_Pos)

/** @} */ /* End of group MDR32VF0xI_IWDG_PR */

/** @defgroup MDR32VF0xI_IWDG_RLR IWDG_RLR
 * @{
 */

#define IWDG_RLR_RLR_Pos 0
#define IWDG_RLR_RLR_Msk (0xFFFUL << IWDG_RLR_RLR_Pos)

/** @} */ /* End of group MDR32VF0xI_IWDG_RLR */

