piborisovich/microcontrollers/Milandr/Libraries/CMSIS/MDR32VF0xI/DeviceSupport/inc/MDR32VF0xI.h
/** @defgroup MDR32VF0xI_IWDG_SR IWDG_SR
 * @{
 */

#define IWDG_SR_PVU_Pos 0
#define IWDG_SR_PVU_Msk (0x1UL << IWDG_SR_PVU_Pos)
#define IWDG_SR_PVU     IWDG_SR_PVU_Msk

#define IWDG_SR_RVU_Pos 1
#define IWDG_SR_RVU_Msk (0x1UL << IWDG_SR_RVU_Pos)
#define IWDG_SR_RVU     IWDG_SR_RVU_Msk

/** @} */ /* End of group MDR32VF0xI_IWDG_SR */

/** @} */ /* End of group MDR32VF0xI_IWDG_Defines */

/** @} */ /* End of group MDR32VF0xI_IWDG */

/** @defgroup MDR32VF0xI_POWER MDR_POWER
 * @{
 */

/**
 * @brief MDR32VF0xI POWER control structure.
 */
typedef struct {
    __IO uint32_t PVDCS; /*!<POWER Power Voltage Detector Control and Status Register */
} MDR_POWER_TypeDef;

/** @defgroup MDR32VF0xI_POWER_Defines POWER Defines
 * @{
 */

/** @defgroup MDR32VF0xI_POWER_PVDCS POWER PVDCS
 * @{
 */

#define POWER_PVDCS_PVDBEN_Pos 0
#define POWER_PVDCS_PVDBEN_Msk (0x1UL << POWER_PVDCS_PVDBEN_Pos)
#define POWER_PVDCS_PVDBEN     POWER_PVDCS_PVDBEN_Msk

#define POWER_PVDCS_PVDEN_Pos  2
#define POWER_PVDCS_PVDEN_Msk  (0x1UL << POWER_PVDCS_PVDEN_Pos)
#define POWER_PVDCS_PVDEN      POWER_PVDCS_PVDEN_Msk

#define POWER_PVDCS_PLSB_Pos   3
#define POWER_PVDCS_PLSB_Msk   (0x7UL << POWER_PVDCS_PLSB_Pos)

#define POWER_PVDCS_PLS_Pos    13
#define POWER_PVDCS_PLS_Msk    (0x7UL << POWER_PVDCS_PLS_Pos)

#define POWER_PVDCS_PVBD_Pos   18
#define POWER_PVDCS_PVBD_Msk   (0x1UL << POWER_PVDCS_PVBD_Pos)
#define POWER_PVDCS_PVBD       POWER_PVDCS_PVBD_Msk

#define POWER_PVDCS_PVD_Pos    20
#define POWER_PVDCS_PVD_Msk    (0x1UL << POWER_PVDCS_PVD_Pos)
#define POWER_PVDCS_PVD        POWER_PVDCS_PVD_Msk

#define POWER_PVDCS_IEPVDB_Pos 21
#define POWER_PVDCS_IEPVDB_Msk (0x1UL << POWER_PVDCS_IEPVDB_Pos)
#define POWER_PVDCS_IEPVDB     POWER_PVDCS_IEPVDB_Msk

#define POWER_PVDCS_IEPVD_Pos  22
#define POWER_PVDCS_IEPVD_Msk  (0x1UL << POWER_PVDCS_IEPVD_Pos)
#define POWER_PVDCS_IEPVD      POWER_PVDCS_IEPVD_Msk

#define POWER_PVDCS_INV_Pos    24
#define POWER_PVDCS_INV_Msk    (0x1UL << POWER_PVDCS_INV_Pos)
#define POWER_PVDCS_INV        POWER_PVDCS_INV_Msk

#define POWER_PVDCS_INVB_Pos   26
#define POWER_PVDCS_INVB_Msk   (0x1UL << POWER_PVDCS_INVB_Pos)
#define POWER_PVDCS_INVB       POWER_PVDCS_INVB_Msk

/** @} */ /* End of group MDR32VF0xI_POWER_PVDCS */

/** @} */ /* End of group MDR32VF0xI_POWER_Defines */

/** @} */ /* End of group MDR32VF0xI_POWER */

/** @defgroup MDR32VF0xI_BKP MDR_BKP
 * @{
 */

/**
 * @brief MDR32VF0xI BKP and RTC control structure.
 */
typedef struct {
    __IO uint32_t WPR;          /*!<BKP and RTC Protection Key Register */
    __IO uint32_t LDO;          /*!<BKP LDO Control Register */
    __IO uint32_t CLK;          /*!<BKP Clock Control Register */
    __IO uint32_t RTC_CR;       /*!<RTC Control Register */
    __IO uint32_t RTC_WUTR;     /*!<RTC Watchdog Counter Register */
    __IO uint32_t RTC_PREDIV_S; /*!<RTC Prescaler Counter Register */
    __IO uint32_t RTC_PRL;      /*!<RTC Prescaler Reload Value Register */
    __IO uint32_t RTC_ALRM;     /*!<RTC Alarm Register */
    __IO uint32_t RTC_CS;       /*!<RTC Control and Status Register */
    __IO uint32_t RTC_TR;       /*!<RTC Time Register */
    __IO uint32_t RTC_DR;       /*!<RTC Date Register */
    __IO uint32_t RTC_ALRMAR;   /*!<RTC Alarm A Reference Register */
    __IO uint32_t RTC_ALRMBR;   /*!<RTC Alarm B Reference Register */
    __I uint32_t  RTC_TSTR1;    /*!<RTC Timestamp1 Time Registerer */
    __I uint32_t  RTC_TSTR2;    /*!<RTC Timestamp2 Time Registerer */
    __I uint32_t  RTC_TSTR3;    /*!<RTC Timestamp3 Time Registerer */
    __I uint32_t  RTC_TSDR1;    /*!<RTC Timestamp1 Date Registerer */
    __I uint32_t  RTC_TSDR2;    /*!<RTC Timestamp2 Date Registerer */
    __I uint32_t  RTC_TSDR3;    /*!<RTC Timestamp3 Date Registerer */
    __IO uint32_t RTC_TAFCR;    /*!<RTC Tamper/Timestamp Control*/
#if defined(USE_MDR32F02)
    __I uint32_t RESERVED0[1004]; /*!<Reserved */
#elif defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)
    __IO uint32_t RTC_TMPCAL1;     /*!<RTC Temperature Compensation Calibration and Control Register 1 */
    __IO uint32_t RTC_TMPCAL2;     /*!<RTC Temperature Compensation Calibration and Control Register 2 */
    __IO uint32_t RTC_TMPCAL3;     /*!<RTC Temperature Compensation Calibration and Control Register 3 */
    __I uint32_t  RESERVED0[1001]; /*!<Reserved */
#endif
    __IO uint32_t MEM[128]; /*!<BKP Memory */
} MDR_BKP_TypeDef;

/** @defgroup MDR32VF0xI_BKP_Defines BKP Defines
 * @{
 */

/** @defgroup MDR32VF0xI_BKP_WPR BKP WPR
 * @{
 */

#define BKP_WPR_BKP_WPR_Pos    0
#define BKP_WPR_BKP_WPR_Msk    (0xFFFFFFFFUL << BKP_WPR_BKP_WPR_Pos)
#define BKP_WPR_BKP_WPR_LOCK   (0x00000000UL)
#define BKP_WPR_BKP_WPR_UNLOCK (0x8555AAA1UL)

/** @} */ /* End of group MDR32VF0xI_BKP_WPR */

/** @defgroup MDR32VF0xI_BKP_LDO BKP LDO
 * @{
 */

#define BKP_LDO_BLDO_TRIM_Pos  0
#define BKP_LDO_BLDO_TRIM_Msk  (0x3UL << BKP_LDO_BLDO_TRIM_Pos)

#define BKP_LDO_BLDO_BOOST_Pos 2
#define BKP_LDO_BLDO_BOOST_Msk (0x1UL << BKP_LDO_BLDO_BOOST_Pos)
#define BKP_LDO_BLDO_BOOST     BKP_LDO_BLDO_BOOST_Msk

#define BKP_LDO_LDO_BOOST_Pos  3
#define BKP_LDO_LDO_BOOST_Msk  (0x3UL << BKP_LDO_LDO_BOOST_Pos)

#define BKP_LDO_SW_CNTRL_Pos   5
#define BKP_LDO_SW_CNTRL_Msk   (0x1UL << BKP_LDO_SW_CNTRL_Pos)
#define BKP_LDO_SW_CNTRL       BKP_LDO_SW_CNTRL_Msk

#define BKP_LDO_JTAG_ON_Pos    6
#define BKP_LDO_JTAG_ON_Msk    (0x1UL << BKP_LDO_JTAG_ON_Pos)
#define BKP_LDO_JTAG_ON        BKP_LDO_JTAG_ON_Msk

#define BKP_LDO_WAKEUP1_Pos    7
#define BKP_LDO_WAKEUP1_Msk    (0x1UL << BKP_LDO_WAKEUP1_Pos)
#define BKP_LDO_WAKEUP1        BKP_LDO_WAKEUP1_Msk

#define BKP_LDO_WAKEUP2_Pos    8
#define BKP_LDO_WAKEUP2_Msk    (0x1UL << BKP_LDO_WAKEUP2_Pos)
#define BKP_LDO_WAKEUP2        BKP_LDO_WAKEUP2_Msk

#define BKP_LDO_WAKEUP3_Pos    9
#define BKP_LDO_WAKEUP3_Msk    (0x1UL << BKP_LDO_WAKEUP3_Pos)
#define BKP_LDO_WAKEUP3        BKP_LDO_WAKEUP3_Msk

#define BKP_LDO_FPOR_Pos       25
#define BKP_LDO_FPOR_Msk       (0x1UL << BKP_LDO_FPOR_Pos)
#define BKP_LDO_FPOR           BKP_LDO_FPOR_Msk

#define BKP_LDO_TAMPF_Pos      26
#define BKP_LDO_TAMPF_Msk      (0x1UL << BKP_LDO_TAMPF_Pos)
#define BKP_LDO_TAMPF          BKP_LDO_TAMPF_Msk

#define BKP_LDO_MODE_Pos       27
#define BKP_LDO_MODE_Msk       (0x3UL << BKP_LDO_MODE_Pos)

#define BKP_LDO_SW_OFF_Pos     29
#define BKP_LDO_SW_OFF_Msk     (0x1UL << BKP_LDO_SW_OFF_Pos)
#define BKP_LDO_SW_OFF         BKP_LDO_SW_OFF_Msk

/** @} */ /* End of group MDR32VF0xI_BKP_LDO */

/** @defgroup MDR32VF0xI_BKP_CLK BKP CLK
 * @{
 */

#define BKP_CLK_LSE_ON_Pos       0
#define BKP_CLK_LSE_ON_Msk       (0x1UL << BKP_CLK_LSE_ON_Pos)
#define BKP_CLK_LSE_ON           BKP_CLK_LSE_ON_Msk

#define BKP_CLK_LSE_BYP_Pos      1
#define BKP_CLK_LSE_BYP_Msk      (0x1UL << BKP_CLK_LSE_BYP_Pos)
#define BKP_CLK_LSE_BYP          BKP_CLK_LSE_BYP_Msk

