piborisovich/microcontrollers/Milandr/Libraries/CMSIS/MDR32VF0xI/DeviceSupport/inc/MDR32VF0xI.h
#define BKP_CLK_LSE_RDY_Pos      2
#define BKP_CLK_LSE_RDY_Msk      (0x1UL << BKP_CLK_LSE_RDY_Pos)
#define BKP_CLK_LSE_RDY          BKP_CLK_LSE_RDY_Msk

#define BKP_CLK_LSE_CONF_Pos     3
#define BKP_CLK_LSE_CONF_Msk     (0x3UL << BKP_CLK_LSE_CONF_Pos)

#define BKP_CLK_LSI_ON_Pos       5
#define BKP_CLK_LSI_ON_Msk       (0x1UL << BKP_CLK_LSI_ON_Pos)
#define BKP_CLK_LSI_ON           BKP_CLK_LSI_ON_Msk

#define BKP_CLK_LSI_RDY_Pos      12
#define BKP_CLK_LSI_RDY_Msk      (0x1UL << BKP_CLK_LSI_RDY_Pos)
#define BKP_CLK_LSI_RDY          BKP_CLK_LSI_RDY_Msk

#define BKP_CLK_HSI_ON_Pos       13
#define BKP_CLK_HSI_ON_Msk       (0x1UL << BKP_CLK_HSI_ON_Pos)
#define BKP_CLK_HSI_ON           BKP_CLK_HSI_ON_Msk

#define BKP_CLK_HSI_RDY_Pos      14
#define BKP_CLK_HSI_RDY_Msk      (0x1UL << BKP_CLK_HSI_RDY_Pos)
#define BKP_CLK_HSI_RDY          BKP_CLK_HSI_RDY_Msk

#define BKP_CLK_HSI_LSI_TRIM_Pos 15
#define BKP_CLK_HSI_LSI_TRIM_Msk (0x3FUL << BKP_CLK_HSI_LSI_TRIM_Pos)

/** @} */ /* End of group MDR32VF0xI_BKP_CLK */

/** @defgroup MDR32VF0xI_BKP_RTC_CR BKP RTC_CR
 * @{
 */

#define BKP_RTC_CR_RTC_SEL_Pos             0
#define BKP_RTC_CR_RTC_SEL_Msk             (0x3UL << BKP_RTC_CR_RTC_SEL_Pos)
#define BKP_RTC_CR_RTC_SEL_LSI             (0x0UL << BKP_RTC_CR_RTC_SEL_Pos)
#define BKP_RTC_CR_RTC_SEL_LSE             (0x1UL << BKP_RTC_CR_RTC_SEL_Pos)
#define BKP_RTC_CR_RTC_SEL_HSI_RTC         (0x2UL << BKP_RTC_CR_RTC_SEL_Pos)
#define BKP_RTC_CR_RTC_SEL_HSE_RTC         (0x3UL << BKP_RTC_CR_RTC_SEL_Pos)

#define BKP_RTC_CR_RTC_EN_Pos              2
#define BKP_RTC_CR_RTC_EN_Msk              (0x1UL << BKP_RTC_CR_RTC_EN_Pos)
#define BKP_RTC_CR_RTC_EN                  BKP_RTC_CR_RTC_EN_Msk

#define BKP_RTC_CR_RTC_CAL_Pos             3
#define BKP_RTC_CR_RTC_CAL_Msk             (0xFFUL << BKP_RTC_CR_RTC_CAL_Pos)

#define BKP_RTC_CR_RTC_RESET_Pos           11
#define BKP_RTC_CR_RTC_RESET_Msk           (0x1UL << BKP_RTC_CR_RTC_RESET_Pos)
#define BKP_RTC_CR_RTC_RESET               BKP_RTC_CR_RTC_RESET_Msk

#define BKP_RTC_CR_WUCK_SEL_Pos            12
#define BKP_RTC_CR_WUCK_SEL_Msk            (0x7UL << BKP_RTC_CR_WUCK_SEL_Pos)
#define BKP_RTC_CR_WUCK_SEL_RTC_CLK_DIV_16 (0x0UL << BKP_RTC_CR_WUCK_SEL_Pos)
#define BKP_RTC_CR_WUCK_SEL_RTC_CLK_DIV_8  (0x1UL << BKP_RTC_CR_WUCK_SEL_Pos)
#define BKP_RTC_CR_WUCK_SEL_RTC_CLK_DIV_4  (0x2UL << BKP_RTC_CR_WUCK_SEL_Pos)
#define BKP_RTC_CR_WUCK_SEL_RTC_CLK_DIV_2  (0x3UL << BKP_RTC_CR_WUCK_SEL_Pos)
#define BKP_RTC_CR_WUCK_SEL_SEC_CLK        (0x4UL << BKP_RTC_CR_WUCK_SEL_Pos)

#define BKP_RTC_CR_FMT_Pos                 25
#define BKP_RTC_CR_FMT_Msk                 (0x1UL << BKP_RTC_CR_FMT_Pos)
#define BKP_RTC_CR_FMT                     BKP_RTC_CR_FMT_Msk

/** @} */ /* End of group MDR32VF0xI_BKP_RTC_CR */

/** @defgroup MDR32VF0xI_BKP_RTC_WUTR BKP RTC_WUTR
 * @{
 */

#define BKP_RTC_WUTR_RTC_WUTR_Pos 0
#define BKP_RTC_WUTR_RTC_WUTR_Msk (0xFFFFFFFFUL << BKP_RTC_WUTR_RTC_WUTR_Pos)

/** @} */ /* End of group MDR32VF0xI_BKP_RTC_WUTR */

/** @defgroup MDR32VF0xI_BKP_RTC_PREDIV_S BKP RTC_PREDIV_S
 * @{
 */

#define BKP_RTC_PREDIV_S_RTC_DIV_Pos 0
#define BKP_RTC_PREDIV_S_RTC_DIV_Msk (0xFFFFFUL << BKP_RTC_PREDIV_S_RTC_DIV_Pos)

/** @} */ /* End of group MDR32VF0xI_BKP_RTC_PREDIV_S */

/** @defgroup MDR32VF0xI_BKP_RTC_PRL BKP RTC_PRL
 * @{
 */

#define BKP_RTC_PRL_RTC_PRL_Pos 0
#define BKP_RTC_PRL_RTC_PRL_Msk (0xFFFFFUL << BKP_RTC_PRL_RTC_PRL_Pos)

/** @} */ /* End of group MDR32VF0xI_BKP_RTC_PRL */

/** @defgroup MDR32VF0xI_BKP_RTC_ALRM BKP RTC_ALRM
 * @{
 */

#define BKP_RTC_ALRM_RTC_ALRM_Pos 0
#define BKP_RTC_ALRM_RTC_ALRM_Msk (0xFFFFFFFFUL << BKP_RTC_ALRM_RTC_ALRM_Pos)

/** @} */ /* End of group MDR32VF0xI_BKP_RTC_ALRM */

/** @defgroup MDR32VF0xI_BKP_RTC_CS BKP RTC_CS
 * @{
 */

#define BKP_RTC_CS_OWF_Pos      0
#define BKP_RTC_CS_OWF_Msk      (0x1UL << BKP_RTC_CS_OWF_Pos)
#define BKP_RTC_CS_OWF          BKP_RTC_CS_OWF_Msk

#define BKP_RTC_CS_SECF_Pos     1
#define BKP_RTC_CS_SECF_Msk     (0x1UL << BKP_RTC_CS_SECF_Pos)
#define BKP_RTC_CS_SECF         BKP_RTC_CS_SECF_Msk

#define BKP_RTC_CS_WUTF_Pos     2
#define BKP_RTC_CS_WUTF_Msk     (0x1UL << BKP_RTC_CS_WUTF_Pos)
#define BKP_RTC_CS_WUTF         BKP_RTC_CS_WUTF_Msk

#define BKP_RTC_CS_OWF_IE_Pos   3
#define BKP_RTC_CS_OWF_IE_Msk   (0x1UL << BKP_RTC_CS_OWF_IE_Pos)
#define BKP_RTC_CS_OWF_IE       BKP_RTC_CS_OWF_IE_Msk

#define BKP_RTC_CS_SECF_IE_Pos  4
#define BKP_RTC_CS_SECF_IE_Msk  (0x1UL << BKP_RTC_CS_SECF_IE_Pos)
#define BKP_RTC_CS_SECF_IE      BKP_RTC_CS_SECF_IE_Msk

#define BKP_RTC_CS_WUTF_IE_Pos  5
#define BKP_RTC_CS_WUTF_IE_Msk  (0x1UL << BKP_RTC_CS_WUTF_IE_Pos)
#define BKP_RTC_CS_WUTF_IE      BKP_RTC_CS_WUTF_IE_Msk

#define BKP_RTC_CS_WEC_Pos      6
#define BKP_RTC_CS_WEC_Msk      (0x1UL << BKP_RTC_CS_WEC_Pos)
#define BKP_RTC_CS_WEC          BKP_RTC_CS_WEC_Msk

#define BKP_RTC_CS_ALRA_EN_Pos  7
#define BKP_RTC_CS_ALRA_EN_Msk  (0x1UL << BKP_RTC_CS_ALRA_EN_Pos)
#define BKP_RTC_CS_ALRA_EN      BKP_RTC_CS_ALRA_EN_Msk

#define BKP_RTC_CS_ALRB_EN_Pos  8
#define BKP_RTC_CS_ALRB_EN_Msk  (0x1UL << BKP_RTC_CS_ALRB_EN_Pos)
#define BKP_RTC_CS_ALRB_EN      BKP_RTC_CS_ALRB_EN_Msk

#define BKP_RTC_CS_ALRAF_Pos    9
#define BKP_RTC_CS_ALRAF_Msk    (0x1UL << BKP_RTC_CS_ALRAF_Pos)
#define BKP_RTC_CS_ALRAF        BKP_RTC_CS_ALRAF_Msk

#define BKP_RTC_CS_ALRBF_Pos    10
#define BKP_RTC_CS_ALRBF_Msk    (0x1UL << BKP_RTC_CS_ALRBF_Pos)
#define BKP_RTC_CS_ALRBF        BKP_RTC_CS_ALRBF_Msk

#define BKP_RTC_CS_ALRAF_IE_Pos 11
#define BKP_RTC_CS_ALRAF_IE_Msk (0x1UL << BKP_RTC_CS_ALRAF_IE_Pos)
#define BKP_RTC_CS_ALRAF_IE     BKP_RTC_CS_ALRAF_IE_Msk

#define BKP_RTC_CS_ALRBF_IE_Pos 12
#define BKP_RTC_CS_ALRBF_IE_Msk (0x1UL << BKP_RTC_CS_ALRBF_IE_Pos)
#define BKP_RTC_CS_ALRBF_IE     BKP_RTC_CS_ALRBF_IE_Msk

#define BKP_RTC_CS_TSF_Pos      13
#define BKP_RTC_CS_TSF_Msk      (0x1UL << BKP_RTC_CS_TSF_Pos)
#define BKP_RTC_CS_TSF          BKP_RTC_CS_TSF_Msk

/** @} */ /* End of group MDR32VF0xI_BKP_RTC_CS */

/** @defgroup MDR32VF0xI_BKP_RTC_TR BKP RTC_TR
 * @{
 */

#define BKP_RTC_TR_SU_Pos  0
#define BKP_RTC_TR_SU_Msk  (0xFUL << BKP_RTC_TR_SU_Pos)

