piborisovich/microcontrollers/Milandr/Libraries/CMSIS/MDR32VF0xI/DeviceSupport/inc/MDR32VF0xI.h
#define BKP_RTC_TR_ST_Pos  4
#define BKP_RTC_TR_ST_Msk  (0x7UL << BKP_RTC_TR_ST_Pos)

#define BKP_RTC_TR_MNU_Pos 8
#define BKP_RTC_TR_MNU_Msk (0xFUL << BKP_RTC_TR_MNU_Pos)

#define BKP_RTC_TR_MNT_Pos 12
#define BKP_RTC_TR_MNT_Msk (0x7UL << BKP_RTC_TR_MNT_Pos)

#define BKP_RTC_TR_HU_Pos  16
#define BKP_RTC_TR_HU_Msk  (0xFUL << BKP_RTC_TR_HU_Pos)

#define BKP_RTC_TR_HT_Pos  20
#define BKP_RTC_TR_HT_Msk  (0x3UL << BKP_RTC_TR_HT_Pos)

#define BKP_RTC_TR_PM_Pos  22
#define BKP_RTC_TR_PM_Msk  (0x1UL << BKP_RTC_TR_PM_Pos)
#define BKP_RTC_TR_PM      BKP_RTC_TR_PM_Msk

/** @} */ /* End of group MDR32VF0xI_BKP_RTC_TR */

/** @defgroup MDR32VF0xI_BKP_RTC_DR BKP RTC_DR
 * @{
 */

#define BKP_RTC_DR_DU_Pos  0
#define BKP_RTC_DR_DU_Msk  (0xFUL << BKP_RTC_DR_DU_Pos)

#define BKP_RTC_DR_DT_Pos  4
#define BKP_RTC_DR_DT_Msk  (0x3UL << BKP_RTC_DR_DT_Pos)

#define BKP_RTC_DR_MU_Pos  8
#define BKP_RTC_DR_MU_Msk  (0xFUL << BKP_RTC_DR_MU_Pos)

#define BKP_RTC_DR_MT_Pos  12
#define BKP_RTC_DR_MT_Msk  (0x1UL << BKP_RTC_DR_MT_Pos)
#define BKP_RTC_DR_MT      BKP_RTC_DR_MT_Msk

#define BKP_RTC_DR_WDU_Pos 13
#define BKP_RTC_DR_WDU_Msk (0x7UL << BKP_RTC_DR_WDU_Pos)

#define BKP_RTC_DR_YU_Pos  16
#define BKP_RTC_DR_YU_Msk  (0xFUL << BKP_RTC_DR_YU_Pos)

#define BKP_RTC_DR_YT_Pos  20
#define BKP_RTC_DR_YT_Msk  (0xFUL << BKP_RTC_DR_YT_Pos)

/** @} */ /* End of group MDR32VF0xI_BKP_RTC_DR */

/** @defgroup MDR32VF0xI_BKP_RTC_ALARMxR BKP RTC_ALARMxR
 * @{
 */

#define BKP_RTC_ALARMxR_SU_Pos    0
#define BKP_RTC_ALARMxR_SU_Msk    (0xFUL << BKP_RTC_ALARMxR_SU_Pos)

#define BKP_RTC_ALARMxR_ST_Pos    4
#define BKP_RTC_ALARMxR_ST_Msk    (0x7UL << BKP_RTC_ALARMxR_ST_Pos)

#define BKP_RTC_ALARMxR_MSK1_Pos  7
#define BKP_RTC_ALARMxR_MSK1_Msk  (0x1UL << BKP_RTC_ALARMxR_MSK1_Pos)
#define BKP_RTC_ALARMxR_MSK1      BKP_RTC_ALARMxR_MSK1_Msk

#define BKP_RTC_ALARMxR_MNU_Pos   8
#define BKP_RTC_ALARMxR_MNU_Msk   (0xFUL << BKP_RTC_ALARMxR_MNU_Pos)

#define BKP_RTC_ALARMxR_MNT_Pos   12
#define BKP_RTC_ALARMxR_MNT_Msk   (0x7UL << BKP_RTC_ALARMxR_MNT_Pos)

#define BKP_RTC_ALARMxR_MSK2_Pos  15
#define BKP_RTC_ALARMxR_MSK2_Msk  (0x1UL << BKP_RTC_ALARMxR_MSK2_Pos)
#define BKP_RTC_ALARMxR_MSK2      BKP_RTC_ALARMxR_MSK2_Msk

#define BKP_RTC_ALARMxR_HU_Pos    16
#define BKP_RTC_ALARMxR_HU_Msk    (0xFUL << BKP_RTC_ALARMxR_HU_Pos)

#define BKP_RTC_ALARMxR_HT_Pos    20
#define BKP_RTC_ALARMxR_HT_Msk    (0x3UL << BKP_RTC_ALARMxR_HT_Pos)

#define BKP_RTC_ALARMxR_PM_Pos    22
#define BKP_RTC_ALARMxR_PM_Msk    (0x1UL << BKP_RTC_ALARMxR_PM_Pos)
#define BKP_RTC_ALARMxR_PM        BKP_RTC_ALARMxR_PM_Msk

#define BKP_RTC_ALARMxR_MSK3_Pos  23
#define BKP_RTC_ALARMxR_MSK3_Msk  (0x1UL << BKP_RTC_ALARMxR_MSK3_Pos)
#define BKP_RTC_ALARMxR_MSK3      BKP_RTC_ALARMxR_MSK3_Msk

#define BKP_RTC_ALARMxR_DU_Pos    24
#define BKP_RTC_ALARMxR_DU_Msk    (0xFUL << BKP_RTC_ALARMxR_DU_Pos)

#define BKP_RTC_ALARMxR_DT_Pos    28
#define BKP_RTC_ALARMxR_DT_Msk    (0x3UL << BKP_RTC_ALARMxR_DT_Pos)

#define BKP_RTC_ALARMxR_WDSEL_Pos 30
#define BKP_RTC_ALARMxR_WDSEL_Msk (0x1UL << BKP_RTC_ALARMxR_WDSEL_Pos)
#define BKP_RTC_ALARMxR_WDSEL     BKP_RTC_ALARMxR_WDSEL_Msk

#define BKP_RTC_ALARMxR_MSK4_Pos  31
#define BKP_RTC_ALARMxR_MSK4_Msk  (0x1UL << BKP_RTC_ALARMxR_MSK4_Pos)
#define BKP_RTC_ALARMxR_MSK4      BKP_RTC_ALARMxR_MSK4_Msk

/** @} */ /* End of group MDR32VF0xI_BKP_RTC_ALARMxR */

/** @defgroup MDR32VF0xI_BKP_RTC_TSTRx BKP RTC_TSTRx
 * @{
 */

#define BKP_RTC_TSTRx_SU_Pos  0
#define BKP_RTC_TSTRx_SU_Msk  (0xFUL << BKP_RTC_TSTRx_SU_Pos)

#define BKP_RTC_TSTRx_ST_Pos  4
#define BKP_RTC_TSTRx_ST_Msk  (0x7UL << BKP_RTC_TSTRx_ST_Pos)

#define BKP_RTC_TSTRx_MNU_Pos 8
#define BKP_RTC_TSTRx_MNU_Msk (0xFUL << BKP_RTC_TSTRx_MNU_Pos)

#define BKP_RTC_TSTRx_MNT_Pos 12
#define BKP_RTC_TSTRx_MNT_Msk (0x7UL << BKP_RTC_TSTRx_MNT_Pos)

#define BKP_RTC_TSTRx_HU_Pos  16
#define BKP_RTC_TSTRx_HU_Msk  (0xFUL << BKP_RTC_TSTRx_HU_Pos)

#define BKP_RTC_TSTRx_HT_Pos  20
#define BKP_RTC_TSTRx_HT_Msk  (0x3UL << BKP_RTC_TSTRx_HT_Pos)

#define BKP_RTC_TSTRx_PM_Pos  22
#define BKP_RTC_TSTRx_PM_Msk  (0x1UL << BKP_RTC_TSTRx_PM_Pos)
#define BKP_RTC_TSTRx_PM      BKP_RTC_TSTRx_PM_Msk

/** @} */ /* End of group MDR32VF0xI_BKP_RTC_TSTRx */

/** @defgroup MDR32VF0xI_BKP_RTC_TSDRx BKP RTC_TSDRx
 * @{
 */

#define BKP_RTC_TSDRx_DU_Pos  0
#define BKP_RTC_TSDRx_DU_Msk  (0xFUL << BKP_RTC_TSDRx_DU_Pos)

#define BKP_RTC_TSDRx_DT_Pos  4
#define BKP_RTC_TSDRx_DT_Msk  (0x3UL << BKP_RTC_TSDRx_DT_Pos)

#define BKP_RTC_TSDRx_MU_Pos  8
#define BKP_RTC_TSDRx_MU_Msk  (0xFUL << BKP_RTC_TSDRx_MU_Pos)

#define BKP_RTC_TSDRx_MT_Pos  12
#define BKP_RTC_TSDRx_MT_Msk  (0x1UL << BKP_RTC_TSDRx_MT_Pos)
#define BKP_RTC_TSDRx_MT      BKP_RTC_TSDRx_MT_Msk

#define BKP_RTC_TSDRx_WDU_Pos 13
#define BKP_RTC_TSDRx_WDU_Msk (0x7UL << BKP_RTC_TSDRx_WDU_Pos)

#define BKP_RTC_TSDRx_YU_Pos  16
#define BKP_RTC_TSDRx_YU_Msk  (0xFUL << BKP_RTC_TSDRx_YU_Pos)

#define BKP_RTC_TSDRx_YT_Pos  20
#define BKP_RTC_TSDRx_YT_Msk  (0xFUL << BKP_RTC_TSDRx_YT_Pos)

/** @} */ /* End of group MDR32VF0xI_BKP_RTC_TSDRx */

/** @defgroup MDR32VF0xI_BKP_RTC_TAFCR BKP RTC_TAFCR
 * @{
 */

#define BKP_RTC_TAFCR_TAMP_EN_Pos     0
#define BKP_RTC_TAFCR_TAMP_EN_Msk     (0x1UL << BKP_RTC_TAFCR_TAMP_EN_Pos)
#define BKP_RTC_TAFCR_TAMP_EN         BKP_RTC_TAFCR_TAMP_EN_Msk

#define BKP_RTC_TAFCR_TAMP_TRG_Pos    1
#define BKP_RTC_TAFCR_TAMP_TRG_Msk    (0x7UL << BKP_RTC_TAFCR_TAMP_TRG_Pos)
#define BKP_RTC_TAFCR_TAMP_TRG1       (0x1UL << BKP_RTC_TAFCR_TAMP_TRG_Pos)
#define BKP_RTC_TAFCR_TAMP_TRG2       (0x2UL << BKP_RTC_TAFCR_TAMP_TRG_Pos)
#define BKP_RTC_TAFCR_TAMP_TRG3       (0x4UL << BKP_RTC_TAFCR_TAMP_TRG_Pos)

#define BKP_RTC_TAFCR_TAMP_IE_Pos     4
#define BKP_RTC_TAFCR_TAMP_IE_Msk     (0x1UL << BKP_RTC_TAFCR_TAMP_IE_Pos)
#define BKP_RTC_TAFCR_TAMP_IE         BKP_RTC_TAFCR_TAMP_IE_Msk

#define BKP_RTC_TAFCR_TS_EN_Pos       5
#define BKP_RTC_TAFCR_TS_EN_Msk       (0x1UL << BKP_RTC_TAFCR_TS_EN_Pos)
#define BKP_RTC_TAFCR_TS_EN           BKP_RTC_TAFCR_TS_EN_Msk

#define BKP_RTC_TAFCR_TS_EDGE_Pos     6
#define BKP_RTC_TAFCR_TS_EDGE_Msk     (0x7UL << BKP_RTC_TAFCR_TS_EDGE_Pos)
#define BKP_RTC_TAFCR_TS_EDGE1        (0x1UL << BKP_RTC_TAFCR_TS_EDGE_Pos)
#define BKP_RTC_TAFCR_TS_EDGE2        (0x2UL << BKP_RTC_TAFCR_TS_EDGE_Pos)
#define BKP_RTC_TAFCR_TS_EDGE3        (0x4UL << BKP_RTC_TAFCR_TS_EDGE_Pos)

