piborisovich/microcontrollers/Milandr/Libraries/CMSIS/MDR32VF0xI/DeviceSupport/inc/MDR32VF0xI.h
#define BKP_RTC_TAFCR_TS_IE_Pos       9
#define BKP_RTC_TAFCR_TS_IE_Msk       (0x1UL << BKP_RTC_TAFCR_TS_IE_Pos)
#define BKP_RTC_TAFCR_TS_IE           BKP_RTC_TAFCR_TS_IE_Msk

#define BKP_RTC_TAFCR_TAMP_IN_SEL_Pos 16
#define BKP_RTC_TAFCR_TAMP_IN_SEL_Msk (0x7UL << BKP_RTC_TAFCR_TAMP_IN_SEL_Pos)
#define BKP_RTC_TAFCR_TAMP_IN_SEL1    (0x1UL << BKP_RTC_TAFCR_TAMP_IN_SEL_Pos)
#define BKP_RTC_TAFCR_TAMP_IN_SEL2    (0x2UL << BKP_RTC_TAFCR_TAMP_IN_SEL_Pos)
#define BKP_RTC_TAFCR_TAMP_IN_SEL3    (0x4UL << BKP_RTC_TAFCR_TAMP_IN_SEL_Pos)

#define BKP_RTC_TAFCR_TS_IN_SEL_Pos   19
#define BKP_RTC_TAFCR_TS_IN_SEL_Msk   (0x7UL << BKP_RTC_TAFCR_TS_IN_SEL_Pos)
#define BKP_RTC_TAFCR_TS_IN_SEL1      (0x1UL << BKP_RTC_TAFCR_TS_IN_SEL_Pos)
#define BKP_RTC_TAFCR_TS_IN_SEL2      (0x2UL << BKP_RTC_TAFCR_TS_IN_SEL_Pos)
#define BKP_RTC_TAFCR_TS_IN_SEL3      (0x4UL << BKP_RTC_TAFCR_TS_IN_SEL_Pos)

#if defined(USE_MDR32F02_REV_2) || defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)

#define BKP_RTC_TAFCR_WAKE_SLEEP_Pos   22
#define BKP_RTC_TAFCR_WAKE_SLEEP_Msk   (0x1UL << BKP_RTC_TAFCR_WAKE_SLEEP_Pos)
#define BKP_RTC_TAFCR_WAKE_SLEEP       BKP_RTC_TAFCR_WAKE_SLEEP_Msk

#define BKP_RTC_TAFCR_TAMP_EN_W_Pos    23
#define BKP_RTC_TAFCR_TAMP_EN_W_Msk    (0x7UL << BKP_RTC_TAFCR_TAMP_EN_W_Pos)
#define BKP_RTC_TAFCR_TAMP_EN_W1       (0x1UL << BKP_RTC_TAFCR_TAMP_EN_W_Pos)
#define BKP_RTC_TAFCR_TAMP_EN_W2       (0x2UL << BKP_RTC_TAFCR_TAMP_EN_W_Pos)
#define BKP_RTC_TAFCR_TAMP_EN_W3       (0x4UL << BKP_RTC_TAFCR_TAMP_EN_W_Pos)

#define BKP_RTC_TAFCR_TAMP_EDGE_W_Pos  26
#define BKP_RTC_TAFCR_TAMP_EDGE_W_Msk  (0x7UL << BKP_RTC_TAFCR_TAMP_EDGE_W_Pos)
#define BKP_RTC_TAFCR_TAMP_EDGE_W1     (0x1UL << BKP_RTC_TAFCR_TAMP_EDGE_W_Pos)
#define BKP_RTC_TAFCR_TAMP_EDGE_W2     (0x2UL << BKP_RTC_TAFCR_TAMP_EDGE_W_Pos)
#define BKP_RTC_TAFCR_TAMP_EDGE_W3     (0x4UL << BKP_RTC_TAFCR_TAMP_EDGE_W_Pos)

#define BKP_RTC_TAFCR_TAMP_LEVEL_W_Pos 29
#define BKP_RTC_TAFCR_TAMP_LEVEL_W_Msk (0x7UL << BKP_RTC_TAFCR_TAMP_LEVEL_W_Pos)
#define BKP_RTC_TAFCR_TAMP_LEVEL_W1    (0x1UL << BKP_RTC_TAFCR_TAMP_LEVEL_W_Pos)
#define BKP_RTC_TAFCR_TAMP_LEVEL_W2    (0x2UL << BKP_RTC_TAFCR_TAMP_LEVEL_W_Pos)
#define BKP_RTC_TAFCR_TAMP_LEVEL_W3    (0x4UL << BKP_RTC_TAFCR_TAMP_LEVEL_W_Pos)

#endif

/** @} */ /* End of group MDR32VF0xI_BKP_RTC_TAFCR */

#if defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)

/** @defgroup MDR32VF0xI_BKP_RTC_TMPCAL1 BKP RTC_TMPCAL1
 * @{
 */

#define BKP_RTC_TMPCAL1_CONST0_Pos     0
#define BKP_RTC_TMPCAL1_CONST0_Msk     (0x1FUL << BKP_RTC_TMPCAL1_CONST0_Pos)

#define BKP_RTC_TMPCAL1_CONST1_Pos     5
#define BKP_RTC_TMPCAL1_CONST1_Msk     (0x1FUL << BKP_RTC_TMPCAL1_CONST1_Pos)

#define BKP_RTC_TMPCAL1_CONST2_Pos     10
#define BKP_RTC_TMPCAL1_CONST2_Msk     (0x1FUL << BKP_RTC_TMPCAL1_CONST2_Pos)

#define BKP_RTC_TMPCAL1_CONST3_Pos     15
#define BKP_RTC_TMPCAL1_CONST3_Msk     (0x1FUL << BKP_RTC_TMPCAL1_CONST3_Pos)

#define BKP_RTC_TMPCAL1_CONST4_Pos     20
#define BKP_RTC_TMPCAL1_CONST4_Msk     (0x1FUL << BKP_RTC_TMPCAL1_CONST4_Pos)

#define BKP_RTC_TMPCAL1_CONST5_Pos     25
#define BKP_RTC_TMPCAL1_CONST5_Msk     (0x1FUL << BKP_RTC_TMPCAL1_CONST5_Pos)

#define BKP_RTC_TMPCAL1_CONST6_LOW_Pos 30
#define BKP_RTC_TMPCAL1_CONST6_LOW_Msk (0x3UL << BKP_RTC_TMPCAL1_CONST6_LOW_Pos)

/** @} */ /* End of group MDR32VF0xI_BKP_RTC_TMPCAL1 */

/** @defgroup MDR32VF0xI_BKP_RTC_TMPCAL2 BKP RTC_TMPCAL2
 * @{
 */

#define BKP_RTC_TMPCAL2_CONST6_HIGH_Pos 0
#define BKP_RTC_TMPCAL2_CONST6_HIGH_Msk (0x7UL << BKP_RTC_TMPCAL2_CONST6_HIGH_Pos)

#define BKP_RTC_TMPCAL2_CONST7_Pos      3
#define BKP_RTC_TMPCAL2_CONST7_Msk      (0x1FUL << BKP_RTC_TMPCAL2_CONST7_Pos)

#define BKP_RTC_TMPCAL2_CONST8_Pos      8
#define BKP_RTC_TMPCAL2_CONST8_Msk      (0x1FUL << BKP_RTC_TMPCAL2_CONST8_Pos)

#define BKP_RTC_TMPCAL2_CONST9_Pos      13
#define BKP_RTC_TMPCAL2_CONST9_Msk      (0x1FUL << BKP_RTC_TMPCAL2_CONST9_Pos)

#define BKP_RTC_TMPCAL2_CONST10_Pos     18
#define BKP_RTC_TMPCAL2_CONST10_Msk     (0x1FUL << BKP_RTC_TMPCAL2_CONST10_Pos)

#define BKP_RTC_TMPCAL2_CONST11_Pos     23
#define BKP_RTC_TMPCAL2_CONST11_Msk     (0x1FUL << BKP_RTC_TMPCAL2_CONST11_Pos)

#define BKP_RTC_TMPCAL2_CONST12_LOW_Pos 28
#define BKP_RTC_TMPCAL2_CONST12_LOW_Msk (0xFUL << BKP_RTC_TMPCAL2_CONST12_LOW_Pos)

/** @} */ /* End of group MDR32VF0xI_BKP_RTC_TMPCAL2 */

/** @defgroup MDR32VF0xI_BKP_RTC_TMPCAL3 BKP RTC_TMPCAL3
 * @{
 */

#define BKP_RTC_TMPCAL3_SWCTR_INV_Pos       0
#define BKP_RTC_TMPCAL3_SWCTR_INV_Msk       (0x1UL << BKP_RTC_TMPCAL3_SWCTR_INV_Pos)
#define BKP_RTC_TMPCAL3_SWCTR_INV           BKP_RTC_TMPCAL3_SWCTR_INV_Msk

#define BKP_RTC_TMPCAL3_BLDO_TRIM_B2_Pos    2
#define BKP_RTC_TMPCAL3_BLDO_TRIM_B2_Msk    (0x1UL << BKP_RTC_TMPCAL3_BLDO_TRIM_B2_Pos)
#define BKP_RTC_TMPCAL3_BLDO_TRIM_B2        BKP_RTC_TMPCAL3_BLDO_TRIM_B2_Msk

#define BKP_RTC_TMPCAL3_LSE_CONF_B2_Pos     3
#define BKP_RTC_TMPCAL3_LSE_CONF_B2_Msk     (0x1UL << BKP_RTC_TMPCAL3_LSE_CONF_B2_Pos)
#define BKP_RTC_TMPCAL3_LSE_CONF_B2         BKP_RTC_TMPCAL3_LSE_CONF_B2_Msk

#define BKP_RTC_TMPCAL3_TEMP_EN_Pos         4
#define BKP_RTC_TMPCAL3_TEMP_EN_Msk         (0x1UL << BKP_RTC_TMPCAL3_TEMP_EN_Pos)
#define BKP_RTC_TMPCAL3_TEMP_EN             BKP_RTC_TMPCAL3_TEMP_EN_Msk

#define BKP_RTC_TMPCAL3_CONST12_HIGH_Pos    8
#define BKP_RTC_TMPCAL3_CONST12_HIGH_Msk    (0x1UL << BKP_RTC_TMPCAL3_CONST12_HIGH_Pos)
#define BKP_RTC_TMPCAL3_CONST12_HIGH        BKP_RTC_TMPCAL3_CONST12_HIGH_Msk

#define BKP_RTC_TMPCAL3_CONST13_Pos         9
#define BKP_RTC_TMPCAL3_CONST13_Msk         (0x1FUL << BKP_RTC_TMPCAL3_CONST13_Pos)

#define BKP_RTC_TMPCAL3_CONST14_Pos         14
#define BKP_RTC_TMPCAL3_CONST14_Msk         (0x1FUL << BKP_RTC_TMPCAL3_CONST14_Pos)

#define BKP_RTC_TMPCAL3_CONST15_Pos         19
#define BKP_RTC_TMPCAL3_CONST15_Msk         (0x1FUL << BKP_RTC_TMPCAL3_CONST15_Pos)

#define BKP_RTC_TMPCAL3_TEMP_RESULT_Pos     24
#define BKP_RTC_TMPCAL3_TEMP_RESULT_Msk     (0xFUL << BKP_RTC_TMPCAL3_TEMP_RESULT_Pos)

#define BKP_RTC_TMPCAL3_TEMP_RESULT_RDY_Pos 28
#define BKP_RTC_TMPCAL3_TEMP_RESULT_RDY_Msk (0x1UL << BKP_RTC_TMPCAL3_TEMP_RESULT_RDY_Pos)
#define BKP_RTC_TMPCAL3_TEMP_RESULT_RDY     BKP_RTC_TMPCAL3_TEMP_RESULT_RDY_Msk

/** @} */ /* End of group MDR32VF0xI_BKP_RTC_TMPCAL3 */

#endif

/** @} */ /* End of group MDR32VF0xI_BKP_Defines */

