piborisovich/microcontrollers/Milandr/Libraries/CMSIS/MDR32VF0xI/DeviceSupport/inc/MDR32VF0xI.h
    __IO uint32_t F0IRMS_INACTIVE; /*!<ADCUI RMS Current Inactive Channel F0 Register */

    __IO uint32_t F0WATTP_L; /*!<ADCUI Positive Active Power Value (bits [24..0]) Register for Channel F0 */
    __IO uint32_t F0WATTN_L; /*!<ADCUI Negative Active Power Value (bits [24..0]) Register for Channel F0 */
    __IO uint32_t F0VARP_L;  /*!<ADCUI Positive Reactive Power Value (bits [24..0]) Register for Channel F0 */
    __IO uint32_t F0VARN_L;  /*!<ADCUI Negative Reactive Power Value (bits [24..0]) Register for Channel F0 */
    __IO uint32_t F0VR_L;    /*!<ADCUI Full Power Value (bits [24..0]) Register for Channel F0 */
    __IO uint32_t F1WATTP_L; /*!<ADCUI Positive Active Power Value (bits [24..0]) Register for Channel F1 */
    __IO uint32_t F1WATTN_L; /*!<ADCUI Negative Active Power Value (bits [24..0]) Register for Channel F1 */
    __IO uint32_t F1VARP_L;  /*!<ADCUI Positive Reactive Power Value (bits [24..0]) Register for Channel F1 */
    __IO uint32_t F1VARN_L;  /*!<ADCUI Negative Reactive Power Value (bits [24..0]) Register for Channel F1 */
    __IO uint32_t F1VR_L;    /*!<ADCUI Full Power Value (bits [24..0]) Register for Channel F1 */
    __IO uint32_t F2WATTP_L; /*!<ADCUI Positive Active Power Value (bits [24..0]) Register for Channel F2 */
    __IO uint32_t F2WATTN_L; /*!<ADCUI Negative Active Power Value (bits [24..0]) Register for Channel F2 */
    __IO uint32_t F2VARP_L;  /*!<ADCUI Positive Reactive Power Value (bits [24..0]) Register for Channel F2 */
    __IO uint32_t F2VARN_L;  /*!<ADCUI Negative Reactive Power Value (bits [24..0]) Register for Channel F2 */
    __IO uint32_t F2VR_L;    /*!<ADCUI Full Power Value (bits [24..0]) Register for Channel F2 */
#if defined(USE_MDR32F02_REV_2) || defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)
    __IO uint32_t LOAD; /*!<ADCUI General Control of NOLOAD Mode Register */

    __IO uint32_t F0VRMS_TRUE; /*!<ADCUI Effective Value of Voltage Channel on Period Register for Channel F0 */
    __IO uint32_t F1VRMS_TRUE; /*!<ADCUI Effective Value of Voltage Channel on Period Register for Channel F1 */
    __IO uint32_t F2VRMS_TRUE; /*!<ADCUI Effective Value of Voltage Channel on Period Register for Channel F2 */
#endif
#if defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)
    __IO uint32_t MSC; /*!<ADCUI Parameters Register for Channels Fx */

    __IO uint32_t FILTERCFG; /*!<ADCUI Filters Configuration Register */

    __IO uint32_t CLKPHASE1; /*!<ADCUI Clock and Phase Shift Configuration Register */
    __IO uint32_t CLKPHASE2; /*!<ADCUI Phase Shift Configuration Register */
#endif
} MDR_ADCUI_TypeDef;

/** @defgroup MDR32VF0xI_ADCUI_Defines ADCUI Defines
 * @{
 */

/** @defgroup MDR32VF0xI_ADCUI_CTRL1 ADCUI CTRL1
 * @{
 */

#define ADCUI_CTRL1_I0EN_Pos             0
#define ADCUI_CTRL1_I0EN_Msk             (0x1UL << ADCUI_CTRL1_I0EN_Pos)
#define ADCUI_CTRL1_I0EN                 ADCUI_CTRL1_I0EN_Msk

#define ADCUI_CTRL1_V0EN_Pos             1
#define ADCUI_CTRL1_V0EN_Msk             (0x1UL << ADCUI_CTRL1_V0EN_Pos)
#define ADCUI_CTRL1_V0EN                 ADCUI_CTRL1_V0EN_Msk

#define ADCUI_CTRL1_I1EN_Pos             2
#define ADCUI_CTRL1_I1EN_Msk             (0x1UL << ADCUI_CTRL1_I1EN_Pos)
#define ADCUI_CTRL1_I1EN                 ADCUI_CTRL1_I1EN_Msk

#define ADCUI_CTRL1_V1EN_Pos             3
#define ADCUI_CTRL1_V1EN_Msk             (0x1UL << ADCUI_CTRL1_V1EN_Pos)
#define ADCUI_CTRL1_V1EN                 ADCUI_CTRL1_V1EN_Msk

#define ADCUI_CTRL1_I2EN_Pos             4
#define ADCUI_CTRL1_I2EN_Msk             (0x1UL << ADCUI_CTRL1_I2EN_Pos)
#define ADCUI_CTRL1_I2EN                 ADCUI_CTRL1_I2EN_Msk

#define ADCUI_CTRL1_V2EN_Pos             5
#define ADCUI_CTRL1_V2EN_Msk             (0x1UL << ADCUI_CTRL1_V2EN_Pos)
#define ADCUI_CTRL1_V2EN                 ADCUI_CTRL1_V2EN_Msk

#define ADCUI_CTRL1_I3EN_Pos             6
#define ADCUI_CTRL1_I3EN_Msk             (0X1UL << ADCUI_CTRL1_I3EN_Pos)
#define ADCUI_CTRL1_I3EN                 ADCUI_CTRL1_I3EN_Msk

#define ADCUI_CTRL1_RESOL_Pos            7
#define ADCUI_CTRL1_RESOL_Msk            (0x1UL << ADCUI_CTRL1_RESOL_Pos)
#define ADCUI_CTRL1_RESOL                ADCUI_CTRL1_RESOL_Msk

#define ADCUI_CTRL1_ZXLPF_Pos            8
#define ADCUI_CTRL1_ZXLPF_Msk            (0x1UL << ADCUI_CTRL1_ZXLPF_Pos)
#define ADCUI_CTRL1_ZXLPF                ADCUI_CTRL1_ZXLPF_Msk

#define ADCUI_CTRL1_PER_LENGHT_Pos       9
#define ADCUI_CTRL1_PER_LENGHT_Msk       (0x7UL << ADCUI_CTRL1_PER_LENGHT_Pos)
#define ADCUI_CTRL1_PER_LENGHT_1         (0x0UL << ADCUI_CTRL1_PER_LENGHT_Pos)
#define ADCUI_CTRL1_PER_LENGHT_2         (0x1UL << ADCUI_CTRL1_PER_LENGHT_Pos)
#define ADCUI_CTRL1_PER_LENGHT_4         (0x2UL << ADCUI_CTRL1_PER_LENGHT_Pos)
#define ADCUI_CTRL1_PER_LENGHT_8         (0x3UL << ADCUI_CTRL1_PER_LENGHT_Pos)
#define ADCUI_CTRL1_PER_LENGHT_16        (0x4UL << ADCUI_CTRL1_PER_LENGHT_Pos)
#define ADCUI_CTRL1_PER_LENGHT_32        (0x5UL << ADCUI_CTRL1_PER_LENGHT_Pos)
#define ADCUI_CTRL1_PER_LENGHT_64        (0x6UL << ADCUI_CTRL1_PER_LENGHT_Pos)
#define ADCUI_CTRL1_PER_LENGHT_128       (0x7UL << ADCUI_CTRL1_PER_LENGHT_Pos)

#define ADCUI_CTRL1_APNOLOAD_Pos         12
#define ADCUI_CTRL1_APNOLOAD_Msk         (0x3UL << ADCUI_CTRL1_APNOLOAD_Pos)
#define ADCUI_CTRL1_APNOLOAD_FULL        (0x0UL << ADCUI_CTRL1_APNOLOAD_Pos)
#define ADCUI_CTRL1_APNOLOAD_0p012pct    (0x1UL << ADCUI_CTRL1_APNOLOAD_Pos)
#define ADCUI_CTRL1_APNOLOAD_0p0061pct   (0x2UL << ADCUI_CTRL1_APNOLOAD_Pos)
#define ADCUI_CTRL1_APNOLOAD_0p00305pct  (0x3UL << ADCUI_CTRL1_APNOLOAD_Pos)

#define ADCUI_CTRL1_VARNOLOAD_Pos        15
#define ADCUI_CTRL1_VARNOLOAD_Msk        (0x3UL << ADCUI_CTRL1_VARNOLOAD_Pos)
#define ADCUI_CTRL1_VARNOLOAD_FULL       (0x0UL << ADCUI_CTRL1_VARNOLOAD_Pos)
#define ADCUI_CTRL1_VARNOLOAD_0p012pct   (0x1UL << ADCUI_CTRL1_VARNOLOAD_Pos)
#define ADCUI_CTRL1_VARNOLOAD_0p0061pct  (0x2UL << ADCUI_CTRL1_VARNOLOAD_Pos)
#define ADCUI_CTRL1_VARNOLOAD_0p00305pct (0x3UL << ADCUI_CTRL1_VARNOLOAD_Pos)

