piborisovich/microcontrollers/Milandr/Libraries/CMSIS/MDR32VF0xI/DeviceSupport/inc/MDR32VF0xI.h
#define ADCUI_CTRL1_VANOLOAD_Pos         17
#define ADCUI_CTRL1_VANOLOAD_Msk         (0x3UL << ADCUI_CTRL1_VANOLOAD_Pos)
#define ADCUI_CTRL1_VANOLOAD_FULL        (0x0UL << ADCUI_CTRL1_VANOLOAD_Pos)
#define ADCUI_CTRL1_VANOLOAD_0p012pct    (0x1UL << ADCUI_CTRL1_VANOLOAD_Pos)
#define ADCUI_CTRL1_VANOLOAD_0p0061pct   (0x2UL << ADCUI_CTRL1_VANOLOAD_Pos)
#define ADCUI_CTRL1_VANOLOAD_0p00305pct  (0x3UL << ADCUI_CTRL1_VANOLOAD_Pos)

#define ADCUI_CTRL1_FREQSEL_Pos          19
#define ADCUI_CTRL1_FREQSEL_Msk          (0x1UL << ADCUI_CTRL1_FREQSEL_Pos)
#define ADCUI_CTRL1_FREQSEL              ADCUI_CTRL1_FREQSEL_Msk

#define ADCUI_CTRL1_VREF_SEL_Pos         20
#define ADCUI_CTRL1_VREF_SEL_Msk         (0x1UL << ADCUI_CTRL1_VREF_SEL_Pos)
#define ADCUI_CTRL1_VREF_SEL             ADCUI_CTRL1_VREF_SEL_Msk

#define ADCUI_CTRL1_TST_IN0_Pos          21
#define ADCUI_CTRL1_TST_IN0_Msk          (0x1UL << ADCUI_CTRL1_TST_IN0_Pos)
#define ADCUI_CTRL1_TST_IN0              ADCUI_CTRL1_TST_IN0_Msk

#define ADCUI_CTRL1_TST_IN1_Pos          22
#define ADCUI_CTRL1_TST_IN1_Msk          (0x1UL << ADCUI_CTRL1_TST_IN1_Pos)
#define ADCUI_CTRL1_TST_IN1              ADCUI_CTRL1_TST_IN1_Msk

#define ADCUI_CTRL1_TST_IN32_Pos         23
#define ADCUI_CTRL1_TST_IN32_Msk         (0x3UL << ADCUI_CTRL1_TST_IN32_Pos)

#define ADCUI_CTRL1_ZXRMS_Pos            27
#define ADCUI_CTRL1_ZXRMS_Msk            (0x1UL << ADCUI_CTRL1_ZXRMS_Pos)
#define ADCUI_CTRL1_ZXRMS                ADCUI_CTRL1_ZXRMS_Msk

#define ADCUI_CTRL1_RESET_DIG_Pos        28
#define ADCUI_CTRL1_RESET_DIG_Msk        (0x1UL << ADCUI_CTRL1_RESET_DIG_Pos)
#define ADCUI_CTRL1_RESET_DIG            ADCUI_CTRL1_RESET_DIG_Msk

#define ADCUI_CTRL1_TST_IN4_Pos          29
#define ADCUI_CTRL1_TST_IN4_Msk          (0x1UL << ADCUI_CTRL1_TST_IN4_Pos)
#define ADCUI_CTRL1_TST_IN4              ADCUI_CTRL1_TST_IN4_Msk

#define ADCUI_CTRL1_OSR_CONF_Pos         30
#define ADCUI_CTRL1_OSR_CONF_Msk         (0x3UL << ADCUI_CTRL1_OSR_CONF_Pos)
#if defined(USE_MDR32F02)
#define ADCUI_CTRL1_OSR_CONF_256_4kHz (0x0UL << ADCUI_CTRL1_OSR_CONF_Pos)
#define ADCUI_CTRL1_OSR_CONF_128_8kHz (0x1UL << ADCUI_CTRL1_OSR_CONF_Pos)
#define ADCUI_CTRL1_OSR_CONF_64_16kHz (0x2UL << ADCUI_CTRL1_OSR_CONF_Pos)
#elif defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)
#define ADCUI_CTRL1_OSR_CONF_1024 (0x0UL << ADCUI_CTRL1_OSR_CONF_Pos)
#define ADCUI_CTRL1_OSR_CONF_512  (0x1UL << ADCUI_CTRL1_OSR_CONF_Pos)
#define ADCUI_CTRL1_OSR_CONF_256  (0x2UL << ADCUI_CTRL1_OSR_CONF_Pos)
#endif

/** @} */ /* End of group MDR32VF0xI_ADCUI_CTRL1 */

/** @defgroup MDR32VF0xI_ADCUI_CTRL2 ADCUI CTRL2
 * @{
 */

#define ADCUI_CTRL2_SAGLVL_Pos 0
#define ADCUI_CTRL2_SAGLVL_Msk (0xFFFFUL << ADCUI_CTRL2_SAGLVL_Pos)

#define ADCUI_CTRL2_SAGCYC_Pos 16
#define ADCUI_CTRL2_SAGCYC_Msk (0xFFUL << ADCUI_CTRL2_SAGCYC_Pos)

#if defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)

#define ADCUI_CTRL2_DCHPENV0_Pos 24
#define ADCUI_CTRL2_DCHPENV0_Msk (0x1UL << ADCUI_CTRL2_DCHPENV0_Pos)
#define ADCUI_CTRL2_DCHPENV0     ADCUI_CTRL2_DCHPENV0_Msk

#define ADCUI_CTRL2_DCHPENV1_Pos 25
#define ADCUI_CTRL2_DCHPENV1_Msk (0x1UL << ADCUI_CTRL2_DCHPENV1_Pos)
#define ADCUI_CTRL2_DCHPENV1     ADCUI_CTRL2_DCHPENV1_Msk

#define ADCUI_CTRL2_DCHPENV2_Pos 26
#define ADCUI_CTRL2_DCHPENV2_Msk (0x1UL << ADCUI_CTRL2_DCHPENV2_Pos)
#define ADCUI_CTRL2_DCHPENV2     ADCUI_CTRL2_DCHPENV2_Msk

#define ADCUI_CTRL2_DCHPENI0_Pos 27
#define ADCUI_CTRL2_DCHPENI0_Msk (0x1UL << ADCUI_CTRL2_DCHPENI0_Pos)
#define ADCUI_CTRL2_DCHPENI0     ADCUI_CTRL2_DCHPENI0_Msk

#define ADCUI_CTRL2_DCHPENI1_Pos 28
#define ADCUI_CTRL2_DCHPENI1_Msk (0x1UL << ADCUI_CTRL2_DCHPENI1_Pos)
#define ADCUI_CTRL2_DCHPENI1     ADCUI_CTRL2_DCHPENI1_Msk

#define ADCUI_CTRL2_DCHPENI2_Pos 29
#define ADCUI_CTRL2_DCHPENI2_Msk (0x1UL << ADCUI_CTRL2_DCHPENI2_Pos)
#define ADCUI_CTRL2_DCHPENI2     ADCUI_CTRL2_DCHPENI2_Msk

#define ADCUI_CTRL2_DCHPENI3_Pos 30
#define ADCUI_CTRL2_DCHPENI3_Msk (0x1UL << ADCUI_CTRL2_DCHPENI3_Pos)
#define ADCUI_CTRL2_DCHPENI3     ADCUI_CTRL2_DCHPENI3_Msk

#endif

/** @} */ /* End of group MDR32VF0xI_ADCUI_CTRL2 */

/** @defgroup MDR32VF0xI_ADCUI_CTRL3 ADCUI CTRL3
 * @{
 */

#define ADCUI_CTRL3_ZXTOUT_Pos 0
#define ADCUI_CTRL3_ZXTOUT_Msk (0xFFFUL << ADCUI_CTRL3_ZXTOUT_Pos)

/** @} */ /* End of group MDR32VF0xI_ADCUI_CTRL3 */

/** @defgroup MDR32VF0xI_ADCUI_F0CTR ADCUI F0CTR for Channel 0
 * @{
 */

#define ADCUI_F0CTR_F0I0NTEN_Pos 0
#define ADCUI_F0CTR_F0I0NTEN_Msk (0x1UL << ADCUI_F0CTR_F0I0NTEN_Pos)
#define ADCUI_F0CTR_F0I0NTEN     ADCUI_F0CTR_F0I0NTEN_Msk

#define ADCUI_F0CTR_F0I3NTEN_Pos 1
#define ADCUI_F0CTR_F0I3NTEN_Msk (0x1UL << ADCUI_F0CTR_F0I3NTEN_Pos)
#define ADCUI_F0CTR_F0I3NTEN     ADCUI_F0CTR_F0I3NTEN_Msk

#define ADCUI_F0CTR_F0VASEL_Pos  2
#define ADCUI_F0CTR_F0VASEL_Msk  (0x1UL << ADCUI_F0CTR_F0VASEL_Pos)
#define ADCUI_F0CTR_F0VASEL      ADCUI_F0CTR_F0VASEL_Msk

#define ADCUI_F0CTR_F0RARS_Pos   3
#define ADCUI_F0CTR_F0RARS_Msk   (0x1UL << ADCUI_F0CTR_F0RARS_Pos)
#define ADCUI_F0CTR_F0RARS       ADCUI_F0CTR_F0RARS_Msk

#define ADCUI_F0CTR_F0RRRS_Pos   4
#define ADCUI_F0CTR_F0RRRS_Msk   (0x1UL << ADCUI_F0CTR_F0RRRS_Pos)
#define ADCUI_F0CTR_F0RRRS       ADCUI_F0CTR_F0RRRS_Msk

#define ADCUI_F0CTR_F0RVRS_Pos   5
#define ADCUI_F0CTR_F0RVRS_Msk   (0x1UL << ADCUI_F0CTR_F0RVRS_Pos)
#define ADCUI_F0CTR_F0RVRS       ADCUI_F0CTR_F0RVRS_Msk

#if defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)
#define ADCUI_F0CTR_F0I0GAIN_Pos  6
#define ADCUI_F0CTR_F0I0GAIN_Msk  (0x3UL << ADCUI_F0CTR_F0I0GAIN_Pos)
#define ADCUI_F0CTR_F0I0GAIN_6dB  (0x0UL << ADCUI_F0CTR_F0I0GAIN_Pos)
#define ADCUI_F0CTR_F0I0GAIN_12dB (0x1UL << ADCUI_F0CTR_F0I0GAIN_Pos)
#define ADCUI_F0CTR_F0I0GAIN_18dB (0x2UL << ADCUI_F0CTR_F0I0GAIN_Pos)
#define ADCUI_F0CTR_F0I0GAIN_24dB (0x3UL << ADCUI_F0CTR_F0I0GAIN_Pos)

#define ADCUI_F0CTR_F0VGAIN_Pos   8
#define ADCUI_F0CTR_F0VGAIN_Msk   (0x3UL << ADCUI_F0CTR_F0VGAIN_Pos)
#define ADCUI_F0CTR_F0VGAIN_0dB   (0x0UL << ADCUI_F0CTR_F0VGAIN_Pos)
#define ADCUI_F0CTR_F0VGAIN_6dB   (0x1UL << ADCUI_F0CTR_F0VGAIN_Pos)
#define ADCUI_F0CTR_F0VGAIN_12dB  (0x2UL << ADCUI_F0CTR_F0VGAIN_Pos)
#define ADCUI_F0CTR_F0VGAIN_18dB  (0x3UL << ADCUI_F0CTR_F0VGAIN_Pos)
#endif

#if defined(USE_MDR32F02_REV_1X) || defined(USE_MDR32F02_REV_2)
#define ADCUI_F0CTR_F0VGAIN_Pos   6
#define ADCUI_F0CTR_F0VGAIN_Msk   (0x3UL << ADCUI_F0CTR_F0VGAIN_Pos)
#define ADCUI_F0CTR_F0VGAIN_0dB   (0x0UL << ADCUI_F0CTR_F0VGAIN_Pos)
#define ADCUI_F0CTR_F0VGAIN_6dB   (0x1UL << ADCUI_F0CTR_F0VGAIN_Pos)
#define ADCUI_F0CTR_F0VGAIN_12dB  (0x2UL << ADCUI_F0CTR_F0VGAIN_Pos)
#define ADCUI_F0CTR_F0VGAIN_18dB  (0x3UL << ADCUI_F0CTR_F0VGAIN_Pos)

#define ADCUI_F0CTR_F0I0GAIN_Pos  8
#define ADCUI_F0CTR_F0I0GAIN_Msk  (0x3UL << ADCUI_F0CTR_F0I0GAIN_Pos)
#define ADCUI_F0CTR_F0I0GAIN_0dB  (0x0UL << ADCUI_F0CTR_F0I0GAIN_Pos)
#define ADCUI_F0CTR_F0I0GAIN_6dB  (0x1UL << ADCUI_F0CTR_F0I0GAIN_Pos)
#define ADCUI_F0CTR_F0I0GAIN_12dB (0x2UL << ADCUI_F0CTR_F0I0GAIN_Pos)
#define ADCUI_F0CTR_F0I0GAIN_18dB (0x3UL << ADCUI_F0CTR_F0I0GAIN_Pos)
#endif

#define ADCUI_F0CTR_F0VPHASE_Pos 10
#define ADCUI_F0CTR_F0VPHASE_Msk (0xFFUL << ADCUI_F0CTR_F0VPHASE_Pos)

