piborisovich/microcontrollers/Milandr/Libraries/CMSIS/MDR32VF0xI/DeviceSupport/inc/MDR32VF0xI.h
#define ADCUI_FxMASK_FxPEAKVFM_Pos   7
#define ADCUI_FxMASK_FxPEAKVFM_Msk   (0x1UL << ADCUI_FxMASK_FxPEAKVFM_Pos)
#define ADCUI_FxMASK_FxPEAKVFM       ADCUI_FxMASK_FxPEAKVFM_Msk

#define ADCUI_FxMASK_FxPEAKIFM_Pos   8
#define ADCUI_FxMASK_FxPEAKIFM_Msk   (0x1UL << ADCUI_FxMASK_FxPEAKIFM_Pos)
#define ADCUI_FxMASK_FxPEAKIFM       ADCUI_FxMASK_FxPEAKIFM_Msk

#define ADCUI_FxMASK_FxWATTOVPM_Pos  9
#define ADCUI_FxMASK_FxWATTOVPM_Msk  (0x1UL << ADCUI_FxMASK_FxWATTOVPM_Pos)
#define ADCUI_FxMASK_FxWATTOVPM      ADCUI_FxMASK_FxWATTOVPM_Msk

#define ADCUI_FxMASK_FxVAROVPM_Pos   10
#define ADCUI_FxMASK_FxVAROVPM_Msk   (0x1UL << ADCUI_FxMASK_FxVAROVPM_Pos)
#define ADCUI_FxMASK_FxVAROVPM       ADCUI_FxMASK_FxVAROVPM_Msk

#define ADCUI_FxMASK_FxVAOVM_Pos     11
#define ADCUI_FxMASK_FxVAOVM_Msk     (0x1UL << ADCUI_FxMASK_FxVAOVM_Pos)
#define ADCUI_FxMASK_FxVAOVM         ADCUI_FxMASK_FxVAOVM_Msk

#define ADCUI_FxMASK_FxZXTOFM_Pos    12
#define ADCUI_FxMASK_FxZXTOFM_Msk    (0x1UL << ADCUI_FxMASK_FxZXTOFM_Pos)
#define ADCUI_FxMASK_FxZXTOFM        ADCUI_FxMASK_FxZXTOFM_Msk

#define ADCUI_FxMASK_FxAPSIGNM_Pos   15
#define ADCUI_FxMASK_FxAPSIGNM_Msk   (0x1UL << ADCUI_FxMASK_FxAPSIGNM_Pos)
#define ADCUI_FxMASK_FxAPSIGNM       ADCUI_FxMASK_FxAPSIGNM_Msk

#define ADCUI_FxMASK_FxAPNLDFLM_Pos  16
#define ADCUI_FxMASK_FxAPNLDFLM_Msk  (0x1UL << ADCUI_FxMASK_FxAPNLDFLM_Pos)
#define ADCUI_FxMASK_FxAPNLDFLM      ADCUI_FxMASK_FxAPNLDFLM_Msk

#define ADCUI_FxMASK_FxVARSIGNM_Pos  17
#define ADCUI_FxMASK_FxVARSIGNM_Msk  (0x1UL << ADCUI_FxMASK_FxVARSIGNM_Pos)
#define ADCUI_FxMASK_FxVARSIGNM      ADCUI_FxMASK_FxVARSIGNM_Msk

#define ADCUI_FxMASK_FxVARNLDFLM_Pos 18
#define ADCUI_FxMASK_FxVARNLDFLM_Msk (0x1UL << ADCUI_FxMASK_FxVARNLDFLM_Pos)
#define ADCUI_FxMASK_FxVARNLDFLM     ADCUI_FxMASK_FxVARNLDFLM_Msk

#define ADCUI_FxMASK_FxVANLDFLM_Pos  20
#define ADCUI_FxMASK_FxVANLDFLM_Msk  (0x1UL << ADCUI_FxMASK_FxVANLDFLM_Pos)
#define ADCUI_FxMASK_FxVANLDFLM      ADCUI_FxMASK_FxVANLDFLM_Msk

#define ADCUI_FxMASK_FxZEROCRSM_Pos  21
#define ADCUI_FxMASK_FxZEROCRSM_Msk  (0x1UL << ADCUI_FxMASK_FxZEROCRSM_Pos)
#define ADCUI_FxMASK_FxZEROCRSM      ADCUI_FxMASK_FxZEROCRSM_Msk

#define ADCUI_FxMASK_FxWATTOVNM_Pos  25
#define ADCUI_FxMASK_FxWATTOVNM_Msk  (0x1UL << ADCUI_FxMASK_FxWATTOVNM_Pos)
#define ADCUI_FxMASK_FxWATTOVNM      ADCUI_FxMASK_FxWATTOVNM_Msk

#define ADCUI_FxMASK_FxVAROVNM_Pos   26
#define ADCUI_FxMASK_FxVAROVNM_Msk   (0x1UL << ADCUI_FxMASK_FxVAROVNM_Pos)
#define ADCUI_FxMASK_FxVAROVNM       ADCUI_FxMASK_FxVAROVNM_Msk

/** @} */ /* End of group MDR32VF0xI_ADCUI_FxMASK */

/** @defgroup MDR32VF0xI_ADCUI_CCALx ADCUI CCALx
 * @{
 */

#if defined(USE_MDR32F02_REV_1X)

#define ADCUI_CCALx_VxBGAIN_Pos 0
#define ADCUI_CCALx_VxBGAIN_Msk (0xFFFUL << ADCUI_CCALx_VxBGAIN_Pos)

#define ADCUI_CCALx_IxBGAIN_Pos 12
#define ADCUI_CCALx_IxBGAIN_Msk (0xFFFUL << ADCUI_CCALx_IxBGAIN_Pos)

#else

#define ADCUI_CCALx_VxBGAIN_Pos 0
#define ADCUI_CCALx_VxBGAIN_Msk (0xFFFFUL << ADCUI_CCALx_VxBGAIN_Pos)

#define ADCUI_CCALx_IxBGAIN_Pos 16
#define ADCUI_CCALx_IxBGAIN_Msk (0xFFFFUL << ADCUI_CCALx_IxBGAIN_Pos)

#endif

/** @} */ /* End of group MDR32VF0xI_ADCUI_CCALx */

/** @defgroup MDR32VF0xI_ADCUI_CCAL4 ADCUI CCAL4
 * @{
 */

#define ADCUI_CCAL4_I3BGAIN_Pos 0
#if defined(USE_MDR32F02_REV_1X)
#define ADCUI_CCAL4_I3BGAIN_Msk (0xFFFUL << ADCUI_CCAL4_I3BGAIN_Pos)
#else
#define ADCUI_CCAL4_I3BGAIN_Msk (0xFFFFUL << ADCUI_CCAL4_I3BGAIN_Pos)
#endif

/** @} */ /* End of group MDR32VF0xI_ADCUI_CCAL4 */

/** @defgroup MDR32VF0xI_ADCUI_F0IRMS_INACTIVE ADCUI F0IRMS_INACTIVE
 * @{
 */

#define ADCUI_F0IRMS_INACTIVE_F0IRMS_INACTIVE_Pos 0
#define ADCUI_F0IRMS_INACTIVE_F0IRMS_INACTIVE_Msk (0xFFFFFFUL << ADCUI_F0IRMS_INACTIVE_F0IRMS_INACTIVE_Pos)

/** @} */ /* End of group MDR32VF0xI_ADCUI_F0IRMS_INACTIVE */

/** @defgroup MDR32VF0xI_ADCUI_FxWATTP_L ADCUI FxWATTP_L
 * @{
 */

#define ADCUI_FxWATTP_L_FxWATTHRP_L_Pos 0
#define ADCUI_FxWATTP_L_FxWATTHRP_L_Msk (0x1FFFFFFUL << ADCUI_FxWATTP_L_FxWATTHRP_L_Pos)

/** @} */ /* End of group MDR32VF0xI_ADCUI_FxWATTP_L */

/** @defgroup MDR32VF0xI_ADCUI_FxWATTN_L ADCUI FxWATTN_L
 * @{
 */

#define ADCUI_FxWATTN_L_FxWATTHRN_L_Pos 0
#define ADCUI_FxWATTN_L_FxWATTHRN_L_Msk (0x1FFFFFFUL << ADCUI_FxWATTN_L_FxWATTHRN_L_Pos)

/** @} */ /* End of group MDR32VF0xI_ADCUI_FxWATTN_L */

/** @defgroup MDR32VF0xI_ADCUI_FxVARP_L ADCUI FxVARP_L
 * @{
 */

#define ADCUI_FxVARP_L_FxVARHRP_L_Pos 0
#define ADCUI_FxVARP_L_FxVARHRP_L_Msk (0x1FFFFFFUL << ADCUI_FxVARP_L_FxVARHRP_L_Pos)

/** @} */ /* End of group MDR32VF0xI_ADCUI_FxVARP_L */

/** @defgroup MDR32VF0xI_ADCUI_FxVARN_L ADCUI FxVARN_L
 * @{
 */

#define ADCUI_FxVARN_L_FxVARHRN_L_Pos 0
#define ADCUI_FxVARN_L_FxVARHRN_L_Msk (0x1FFFFFFUL << ADCUI_FxVARN_L_FxVARHRN_L_Pos)

/** @} */ /* End of group MDR32VF0xI_ADCUI_FxVARN_L */

/** @defgroup MDR32VF0xI_ADCUI_FxVR_L ADCUI FxVR_L
 * @{
 */

#define ADCUI_FxVR_L_FxVAHR_L_Pos 0
#define ADCUI_FxVR_L_FxVAHR_L_Msk (0x1FFFFFFUL << ADCUI_FxVR_L_FxVAHR_L_Pos)

/** @} */ /* End of group MDR32VF0xI_ADCUI_FxVR_L */

#if defined(USE_MDR32F02_REV_2) || defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)

/** @defgroup MDR32VF0xI_ADCUI_LOAD ADCUI LOAD
 * @{
 */

#define ADCUI_LOAD_APNOLOAD_Pos  0
#define ADCUI_LOAD_APNOLOAD_Msk  (0x3FUL << ADCUI_LOAD_APNOLOAD_Pos)

#define ADCUI_LOAD_VARNOLOAD_Pos 6
#define ADCUI_LOAD_VARNOLOAD_Msk (0x3FUL << ADCUI_LOAD_VARNOLOAD_Pos)

#define ADCUI_LOAD_VANOLOAD_Pos  12
#define ADCUI_LOAD_VANOLOAD_Msk  (0x3FUL << ADCUI_LOAD_VANOLOAD_Pos)

/** @} */ /* End of group MDR32VF0xI_ADCUI_LOAD */

/** @defgroup MDR32VF0xI_ADCUI_FxVRMS_TRUE ADCUI FxVRMS_TRUE
 * @{
 */

#define ADCUI_FxVRMS_TRUE_FxVRMS_TRUE_Pos 0
#define ADCUI_FxVRMS_TRUE_FxVRMS_TRUE_Msk (0x3FUL << ADCUI_FxVRMS_TRUE_FxVRMS_TRUE_Pos)

/** @} */ /* End of group MDR32VF0xI_ADCUI_FxVRMS_TRUE */

#endif

#if defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)

/** @defgroup MDR32VF0xI_ADCUI_MSC ADCUI MSC
 * @{
 */

#define ADCUI_MSC_DMA_EN_RQ_B_Pos  0
#define ADCUI_MSC_DMA_EN_RQ_B_Msk  (0x7FUL << ADCUI_MSC_DMA_EN_RQ_B_Pos)
#define ADCUI_MSC_DMA_EN_RQ_B1     (0x01UL << ADCUI_MSC_DMA_EN_RQ_B_Pos)
#define ADCUI_MSC_DMA_EN_RQ_B2     (0x02UL << ADCUI_MSC_DMA_EN_RQ_B_Pos)
#define ADCUI_MSC_DMA_EN_RQ_B3     (0x04UL << ADCUI_MSC_DMA_EN_RQ_B_Pos)
#define ADCUI_MSC_DMA_EN_RQ_B4     (0x08UL << ADCUI_MSC_DMA_EN_RQ_B_Pos)
#define ADCUI_MSC_DMA_EN_RQ_B5     (0x10UL << ADCUI_MSC_DMA_EN_RQ_B_Pos)
#define ADCUI_MSC_DMA_EN_RQ_B6     (0x20UL << ADCUI_MSC_DMA_EN_RQ_B_Pos)
#define ADCUI_MSC_DMA_EN_RQ_B7     (0x40UL << ADCUI_MSC_DMA_EN_RQ_B_Pos)

#define ADCUI_MSC_DMA_EN_RQ_S_Pos  7
#define ADCUI_MSC_DMA_EN_RQ_S_Msk  (0x7FUL << ADCUI_MSC_DMA_EN_RQ_S_Pos)
#define ADCUI_MSC_DMA_EN_RQ_S1     (0x01UL << ADCUI_MSC_DMA_EN_RQ_S_Pos)
#define ADCUI_MSC_DMA_EN_RQ_S2     (0x02UL << ADCUI_MSC_DMA_EN_RQ_S_Pos)
#define ADCUI_MSC_DMA_EN_RQ_S3     (0x04UL << ADCUI_MSC_DMA_EN_RQ_S_Pos)
#define ADCUI_MSC_DMA_EN_RQ_S4     (0x08UL << ADCUI_MSC_DMA_EN_RQ_S_Pos)
#define ADCUI_MSC_DMA_EN_RQ_S5     (0x10UL << ADCUI_MSC_DMA_EN_RQ_S_Pos)
#define ADCUI_MSC_DMA_EN_RQ_S6     (0x20UL << ADCUI_MSC_DMA_EN_RQ_S_Pos)
#define ADCUI_MSC_DMA_EN_RQ_S7     (0x40UL << ADCUI_MSC_DMA_EN_RQ_S_Pos)

#define ADCUI_MSC_F3IRMSOS_Pos     14
#define ADCUI_MSC_F3IRMSOS_Msk     (0xFFFUL << ADCUI_MSC_F3IRMSOS_Pos)

#define ADCUI_MSC_F0ISEL_HPF_Pos   26
#define ADCUI_MSC_F0ISEL_HPF_Msk   (0x1UL << ADCUI_MSC_F0ISEL_HPF_Pos)
#define ADCUI_MSC_F0ISEL_HPF       ADCUI_MSC_F0ISEL_HPF_Msk

#define ADCUI_MSC_F1ISEL_HPF_Pos   27
#define ADCUI_MSC_F1ISEL_HPF_Msk   (0x1UL << ADCUI_MSC_F1ISEL_HPF_Pos)
#define ADCUI_MSC_F1ISEL_HPF       ADCUI_MSC_F1ISEL_HPF_Msk

#define ADCUI_MSC_F2ISEL_HPF_Pos   28
#define ADCUI_MSC_F2ISEL_HPF_Msk   (0x1UL << ADCUI_MSC_F2ISEL_HPF_Pos)
#define ADCUI_MSC_F2ISEL_HPF       ADCUI_MSC_F2ISEL_HPF_Msk

#define ADCUI_MSC_F0VPHASE_LOW_Pos 29
#define ADCUI_MSC_F0VPHASE_LOW_Msk (0x3UL << ADCUI_MSC_F0VPHASE_LOW_Pos)

#define ADCUI_MSC_F90_CONF_Pos     31
#define ADCUI_MSC_F90_CONF_Msk     (0x1UL << ADCUI_MSC_F90_CONF_Pos)
#define ADCUI_MSC_F90_CONF         ADCUI_MSC_F90_CONF_Msk

/** @} */ /* End of group MDR32VF0xI_ADCUI_MSC */

/** @defgroup MDR32VF0xI_ADCUI_FILTERCFG ADCUI FILTERCFG
 * @{
 */

#define ADCUI_FILTERCFG_CHPF_COEFF_Pos  0
#define ADCUI_FILTERCFG_CHPF_COEFF_Msk  (0xFFFUL << ADCUI_FILTERCFG_CHPF_COEFF_Pos)

