piborisovich/microcontrollers/Milandr/Libraries/CMSIS/MDR32VF0xI/DeviceSupport/inc/MDR32VF0xI.h
#define ADCUI_FILTERCFG_CLRMS_COEFF_Pos 12
#define ADCUI_FILTERCFG_CLRMS_COEFF_Msk (0xFFFUL << ADCUI_FILTERCFG_CLRMS_COEFF_Pos)

#define ADCUI_FILTERCFG_CHP_ADC_CFG_Pos 24
#define ADCUI_FILTERCFG_CHP_ADC_CFG_Msk (0x3UL << ADCUI_FILTERCFG_CHP_ADC_CFG_Pos)

/** @} */ /* End of group MDR32VF0xI_ADCUI_FILTERCFG */

/** @defgroup MDR32VF0xI_ADCUI_CLKPHASE1 ADCUI CLKPHASE1
 * @{
 */

#define ADCUI_CLKPHASE1_I0PHASE_Pos     0
#define ADCUI_CLKPHASE1_I0PHASE_Msk     (0x3FFUL << ADCUI_CLKPHASE1_I0PHASE_Pos)

#define ADCUI_CLKPHASE1_I1PHASE_Pos     10
#define ADCUI_CLKPHASE1_I1PHASE_Msk     (0x3FFUL << ADCUI_CLKPHASE1_I1PHASE_Pos)

#define ADCUI_CLKPHASE1_I2PHASE_Pos     20
#define ADCUI_CLKPHASE1_I2PHASE_Msk     (0x3FFUL << ADCUI_CLKPHASE1_I2PHASE_Pos)

#define ADCUI_CLKPHASE1_CLC_ADC_CFG_Pos 30
#define ADCUI_CLKPHASE1_CLC_ADC_CFG_Msk (0x3UL << ADCUI_CLKPHASE1_CLC_ADC_CFG_Pos)

/** @} */ /* End of group MDR32VF0xI_ADCUI_CLKPHASE1 */

/** @defgroup MDR32VF0xI_ADCUI_CLKPHASE2 ADCUI CLKPHASE2
 * @{
 */

#define ADCUI_CLKPHASE2_I3PHASE_Pos 0
#define ADCUI_CLKPHASE2_I3PHASE_Msk (0x3FFUL << ADCUI_CLKPHASE2_I3PHASE_Pos)

/** @} */ /* End of group MDR32VF0xI_ADCUI_CLKPHASE2 */

#endif

/** @} */ /* End of group MDR32VF0xI_ADCUI_Defines */

/** @} */ /* End of group MDR32VF0xI_ADCUI */

/** @defgroup MDR32VF0xI_TIMER MDR_TIMER
 * @{
 */

/**
 * @brief MDR32VF0xI TIMER control structure.
 */
typedef struct {
    __IO uint32_t CNT;          /*!<TIMER Counter Register */
    __IO uint32_t PSG;          /*!<TIMER Clock Prescaler Register */
    __IO uint32_t ARR;          /*!<TIMER Auto-Reload Register */
    __IO uint32_t CNTRL;        /*!<TIMER Control Register */
    __IO uint32_t CH1_CCR;      /*!<TIMER Channel 1 Capture/Compare Register */
    __IO uint32_t CH2_CCR;      /*!<TIMER Channel 2 Capture/Compare Register */
    __IO uint32_t CH3_CCR;      /*!<TIMER Channel 3 Capture/Compare Register */
    __IO uint32_t CH4_CCR;      /*!<TIMER Channel 4 Capture/Compare Register */
    __IO uint32_t CH1_CNTRL0;   /*!<TIMER Channel 1 Control0 Register */
    __IO uint32_t CH2_CNTRL0;   /*!<TIMER Channel 2 Control0 Register */
    __IO uint32_t CH3_CNTRL0;   /*!<TIMER Channel 3 Control0 Register */
    __IO uint32_t CH4_CNTRL0;   /*!<TIMER Channel 4 Control0 Register */
    __IO uint32_t CH1_CNTRL1;   /*!<TIMER Channel 1 Control1 Register */
    __IO uint32_t CH2_CNTRL1;   /*!<TIMER Channel 2 Control1 Register */
    __IO uint32_t CH3_CNTRL1;   /*!<TIMER Channel 3 Control1 Register */
    __IO uint32_t CH4_CNTRL1;   /*!<TIMER Channel 4 Control1 Register */
    __IO uint32_t CH1_DTG;      /*!<TIMER Channel 1 DTG Register */
    __IO uint32_t CH2_DTG;      /*!<TIMER Channel 2 DTG Register */
    __IO uint32_t CH3_DTG;      /*!<TIMER Channel 3 DTG Register */
    __IO uint32_t CH4_DTG;      /*!<TIMER Channel 4 DTG Register */
    __IO uint32_t BRKETR_CNTRL; /*!<TIMER BRK/ETR Control Register */
    __IO uint32_t STATUS;       /*!<TIMER Status Register */
    __IO uint32_t IE;           /*!<TIMER Interrupt Enable Register */
    __IO uint32_t DMA_RE;       /*!<TIMER DMA Request Enable Register */
    __IO uint32_t CH1_CNTRL2;   /*!<TIMER Channel 1 Control2 Register */
    __IO uint32_t CH2_CNTRL2;   /*!<TIMER Channel 2 Control2 Register */
    __IO uint32_t CH3_CNTRL2;   /*!<TIMER Channel 3 Control2 Register */
    __IO uint32_t CH4_CNTRL2;   /*!<TIMER Channel 4 Control2 Register */
    __IO uint32_t CH1_CCR1;     /*!<TIMER Channel 1 Capture/Compare1 Register */
    __IO uint32_t CH2_CCR1;     /*!<TIMER Channel 2 Capture/Compare1 Register */
    __IO uint32_t CH3_CCR1;     /*!<TIMER Channel 3 Capture/Compare1 Register */
    __IO uint32_t CH4_CCR1;     /*!<TIMER Channel 4 Capture/Compare1 Register */
} MDR_TIMER_TypeDef;

/** @defgroup MDR32VF0xI_TIMER_Defines TIMER Defines
 * @{
 */

/** @defgroup MDR32VF0xI_TIMER_CNT TIMER CNT
 * @{
 */

#define TIMER_CNT_CNT_Pos 0
#define TIMER_CNT_CNT_Msk (0xFFFFFFFFUL << TIMER_CNT_CNT_Pos)

/** @} */ /* End of group MDR32VF0xI_TIMER_CNT */

/** @defgroup MDR32VF0xI_TIMER_PSG TIMER PSG
 * @{
 */

#define TIMER_PSG_PSG_Pos 0
#define TIMER_PSG_PSG_Msk (0xFFFFFFFFUL << TIMER_PSG_PSG_Pos)

/** @} */ /* End of group MDR32VF0xI_TIMER_PSG */

/** @defgroup MDR32VF0xI_TIMER_ARR TIMER ARR
 * @{
 */

#define TIMER_ARR_ARR_Pos 0
#define TIMER_ARR_ARR_Msk (0xFFFFFFFFUL << TIMER_ARR_ARR_Pos)

/** @} */ /* End of group MDR32VF0xI_TIMER_ARR */

/** @defgroup MDR32VF0xI_TIMER_CNTRL TIMER CNTRL
 * @{
 */

#define TIMER_CNTRL_CNT_EN_Pos              0
#define TIMER_CNTRL_CNT_EN_Msk              (0x1UL << TIMER_CNTRL_CNT_EN_Pos)
#define TIMER_CNTRL_CNT_EN                  TIMER_CNTRL_CNT_EN_Msk

#define TIMER_CNTRL_ARRB_EN_Pos             1
#define TIMER_CNTRL_ARRB_EN_Msk             (0x1UL << TIMER_CNTRL_ARRB_EN_Pos)
#define TIMER_CNTRL_ARRB_EN                 TIMER_CNTRL_ARRB_EN_Msk

#define TIMER_CNTRL_WR_CMPL_Pos             2
#define TIMER_CNTRL_WR_CMPL_Msk             (0x1UL << TIMER_CNTRL_WR_CMPL_Pos)
#define TIMER_CNTRL_WR_CMPL                 TIMER_CNTRL_WR_CMPL_Msk

#define TIMER_CNTRL_DIR_Pos                 3
#define TIMER_CNTRL_DIR_Msk                 (0x1UL << TIMER_CNTRL_DIR_Pos)
#define TIMER_CNTRL_DIR                     TIMER_CNTRL_DIR_Msk

#define TIMER_CNTRL_FDTS_Pos                4
#define TIMER_CNTRL_FDTS_Msk                (0x3UL << TIMER_CNTRL_FDTS_Pos)
#define TIMER_CNTRL_FDTS_DIV_1              (0x0UL << TIMER_CNTRL_FDTS_Pos)
#define TIMER_CNTRL_FDTS_DIV_2              (0x1UL << TIMER_CNTRL_FDTS_Pos)
#define TIMER_CNTRL_FDTS_DIV_3              (0x2UL << TIMER_CNTRL_FDTS_Pos)
#define TIMER_CNTRL_FDTS_DIV_4              (0x3UL << TIMER_CNTRL_FDTS_Pos)

#define TIMER_CNTRL_CNT_MODE_Pos            6
#define TIMER_CNTRL_CNT_MODE_Msk            (0x3UL << TIMER_CNTRL_CNT_MODE_Pos)
#define TIMER_CNTRL_CNT_MODE_CLK_FIXED_DIR  (0x0UL << TIMER_CNTRL_CNT_MODE_Pos)
#define TIMER_CNTRL_CNT_MODE_CLK_CHANGE_DIR (0x1UL << TIMER_CNTRL_CNT_MODE_Pos)
#define TIMER_CNTRL_CNT_MODE_EVNT_FIXED_DIR (0x2UL << TIMER_CNTRL_CNT_MODE_Pos)

#define TIMER_CNTRL_EVNT_SEL_Pos            8
#define TIMER_CNTRL_EVNT_SEL_Msk            (0xFUL << TIMER_CNTRL_EVNT_SEL_Pos)
#define TIMER_CNTRL_EVNT_SEL_TIM_CLK        (0x0UL << TIMER_CNTRL_EVNT_SEL_Pos)
#define TIMER_CNTRL_EVNT_SEL_TMR1           (0x1UL << TIMER_CNTRL_EVNT_SEL_Pos)
#define TIMER_CNTRL_EVNT_SEL_TMR2           (0x2UL << TIMER_CNTRL_EVNT_SEL_Pos)
#define TIMER_CNTRL_EVNT_SEL_TMR3           (0x3UL << TIMER_CNTRL_EVNT_SEL_Pos)
#define TIMER_CNTRL_EVNT_SEL_CH1_RE         (0x4UL << TIMER_CNTRL_EVNT_SEL_Pos)
#define TIMER_CNTRL_EVNT_SEL_CH2_RE         (0x5UL << TIMER_CNTRL_EVNT_SEL_Pos)
#define TIMER_CNTRL_EVNT_SEL_CH3_RE         (0x6UL << TIMER_CNTRL_EVNT_SEL_Pos)
#define TIMER_CNTRL_EVNT_SEL_CH4_RE         (0x7UL << TIMER_CNTRL_EVNT_SEL_Pos)
#define TIMER_CNTRL_EVNT_SEL_ETR_RE         (0x8UL << TIMER_CNTRL_EVNT_SEL_Pos)
#define TIMER_CNTRL_EVNT_SEL_ETR_FE         (0x9UL << TIMER_CNTRL_EVNT_SEL_Pos)
#define TIMER_CNTRL_EVNT_SEL_TMR4           (0xAUL << TIMER_CNTRL_EVNT_SEL_Pos)

