piborisovich/microcontrollers/Milandr/Libraries/CMSIS/MDR32VF0xI/DeviceSupport/inc/MDR32VF0xI.h
/** @} */ /* End of group MDR32VF0xI_TIMER_CNTRL */

/** @defgroup MDR32VF0xI_TIMER_CH_CCR TIMER CH_CCR
 * @{
 */

#define TIMER_CH_CCR_CCR_Pos 0
#define TIMER_CH_CCR_CCR_Msk (0xFFFFFFFFUL << TIMER_CH_CCR_CCR_Pos)

/** @} */ /* End of group MDR32VF0xI_TIMER_CH_CCR */

/** @defgroup MDR32VF0xI_TIMER_CH_CNTRL0 TIMER CH_CNTRL0
 * @{
 */

#define TIMER_CH_CNTRL0_CH_FLTR_Pos           0
#define TIMER_CH_CNTRL0_CH_FLTR_Msk           (0xFUL << TIMER_CH_CNTRL0_CH_FLTR_Pos)
#define TIMER_CH_CNTRL0_CH_FLTR_1_FDTS        (0x0UL << TIMER_CH_CNTRL0_CH_FLTR_Pos)
#define TIMER_CH_CNTRL0_CH_FLTR_2_TIM_CLK     (0x1UL << TIMER_CH_CNTRL0_CH_FLTR_Pos)
#define TIMER_CH_CNTRL0_CH_FLTR_4_TIM_CLK     (0x2UL << TIMER_CH_CNTRL0_CH_FLTR_Pos)
#define TIMER_CH_CNTRL0_CH_FLTR_8_TIM_CLK     (0x3UL << TIMER_CH_CNTRL0_CH_FLTR_Pos)
#define TIMER_CH_CNTRL0_CH_FLTR_6_FDTS_DIV_2  (0x4UL << TIMER_CH_CNTRL0_CH_FLTR_Pos)
#define TIMER_CH_CNTRL0_CH_FLTR_8_FDTS_DIV_2  (0x5UL << TIMER_CH_CNTRL0_CH_FLTR_Pos)
#define TIMER_CH_CNTRL0_CH_FLTR_6_FDTS_DIV_4  (0x6UL << TIMER_CH_CNTRL0_CH_FLTR_Pos)
#define TIMER_CH_CNTRL0_CH_FLTR_8_FDTS_DIV_4  (0x7UL << TIMER_CH_CNTRL0_CH_FLTR_Pos)
#define TIMER_CH_CNTRL0_CH_FLTR_6_FDTS_DIV_8  (0x8UL << TIMER_CH_CNTRL0_CH_FLTR_Pos)
#define TIMER_CH_CNTRL0_CH_FLTR_8_FDTS_DIV_8  (0x9UL << TIMER_CH_CNTRL0_CH_FLTR_Pos)
#define TIMER_CH_CNTRL0_CH_FLTR_5_FDTS_DIV_16 (0xAUL << TIMER_CH_CNTRL0_CH_FLTR_Pos)
#define TIMER_CH_CNTRL0_CH_FLTR_6_FDTS_DIV_16 (0xBUL << TIMER_CH_CNTRL0_CH_FLTR_Pos)
#define TIMER_CH_CNTRL0_CH_FLTR_8_FDTS_DIV_16 (0xCUL << TIMER_CH_CNTRL0_CH_FLTR_Pos)
#define TIMER_CH_CNTRL0_CH_FLTR_5_FDTS_DIV_32 (0xDUL << TIMER_CH_CNTRL0_CH_FLTR_Pos)
#define TIMER_CH_CNTRL0_CH_FLTR_6_FDTS_DIV_32 (0xEUL << TIMER_CH_CNTRL0_CH_FLTR_Pos)
#define TIMER_CH_CNTRL0_CH_FLTR_8_FDTS_DIV_32 (0xFUL << TIMER_CH_CNTRL0_CH_FLTR_Pos)

#define TIMER_CH_CNTRL0_CH_SEL_Pos            4
#define TIMER_CH_CNTRL0_CH_SEL_Msk            (0x3UL << TIMER_CH_CNTRL0_CH_SEL_Pos)
#define TIMER_CH_CNTRL0_CH_SEL_CH_RE          (0x0UL << TIMER_CH_CNTRL0_CH_SEL_Pos)
#define TIMER_CH_CNTRL0_CH_SEL_CH_FE          (0x1UL << TIMER_CH_CNTRL0_CH_SEL_Pos)
#define TIMER_CH_CNTRL0_CH_SEL_CHp1_RE        (0x2UL << TIMER_CH_CNTRL0_CH_SEL_Pos)
#define TIMER_CH_CNTRL0_CH_SEL_CHp2_RE        (0x3UL << TIMER_CH_CNTRL0_CH_SEL_Pos)

#define TIMER_CH_CNTRL0_CH_PSC_Pos            6
#define TIMER_CH_CNTRL0_CH_PSC_Msk            (0x3UL << TIMER_CH_CNTRL0_CH_PSC_Pos)
#define TIMER_CH_CNTRL0_CH_PSC_DIV_1          (0x0UL << TIMER_CH_CNTRL0_CH_PSC_Pos)
#define TIMER_CH_CNTRL0_CH_PSC_DIV_2          (0x1UL << TIMER_CH_CNTRL0_CH_PSC_Pos)
#define TIMER_CH_CNTRL0_CH_PSC_DIV_4          (0x2UL << TIMER_CH_CNTRL0_CH_PSC_Pos)
#define TIMER_CH_CNTRL0_CH_PSC_DIV_8          (0x3UL << TIMER_CH_CNTRL0_CH_PSC_Pos)

#define TIMER_CH_CNTRL0_OCCE_Pos              8
#define TIMER_CH_CNTRL0_OCCE_Msk              (0x1UL << TIMER_CH_CNTRL0_OCCE_Pos)
#define TIMER_CH_CNTRL0_OCCE                  TIMER_CH_CNTRL0_OCCE_Msk

#define TIMER_CH_CNTRL0_OCCM_Pos              9
#define TIMER_CH_CNTRL0_OCCM_Msk              (0x7UL << TIMER_CH_CNTRL0_OCCM_Pos)
#define TIMER_CH_CNTRL0_OCCM_FORMAT_0         (0x0UL << TIMER_CH_CNTRL0_OCCM_Pos)
#define TIMER_CH_CNTRL0_OCCM_FORMAT_1         (0x1UL << TIMER_CH_CNTRL0_OCCM_Pos)
#define TIMER_CH_CNTRL0_OCCM_FORMAT_2         (0x2UL << TIMER_CH_CNTRL0_OCCM_Pos)
#define TIMER_CH_CNTRL0_OCCM_FORMAT_3         (0x3UL << TIMER_CH_CNTRL0_OCCM_Pos)
#define TIMER_CH_CNTRL0_OCCM_FORMAT_4         (0x4UL << TIMER_CH_CNTRL0_OCCM_Pos)
#define TIMER_CH_CNTRL0_OCCM_FORMAT_5         (0x5UL << TIMER_CH_CNTRL0_OCCM_Pos)
#define TIMER_CH_CNTRL0_OCCM_FORMAT_6         (0x6UL << TIMER_CH_CNTRL0_OCCM_Pos)
#define TIMER_CH_CNTRL0_OCCM_FORMAT_7         (0x7UL << TIMER_CH_CNTRL0_OCCM_Pos)

#define TIMER_CH_CNTRL0_BRK_EN_Pos            12
#define TIMER_CH_CNTRL0_BRK_EN_Msk            (0x1UL << TIMER_CH_CNTRL0_BRK_EN_Pos)
#define TIMER_CH_CNTRL0_BRK_EN                TIMER_CH_CNTRL0_BRK_EN_Msk

#define TIMER_CH_CNTRL0_ETR_EN_Pos            13
#define TIMER_CH_CNTRL0_ETR_EN_Msk            (0x1UL << TIMER_CH_CNTRL0_ETR_EN_Pos)
#define TIMER_CH_CNTRL0_ETR_EN                TIMER_CH_CNTRL0_ETR_EN_Msk

#define TIMER_CH_CNTRL0_WR_CMPL_Pos           14
#define TIMER_CH_CNTRL0_WR_CMPL_Msk           (0x1UL << TIMER_CH_CNTRL0_WR_CMPL_Pos)
#define TIMER_CH_CNTRL0_WR_CMPL               TIMER_CH_CNTRL0_WR_CMPL_Msk

#define TIMER_CH_CNTRL0_CAP_NPWM_Pos          15
#define TIMER_CH_CNTRL0_CAP_NPWM_Msk          (0x1UL << TIMER_CH_CNTRL0_CAP_NPWM_Pos)
#define TIMER_CH_CNTRL0_CAP_NPWM              TIMER_CH_CNTRL0_CAP_NPWM_Msk

#define TIMER_CH_CNTRL0_WR_CMPL1_Pos          16
#define TIMER_CH_CNTRL0_WR_CMPL1_Msk          (0x1UL << TIMER_CH_CNTRL0_WR_CMPL1_Pos)
#define TIMER_CH_CNTRL0_WR_CMPL1              TIMER_CH_CNTRL0_WR_CMPL1_Msk

/** @} */ /* End of group MDR32VF0xI_TIMER_CH_CNTRL0 */

/** @defgroup MDR32VF0xI_TIMER_CH_CNTRL1 TIMER CH_CNTRL1
 * @{
 */

#define TIMER_CH_CNTRL1_SELOE_Pos   0
#define TIMER_CH_CNTRL1_SELOE_Msk   (0x3UL << TIMER_CH_CNTRL1_SELOE_Pos)
#define TIMER_CH_CNTRL1_SELOE_ALW0  (0x0UL << TIMER_CH_CNTRL1_SELOE_Pos)
#define TIMER_CH_CNTRL1_SELOE_ALW1  (0x1UL << TIMER_CH_CNTRL1_SELOE_Pos)
#define TIMER_CH_CNTRL1_SELOE_REF   (0x2UL << TIMER_CH_CNTRL1_SELOE_Pos)
#define TIMER_CH_CNTRL1_SELOE_DTG   (0x3UL << TIMER_CH_CNTRL1_SELOE_Pos)

#define TIMER_CH_CNTRL1_SELO_Pos    2
#define TIMER_CH_CNTRL1_SELO_Msk    (0x3UL << TIMER_CH_CNTRL1_SELO_Pos)
#define TIMER_CH_CNTRL1_SELO_ALW0   (0x0UL << TIMER_CH_CNTRL1_SELO_Pos)
#define TIMER_CH_CNTRL1_SELO_ALW1   (0x1UL << TIMER_CH_CNTRL1_SELO_Pos)
#define TIMER_CH_CNTRL1_SELO_REF    (0x2UL << TIMER_CH_CNTRL1_SELO_Pos)
#define TIMER_CH_CNTRL1_SELO_DTG    (0x3UL << TIMER_CH_CNTRL1_SELO_Pos)

#define TIMER_CH_CNTRL1_INV_Pos     4
#define TIMER_CH_CNTRL1_INV_Msk     (0x1UL << TIMER_CH_CNTRL1_INV_Pos)
#define TIMER_CH_CNTRL1_INV         TIMER_CH_CNTRL1_INV_Msk

#define TIMER_CH_CNTRL1_NSELOE_Pos  8
#define TIMER_CH_CNTRL1_NSELOE_Msk  (0x3UL << TIMER_CH_CNTRL1_NSELOE_Pos)
#define TIMER_CH_CNTRL1_NSELOE_ALW0 (0x0UL << TIMER_CH_CNTRL1_NSELOE_Pos)
#define TIMER_CH_CNTRL1_NSELOE_ALW1 (0x1UL << TIMER_CH_CNTRL1_NSELOE_Pos)
#define TIMER_CH_CNTRL1_NSELOE_REF  (0x2UL << TIMER_CH_CNTRL1_NSELOE_Pos)
#define TIMER_CH_CNTRL1_NSELOE_DTG  (0x3UL << TIMER_CH_CNTRL1_NSELOE_Pos)

#define TIMER_CH_CNTRL1_NSELO_Pos   10
#define TIMER_CH_CNTRL1_NSELO_Msk   (0x3UL << TIMER_CH_CNTRL1_NSELO_Pos)
#define TIMER_CH_CNTRL1_NSELO_ALW0  (0x0UL << TIMER_CH_CNTRL1_NSELO_Pos)
#define TIMER_CH_CNTRL1_NSELO_ALW1  (0x1UL << TIMER_CH_CNTRL1_NSELO_Pos)
#define TIMER_CH_CNTRL1_NSELO_REF   (0x2UL << TIMER_CH_CNTRL1_NSELO_Pos)
#define TIMER_CH_CNTRL1_NSELO_DTG   (0x3UL << TIMER_CH_CNTRL1_NSELO_Pos)

