piborisovich/microcontrollers/Milandr/Libraries/CMSIS/MDR32VF0xI/DeviceSupport/inc/MDR32VF0xI.h
#define TIMER_CH_CNTRL1_NINV_Pos    12
#define TIMER_CH_CNTRL1_NINV_Msk    (0x1UL << TIMER_CH_CNTRL1_NINV_Pos)
#define TIMER_CH_CNTRL1_NINV        TIMER_CH_CNTRL1_NINV_Msk

/** @} */ /* End of group MDR32VF0xI_TIMER_CH_CNTRL1 */

/** @defgroup MDR32VF0xI_TIMER_CH_DTG TIMER CH_DTG
 * @{
 */

#define TIMER_CH_DTG_DTGX_Pos 0
#define TIMER_CH_DTG_DTGX_Msk (0xFUL << TIMER_CH_DTG_DTGX_Pos)

#define TIMER_CH_DTG_EDTS_Pos 4
#define TIMER_CH_DTG_EDTS_Msk (0x1UL << TIMER_CH_DTG_EDTS_Pos)
#define TIMER_CH_DTG_EDTS     TIMER_CH_DTG_EDTS_Msk

#define TIMER_CH_DTG_DTG_Pos  8
#define TIMER_CH_DTG_DTG_Msk  (0xFFUL << TIMER_CH_DTG_DTG_Pos)

/** @} */ /* End of group MDR32VF0xI_TIMER_CH_DTG */

/** @defgroup MDR32VF0xI_TIMER_BRKETR_CNTRL TIMER BRKETR_CNTRL
 * @{
 */

#define TIMER_BRKETR_CNTRL_BRK_INV_Pos            0
#define TIMER_BRKETR_CNTRL_BRK_INV_Msk            (0x1UL << TIMER_BRKETR_CNTRL_BRK_INV_Pos)
#define TIMER_BRKETR_CNTRL_BRK_INV                TIMER_BRKETR_CNTRL_BRK_INV_Msk

#define TIMER_BRKETR_CNTRL_ETR_INV_Pos            1
#define TIMER_BRKETR_CNTRL_ETR_INV_Msk            (0x1UL << TIMER_BRKETR_CNTRL_ETR_INV_Pos)
#define TIMER_BRKETR_CNTRL_ETR_INV                TIMER_BRKETR_CNTRL_ETR_INV_Msk

#define TIMER_BRKETR_CNTRL_ETR_PSC_Pos            2
#define TIMER_BRKETR_CNTRL_ETR_PSC_Msk            (0x3UL << TIMER_BRKETR_CNTRL_ETR_PSC_Pos)
#define TIMER_BRKETR_CNTRL_ETR_PSC_DIV_1          (0x0UL << TIMER_BRKETR_CNTRL_ETR_PSC_Pos)
#define TIMER_BRKETR_CNTRL_ETR_PSC_DIV_2          (0x1UL << TIMER_BRKETR_CNTRL_ETR_PSC_Pos)
#define TIMER_BRKETR_CNTRL_ETR_PSC_DIV_4          (0x2UL << TIMER_BRKETR_CNTRL_ETR_PSC_Pos)
#define TIMER_BRKETR_CNTRL_ETR_PSC_DIV_8          (0x3UL << TIMER_BRKETR_CNTRL_ETR_PSC_Pos)

#define TIMER_BRKETR_CNTRL_ETR_FLTR_Pos           4
#define TIMER_BRKETR_CNTRL_ETR_FLTR_Msk           (0xFUL << TIMER_BRKETR_CNTRL_ETR_FLTR_Pos)
#define TIMER_BRKETR_CNTRL_ETR_FLTR_1_FDTS        (0x0UL << TIMER_BRKETR_CNTRL_ETR_FLTR_Pos)
#define TIMER_BRKETR_CNTRL_ETR_FLTR_2_TIM_CLK     (0x1UL << TIMER_BRKETR_CNTRL_ETR_FLTR_Pos)
#define TIMER_BRKETR_CNTRL_ETR_FLTR_4_TIM_CLK     (0x2UL << TIMER_BRKETR_CNTRL_ETR_FLTR_Pos)
#define TIMER_BRKETR_CNTRL_ETR_FLTR_8_TIM_CLK     (0x3UL << TIMER_BRKETR_CNTRL_ETR_FLTR_Pos)
#define TIMER_BRKETR_CNTRL_ETR_FLTR_6_FDTS_DIV_2  (0x4UL << TIMER_BRKETR_CNTRL_ETR_FLTR_Pos)
#define TIMER_BRKETR_CNTRL_ETR_FLTR_8_FDTS_DIV_2  (0x5UL << TIMER_BRKETR_CNTRL_ETR_FLTR_Pos)
#define TIMER_BRKETR_CNTRL_ETR_FLTR_6_FDTS_DIV_4  (0x6UL << TIMER_BRKETR_CNTRL_ETR_FLTR_Pos)
#define TIMER_BRKETR_CNTRL_ETR_FLTR_8_FDTS_DIV_4  (0x7UL << TIMER_BRKETR_CNTRL_ETR_FLTR_Pos)
#define TIMER_BRKETR_CNTRL_ETR_FLTR_6_FDTS_DIV_8  (0x8UL << TIMER_BRKETR_CNTRL_ETR_FLTR_Pos)
#define TIMER_BRKETR_CNTRL_ETR_FLTR_8_FDTS_DIV_8  (0x9UL << TIMER_BRKETR_CNTRL_ETR_FLTR_Pos)
#define TIMER_BRKETR_CNTRL_ETR_FLTR_5_FDTS_DIV_16 (0xAUL << TIMER_BRKETR_CNTRL_ETR_FLTR_Pos)
#define TIMER_BRKETR_CNTRL_ETR_FLTR_6_FDTS_DIV_16 (0xBUL << TIMER_BRKETR_CNTRL_ETR_FLTR_Pos)
#define TIMER_BRKETR_CNTRL_ETR_FLTR_8_FDTS_DIV_16 (0xCUL << TIMER_BRKETR_CNTRL_ETR_FLTR_Pos)
#define TIMER_BRKETR_CNTRL_ETR_FLTR_5_FDTS_DIV_32 (0xDUL << TIMER_BRKETR_CNTRL_ETR_FLTR_Pos)
#define TIMER_BRKETR_CNTRL_ETR_FLTR_6_FDTS_DIV_32 (0xEUL << TIMER_BRKETR_CNTRL_ETR_FLTR_Pos)
#define TIMER_BRKETR_CNTRL_ETR_FLTR_8_FDTS_DIV_32 (0xFUL << TIMER_BRKETR_CNTRL_ETR_FLTR_Pos)

/** @} */ /* End of group MDR32VF0xI_TIMER_BRKETR_CNTRL */

/** @defgroup MDR32VF0xI_TIMER_STATUS TIMER STATUS
 * @{
 */

#define TIMER_STATUS_CNT_ZERO_EVNT_Pos     0
#define TIMER_STATUS_CNT_ZERO_EVNT_Msk     (0x1UL << TIMER_STATUS_CNT_ZERO_EVNT_Pos)
#define TIMER_STATUS_CNT_ZERO_EVNT         TIMER_STATUS_CNT_ZERO_EVNT_Msk

#define TIMER_STATUS_CNT_ARR_EVNT_Pos      1
#define TIMER_STATUS_CNT_ARR_EVNT_Msk      (0x1UL << TIMER_STATUS_CNT_ARR_EVNT_Pos)
#define TIMER_STATUS_CNT_ARR_EVNT          TIMER_STATUS_CNT_ARR_EVNT_Msk

#define TIMER_STATUS_ETR_RE_EVNT_Pos       2
#define TIMER_STATUS_ETR_RE_EVNT_Msk       (0x1UL << TIMER_STATUS_ETR_RE_EVNT_Pos)
#define TIMER_STATUS_ETR_RE_EVNT           TIMER_STATUS_ETR_RE_EVNT_Msk

#define TIMER_STATUS_ETR_FE_EVNT_Pos       3
#define TIMER_STATUS_ETR_FE_EVNT_Msk       (0x1UL << TIMER_STATUS_ETR_FE_EVNT_Pos)
#define TIMER_STATUS_ETR_FE_EVNT           TIMER_STATUS_ETR_FE_EVNT_Msk

#define TIMER_STATUS_BRK_EVNT_Pos          4
#define TIMER_STATUS_BRK_EVNT_Msk          (0x1UL << TIMER_STATUS_BRK_EVNT_Pos)
#define TIMER_STATUS_BRK_EVNT              TIMER_STATUS_BRK_EVNT_Msk

#define TIMER_STATUS_CCR_CAP_EVNT_CH1_Pos  5
#define TIMER_STATUS_CCR_CAP_EVNT_CH1_Msk  (0x1UL << TIMER_STATUS_CCR_CAP_EVNT_CH1_Pos)
#define TIMER_STATUS_CCR_CAP_EVNT_CH1      TIMER_STATUS_CCR_CAP_EVNT_CH1_Msk

#define TIMER_STATUS_CCR_CAP_EVNT_CH2_Pos  6
#define TIMER_STATUS_CCR_CAP_EVNT_CH2_Msk  (0x1UL << TIMER_STATUS_CCR_CAP_EVNT_CH2_Pos)
#define TIMER_STATUS_CCR_CAP_EVNT_CH2      TIMER_STATUS_CCR_CAP_EVNT_CH2_Msk

#define TIMER_STATUS_CCR_CAP_EVNT_CH3_Pos  7
#define TIMER_STATUS_CCR_CAP_EVNT_CH3_Msk  (0x1UL << TIMER_STATUS_CCR_CAP_EVNT_CH3_Pos)
#define TIMER_STATUS_CCR_CAP_EVNT_CH3      TIMER_STATUS_CCR_CAP_EVNT_CH3_Msk

#define TIMER_STATUS_CCR_CAP_EVNT_CH4_Pos  8
#define TIMER_STATUS_CCR_CAP_EVNT_CH4_Msk  (0x1UL << TIMER_STATUS_CCR_CAP_EVNT_CH4_Pos)
#define TIMER_STATUS_CCR_CAP_EVNT_CH4      TIMER_STATUS_CCR_CAP_EVNT_CH4_Msk

#define TIMER_STATUS_CCR_REF_EVNT_CH1_Pos  9
#define TIMER_STATUS_CCR_REF_EVNT_CH1_Msk  (0x1UL << TIMER_STATUS_CCR_REF_EVNT_CH1_Pos)
#define TIMER_STATUS_CCR_REF_EVNT_CH1      TIMER_STATUS_CCR_REF_EVNT_CH1_Msk

#define TIMER_STATUS_CCR_REF_EVNT_CH2_Pos  10
#define TIMER_STATUS_CCR_REF_EVNT_CH2_Msk  (0x1UL << TIMER_STATUS_CCR_REF_EVNT_CH2_Pos)
#define TIMER_STATUS_CCR_REF_EVNT_CH2      TIMER_STATUS_CCR_REF_EVNT_CH2_Msk

#define TIMER_STATUS_CCR_REF_EVNT_CH3_Pos  11
#define TIMER_STATUS_CCR_REF_EVNT_CH3_Msk  (0x1UL << TIMER_STATUS_CCR_REF_EVNT_CH3_Pos)
#define TIMER_STATUS_CCR_REF_EVNT_CH3      TIMER_STATUS_CCR_REF_EVNT_CH3_Msk

#define TIMER_STATUS_CCR_REF_EVNT_CH4_Pos  12
#define TIMER_STATUS_CCR_REF_EVNT_CH4_Msk  (0x1UL << TIMER_STATUS_CCR_REF_EVNT_CH4_Pos)
#define TIMER_STATUS_CCR_REF_EVNT_CH4      TIMER_STATUS_CCR_REF_EVNT_CH4_Msk

#define TIMER_STATUS_CCR_CAP1_EVNT_CH1_Pos 13
#define TIMER_STATUS_CCR_CAP1_EVNT_CH1_Msk (0x1UL << TIMER_STATUS_CCR_CAP1_EVNT_CH1_Pos)
#define TIMER_STATUS_CCR_CAP1_EVNT_CH1     TIMER_STATUS_CCR_CAP1_EVNT_CH1_Msk

#define TIMER_STATUS_CCR_CAP1_EVNT_CH2_Pos 14
#define TIMER_STATUS_CCR_CAP1_EVNT_CH2_Msk (0x1UL << TIMER_STATUS_CCR_CAP1_EVNT_CH2_Pos)
#define TIMER_STATUS_CCR_CAP1_EVNT_CH2     TIMER_STATUS_CCR_CAP1_EVNT_CH2_Msk

#define TIMER_STATUS_CCR_CAP1_EVNT_CH3_Pos 15
#define TIMER_STATUS_CCR_CAP1_EVNT_CH3_Msk (0x1UL << TIMER_STATUS_CCR_CAP1_EVNT_CH3_Pos)
#define TIMER_STATUS_CCR_CAP1_EVNT_CH3     TIMER_STATUS_CCR_CAP1_EVNT_CH3_Msk

