piborisovich/microcontrollers/Milandr/Libraries/CMSIS/MDR32VF0xI/DeviceSupport/inc/MDR32VF0xI.h
#define TIMER_STATUS_CCR_CAP1_EVNT_CH4_Pos 16
#define TIMER_STATUS_CCR_CAP1_EVNT_CH4_Msk (0x1UL << TIMER_STATUS_CCR_CAP1_EVNT_CH4_Pos)
#define TIMER_STATUS_CCR_CAP1_EVNT_CH4     TIMER_STATUS_CCR_CAP1_EVNT_CH4_Msk

/** @} */ /* End of group MDR32VF0xI_TIMER_STATUS */

/** @defgroup MDR32VF0xI_TIMER_IE TIMER IE
 * @{
 */

#define TIMER_IE_CNT_ZERO_EVNT_IE_Pos     0
#define TIMER_IE_CNT_ZERO_EVNT_IE_Msk     (0x1UL << TIMER_IE_CNT_ZERO_EVNT_IE_Pos)
#define TIMER_IE_CNT_ZERO_EVNT_IE         TIMER_IE_CNT_ZERO_EVNT_IE_Msk

#define TIMER_IE_CNT_ARR_EVNT_IE_Pos      1
#define TIMER_IE_CNT_ARR_EVNT_IE_Msk      (0x1UL << TIMER_IE_CNT_ARR_EVNT_IE_Pos)
#define TIMER_IE_CNT_ARR_EVNT_IE          TIMER_IE_CNT_ARR_EVNT_IE_Msk

#define TIMER_IE_ETR_RE_EVNT_IE_Pos       2
#define TIMER_IE_ETR_RE_EVNT_IE_Msk       (0x1UL << TIMER_IE_ETR_RE_EVNT_IE_Pos)
#define TIMER_IE_ETR_RE_EVNT_IE           TIMER_IE_ETR_RE_EVNT_IE_Msk

#define TIMER_IE_ETR_FE_EVNT_IE_Pos       3
#define TIMER_IE_ETR_FE_EVNT_IE_Msk       (0x1UL << TIMER_IE_ETR_FE_EVNT_IE_Pos)
#define TIMER_IE_ETR_FE_EVNT_IE           TIMER_IE_ETR_FE_EVNT_IE_Msk

#define TIMER_IE_BRK_EVNT_IE_Pos          4
#define TIMER_IE_BRK_EVNT_IE_Msk          (0x1UL << TIMER_IE_BRK_EVNT_IE_Pos)
#define TIMER_IE_BRK_EVNT_IE              TIMER_IE_BRK_EVNT_IE_Msk

#define TIMER_IE_CCR_CAP_EVNT_IE_CH1_Pos  5
#define TIMER_IE_CCR_CAP_EVNT_IE_CH1_Msk  (0x1UL << TIMER_IE_CCR_CAP_EVNT_IE_CH1_Pos)
#define TIMER_IE_CCR_CAP_EVNT_IE_CH1      TIMER_IE_CCR_CAP_EVNT_IE_CH1_Msk

#define TIMER_IE_CCR_CAP_EVNT_IE_CH2_Pos  6
#define TIMER_IE_CCR_CAP_EVNT_IE_CH2_Msk  (0x1UL << TIMER_IE_CCR_CAP_EVNT_IE_CH2_Pos)
#define TIMER_IE_CCR_CAP_EVNT_IE_CH2      TIMER_IE_CCR_CAP_EVNT_IE_CH2_Msk

#define TIMER_IE_CCR_CAP_EVNT_IE_CH3_Pos  7
#define TIMER_IE_CCR_CAP_EVNT_IE_CH3_Msk  (0x1UL << TIMER_IE_CCR_CAP_EVNT_IE_CH3_Pos)
#define TIMER_IE_CCR_CAP_EVNT_IE_CH3      TIMER_IE_CCR_CAP_EVNT_IE_CH3_Msk

#define TIMER_IE_CCR_CAP_EVNT_IE_CH4_Pos  8
#define TIMER_IE_CCR_CAP_EVNT_IE_CH4_Msk  (0x1UL << TIMER_IE_CCR_CAP_EVNT_IE_CH4_Pos)
#define TIMER_IE_CCR_CAP_EVNT_IE_CH4      TIMER_IE_CCR_CAP_EVNT_IE_CH4_Msk

#define TIMER_IE_CCR_REF_EVNT_IE_CH1_Pos  9
#define TIMER_IE_CCR_REF_EVNT_IE_CH1_Msk  (0x1UL << TIMER_IE_CCR_REF_EVNT_IE_CH1_Pos)
#define TIMER_IE_CCR_REF_EVNT_IE_CH1      TIMER_IE_CCR_REF_EVNT_IE_CH1_Msk

#define TIMER_IE_CCR_REF_EVNT_IE_CH2_Pos  10
#define TIMER_IE_CCR_REF_EVNT_IE_CH2_Msk  (0x1UL << TIMER_IE_CCR_REF_EVNT_IE_CH2_Pos)
#define TIMER_IE_CCR_REF_EVNT_IE_CH2      TIMER_IE_CCR_REF_EVNT_IE_CH2_Msk

#define TIMER_IE_CCR_REF_EVNT_IE_CH3_Pos  11
#define TIMER_IE_CCR_REF_EVNT_IE_CH3_Msk  (0x1UL << TIMER_IE_CCR_REF_EVNT_IE_CH3_Pos)
#define TIMER_IE_CCR_REF_EVNT_IE_CH3      TIMER_IE_CCR_REF_EVNT_IE_CH3_Msk

#define TIMER_IE_CCR_REF_EVNT_IE_CH4_Pos  12
#define TIMER_IE_CCR_REF_EVNT_IE_CH4_Msk  (0x1UL << TIMER_IE_CCR_REF_EVNT_IE_CH4_Pos)
#define TIMER_IE_CCR_REF_EVNT_IE_CH4      TIMER_IE_CCR_REF_EVNT_IE_CH4_Msk

#define TIMER_IE_CCR_CAP1_EVNT_IE_CH1_Pos 13
#define TIMER_IE_CCR_CAP1_EVNT_IE_CH1_Msk (0x1UL << TIMER_IE_CCR_CAP1_EVNT_IE_CH1_Pos)
#define TIMER_IE_CCR_CAP1_EVNT_IE_CH1     TIMER_IE_CCR_CAP1_EVNT_IE_CH1_Msk

#define TIMER_IE_CCR_CAP1_EVNT_IE_CH2_Pos 14
#define TIMER_IE_CCR_CAP1_EVNT_IE_CH2_Msk (0x1UL << TIMER_IE_CCR_CAP1_EVNT_IE_CH2_Pos)
#define TIMER_IE_CCR_CAP1_EVNT_IE_CH2     TIMER_IE_CCR_CAP1_EVNT_IE_CH2_Msk

#define TIMER_IE_CCR_CAP1_EVNT_IE_CH3_Pos 15
#define TIMER_IE_CCR_CAP1_EVNT_IE_CH3_Msk (0x1UL << TIMER_IE_CCR_CAP1_EVNT_IE_CH3_Pos)
#define TIMER_IE_CCR_CAP1_EVNT_IE_CH3     TIMER_IE_CCR_CAP1_EVNT_IE_CH3_Msk

#define TIMER_IE_CCR_CAP1_EVNT_IE_CH4_Pos 16
#define TIMER_IE_CCR_CAP1_EVNT_IE_CH4_Msk (0x1UL << TIMER_IE_CCR_CAP1_EVNT_IE_CH4_Pos)
#define TIMER_IE_CCR_CAP1_EVNT_IE_CH4     TIMER_IE_CCR_CAP1_EVNT_IE_CH4_Msk

/** @} */ /* End of group MDR32VF0xI_TIMER_IE */

/** @defgroup MDR32VF0xI_TIMER_DMA_RE TIMER DMA_RE
 * @{
 */

#define TIMER_DMA_RE_CNT_ZERO_EVNT_RE_Pos     0
#define TIMER_DMA_RE_CNT_ZERO_EVNT_RE_Msk     (0x1UL << TIMER_DMA_RE_CNT_ZERO_EVNT_RE_Pos)
#define TIMER_DMA_RE_CNT_ZERO_EVNT_RE         TIMER_DMA_RE_CNT_ZERO_EVNT_RE_Msk

#define TIMER_DMA_RE_CNT_ARR_EVNT_RE_Pos      1
#define TIMER_DMA_RE_CNT_ARR_EVNT_RE_Msk      (0x1UL << TIMER_DMA_RE_CNT_ARR_EVNT_RE_Pos)
#define TIMER_DMA_RE_CNT_ARR_EVNT_RE          TIMER_DMA_RE_CNT_ARR_EVNT_RE_Msk

#define TIMER_DMA_RE_ETR_RE_EVNT_RE_Pos       2
#define TIMER_DMA_RE_ETR_RE_EVNT_RE_Msk       (0x1UL << TIMER_DMA_RE_ETR_RE_EVNT_RE_Pos)
#define TIMER_DMA_RE_ETR_RE_EVNT_RE           TIMER_DMA_RE_ETR_RE_EVNT_RE_Msk

#define TIMER_DMA_RE_ETR_FE_EVNT_RE_Pos       3
#define TIMER_DMA_RE_ETR_FE_EVNT_RE_Msk       (0x1UL << TIMER_DMA_RE_ETR_FE_EVNT_RE_Pos)
#define TIMER_DMA_RE_ETR_FE_EVNT_RE           TIMER_DMA_RE_ETR_FE_EVNT_RE_Msk

#define TIMER_DMA_RE_BRK_EVNT_RE_Pos          4
#define TIMER_DMA_RE_BRK_EVNT_RE_Msk          (0x1UL << TIMER_DMA_RE_BRK_EVNT_RE_Pos)
#define TIMER_DMA_RE_BRK_EVNT_RE              TIMER_DMA_RE_BRK_EVNT_RE_Msk

#define TIMER_DMA_RE_CCR_CAP_EVNT_RE_CH1_Pos  5
#define TIMER_DMA_RE_CCR_CAP_EVNT_RE_CH1_Msk  (0x1UL << TIMER_DMA_RE_CCR_CAP_EVNT_RE_CH1_Pos)
#define TIMER_DMA_RE_CCR_CAP_EVNT_RE_CH1      TIMER_DMA_RE_CCR_CAP_EVNT_RE_CH1_Msk

#define TIMER_DMA_RE_CCR_CAP_EVNT_RE_CH2_Pos  6
#define TIMER_DMA_RE_CCR_CAP_EVNT_RE_CH2_Msk  (0x1UL << TIMER_DMA_RE_CCR_CAP_EVNT_RE_CH2_Pos)
#define TIMER_DMA_RE_CCR_CAP_EVNT_RE_CH2      TIMER_DMA_RE_CCR_CAP_EVNT_RE_CH2_Msk

#define TIMER_DMA_RE_CCR_CAP_EVNT_RE_CH3_Pos  7
#define TIMER_DMA_RE_CCR_CAP_EVNT_RE_CH3_Msk  (0x1UL << TIMER_DMA_RE_CCR_CAP_EVNT_RE_CH3_Pos)
#define TIMER_DMA_RE_CCR_CAP_EVNT_RE_CH3      TIMER_DMA_RE_CCR_CAP_EVNT_RE_CH3_Msk

#define TIMER_DMA_RE_CCR_CAP_EVNT_RE_CH4_Pos  8
#define TIMER_DMA_RE_CCR_CAP_EVNT_RE_CH4_Msk  (0x1UL << TIMER_DMA_RE_CCR_CAP_EVNT_RE_CH4_Pos)
#define TIMER_DMA_RE_CCR_CAP_EVNT_RE_CH4      TIMER_DMA_RE_CCR_CAP_EVNT_RE_CH4_Msk

#define TIMER_DMA_RE_CCR_REF_EVNT_RE_CH1_Pos  9
#define TIMER_DMA_RE_CCR_REF_EVNT_RE_CH1_Msk  (0x1UL << TIMER_DMA_RE_CCR_REF_EVNT_RE_CH1_Pos)
#define TIMER_DMA_RE_CCR_REF_EVNT_RE_CH1      TIMER_DMA_RE_CCR_REF_EVNT_RE_CH1_Msk

#define TIMER_DMA_RE_CCR_REF_EVNT_RE_CH2_Pos  10
#define TIMER_DMA_RE_CCR_REF_EVNT_RE_CH2_Msk  (0x1UL << TIMER_DMA_RE_CCR_REF_EVNT_RE_CH2_Pos)
#define TIMER_DMA_RE_CCR_REF_EVNT_RE_CH2      TIMER_DMA_RE_CCR_REF_EVNT_RE_CH2_Msk

#define TIMER_DMA_RE_CCR_REF_EVNT_RE_CH3_Pos  11
#define TIMER_DMA_RE_CCR_REF_EVNT_RE_CH3_Msk  (0x1UL << TIMER_DMA_RE_CCR_REF_EVNT_RE_CH3_Pos)
#define TIMER_DMA_RE_CCR_REF_EVNT_RE_CH3      TIMER_DMA_RE_CCR_REF_EVNT_RE_CH3_Msk

#define TIMER_DMA_RE_CCR_REF_EVNT_RE_CH4_Pos  12
#define TIMER_DMA_RE_CCR_REF_EVNT_RE_CH4_Msk  (0x1UL << TIMER_DMA_RE_CCR_REF_EVNT_RE_CH4_Pos)
#define TIMER_DMA_RE_CCR_REF_EVNT_RE_CH4      TIMER_DMA_RE_CCR_REF_EVNT_RE_CH4_Msk

#define TIMER_DMA_RE_CCR_CAP1_EVNT_RE_CH1_Pos 13
#define TIMER_DMA_RE_CCR_CAP1_EVNT_RE_CH1_Msk (0x1UL << TIMER_DMA_RE_CCR_CAP1_EVNT_RE_CH1_Pos)
#define TIMER_DMA_RE_CCR_CAP1_EVNT_RE_CH1     TIMER_DMA_RE_CCR_CAP1_EVNT_RE_CH1_Msk

#define TIMER_DMA_RE_CCR_CAP1_EVNT_RE_CH2_Pos 14
#define TIMER_DMA_RE_CCR_CAP1_EVNT_RE_CH2_Msk (0x1UL << TIMER_DMA_RE_CCR_CAP1_EVNT_RE_CH2_Pos)
#define TIMER_DMA_RE_CCR_CAP1_EVNT_RE_CH2     TIMER_DMA_RE_CCR_CAP1_EVNT_RE_CH2_Msk

#define TIMER_DMA_RE_CCR_CAP1_EVNT_RE_CH3_Pos 15
#define TIMER_DMA_RE_CCR_CAP1_EVNT_RE_CH3_Msk (0x1UL << TIMER_DMA_RE_CCR_CAP1_EVNT_RE_CH3_Pos)
#define TIMER_DMA_RE_CCR_CAP1_EVNT_RE_CH3     TIMER_DMA_RE_CCR_CAP1_EVNT_RE_CH3_Msk

#define TIMER_DMA_RE_CCR_CAP1_EVNT_RE_CH4_Pos 16
#define TIMER_DMA_RE_CCR_CAP1_EVNT_RE_CH4_Msk (0x1UL << TIMER_DMA_RE_CCR_CAP1_EVNT_RE_CH4_Pos)
#define TIMER_DMA_RE_CCR_CAP1_EVNT_RE_CH4     TIMER_DMA_RE_CCR_CAP1_EVNT_RE_CH4_Msk

/** @} */ /* End of group MDR32VF0xI_TIMER_DMA_RE */

