piborisovich/microcontrollers/Milandr/Libraries/CMSIS/MDR32VF0xI/DeviceSupport/inc/MDR32VF0xI.h
/** @defgroup MDR32VF0xI_TIMER_CH_CNTRL2 TIMER CH_CNTRL2
 * @{
 */

#define TIMER_CH_CNTRL2_CH_SEL1_Pos     0
#define TIMER_CH_CNTRL2_CH_SEL1_Msk     (0x3UL << TIMER_CH_CNTRL2_CH_SEL1_Pos)
#define TIMER_CH_CNTRL2_CH_SEL1_CH_RE   (0x0UL << TIMER_CH_CNTRL2_CH_SEL1_Pos)
#define TIMER_CH_CNTRL2_CH_SEL1_CH_FE   (0x1UL << TIMER_CH_CNTRL2_CH_SEL1_Pos)
#define TIMER_CH_CNTRL2_CH_SEL1_CHp1_FE (0x2UL << TIMER_CH_CNTRL2_CH_SEL1_Pos)
#define TIMER_CH_CNTRL2_CH_SEL1_CHp2_FE (0x3UL << TIMER_CH_CNTRL2_CH_SEL1_Pos)

#define TIMER_CH_CNTRL2_CCR1_EN_Pos     2
#define TIMER_CH_CNTRL2_CCR1_EN_Msk     (0x1UL << TIMER_CH_CNTRL2_CCR1_EN_Pos)
#define TIMER_CH_CNTRL2_CCR1_EN         TIMER_CH_CNTRL2_CCR1_EN_Msk

#define TIMER_CH_CNTRL2_CCR_RLD_Pos     3
#define TIMER_CH_CNTRL2_CCR_RLD_Msk     (0x1UL << TIMER_CH_CNTRL2_CCR_RLD_Pos)
#define TIMER_CH_CNTRL2_CCR_RLD         TIMER_CH_CNTRL2_CCR_RLD_Msk

#define TIMER_CH_CNTRL2_EVNT_DLY_Pos    4
#define TIMER_CH_CNTRL2_EVNT_DLY_Msk    (0x1UL << TIMER_CH_CNTRL2_EVNT_DLY_Pos)
#define TIMER_CH_CNTRL2_EVNT_DLY        TIMER_CH_CNTRL2_EVNT_DLY_Msk

/** @} */ /* End of group MDR32VF0xI_TIMER_CH_CNTRL2 */

/** @defgroup MDR32VF0xI_TIMER_CH_CCR1 TIMER CH_CCR1
 * @{
 */

#define TIMER_CH_CCR1_CCR1_Pos 0
#define TIMER_CH_CCR1_CCR1_Msk (0xFFFFFFFFUL << TIMER_CH_CCR1_CCR1_Pos)

/** @} */ /* End of group MDR32VF0xI_TIMER_CH_CCR1 */

/** @} */ /* End of group MDR32VF0xI_TIMER_Defines */

/** @} */ /* End of group MDR32VF0xI_TIMER */

/** @defgroup MDR32VF0xI_PORT MDR_PORT
 * @{
 */

/**
 * @brief MDR32VF0xI PORT control structure.
 */
typedef struct {
    __IO uint32_t RXTX;      /*!<PORT Data Register */
    __IO uint32_t OE;        /*!<PORT Output Enable Register */
    __IO uint32_t FUNC;      /*!<PORT Function Register */
    __IO uint32_t ANALOG;    /*!<PORT Analog Function Register */
    __IO uint32_t PULL;      /*!<PORT Pull Up/Down Register */
    __I uint32_t  RESERVED0; /*!<Reserved */
    __IO uint32_t PWR;       /*!<PORT Power Register */
    __I uint32_t  RESERVED1; /*!<Reserved */
    __IO uint32_t SETTX;     /*!<PORT Set Output Register */
    __IO uint32_t CLRTX;     /*!<PORT Reset Output Register */
    __I uint32_t  RDTX;      /*!<PORT Read Output Register */
} MDR_PORT_TypeDef;

/** @defgroup MDR32VF0xI_PORT_Defines PORT Defines
 * @{
 */

/** @defgroup MDR32VF0xI_PORT_RXTX PORT RXTX
 * @{
 */

#define PORT_RXTX_RXTX_Pos   0
#define PORT_RXTX_RXTX_Msk   (0xFFFFUL << PORT_RXTX_RXTX_Pos)

#define PORT_RXTX_RXTX0_Pos  0
#define PORT_RXTX_RXTX0_Msk  (0x1UL << PORT_RXTX_RXTX0_Pos)
#define PORT_RXTX_RXTX0      PORT_RXTX_RXTX0_Msk

#define PORT_RXTX_RXTX1_Pos  1
#define PORT_RXTX_RXTX1_Msk  (0x1UL << PORT_RXTX_RXTX1_Pos)
#define PORT_RXTX_RXTX1      PORT_RXTX_RXTX1_Msk

#define PORT_RXTX_RXTX2_Pos  2
#define PORT_RXTX_RXTX2_Msk  (0x1UL << PORT_RXTX_RXTX2_Pos)
#define PORT_RXTX_RXTX2      PORT_RXTX_RXTX2_Msk

#define PORT_RXTX_RXTX3_Pos  3
#define PORT_RXTX_RXTX3_Msk  (0x1UL << PORT_RXTX_RXTX3_Pos)
#define PORT_RXTX_RXTX3      PORT_RXTX_RXTX3_Msk

#define PORT_RXTX_RXTX4_Pos  4
#define PORT_RXTX_RXTX4_Msk  (0x1UL << PORT_RXTX_RXTX4_Pos)
#define PORT_RXTX_RXTX4      PORT_RXTX_RXTX4_Msk

#define PORT_RXTX_RXTX5_Pos  5
#define PORT_RXTX_RXTX5_Msk  (0x1UL << PORT_RXTX_RXTX5_Pos)
#define PORT_RXTX_RXTX5      PORT_RXTX_RXTX5_Msk

#define PORT_RXTX_RXTX6_Pos  6
#define PORT_RXTX_RXTX6_Msk  (0x1UL << PORT_RXTX_RXTX6_Pos)
#define PORT_RXTX_RXTX6      PORT_RXTX_RXTX6_Msk

#define PORT_RXTX_RXTX7_Pos  7
#define PORT_RXTX_RXTX7_Msk  (0x1UL << PORT_RXTX_RXTX7_Pos)
#define PORT_RXTX_RXTX7      PORT_RXTX_RXTX7_Msk

#define PORT_RXTX_RXTX8_Pos  8
#define PORT_RXTX_RXTX8_Msk  (0x1UL << PORT_RXTX_RXTX8_Pos)
#define PORT_RXTX_RXTX8      PORT_RXTX_RXTX8_Msk

#define PORT_RXTX_RXTX9_Pos  9
#define PORT_RXTX_RXTX9_Msk  (0x1UL << PORT_RXTX_RXTX9_Pos)
#define PORT_RXTX_RXTX9      PORT_RXTX_RXTX9_Msk

#define PORT_RXTX_RXTX10_Pos 10
#define PORT_RXTX_RXTX10_Msk (0x1UL << PORT_RXTX_RXTX10_Pos)
#define PORT_RXTX_RXTX10     PORT_RXTX_RXTX10_Msk

#define PORT_RXTX_RXTX11_Pos 11
#define PORT_RXTX_RXTX11_Msk (0x1UL << PORT_RXTX_RXTX11_Pos)
#define PORT_RXTX_RXTX11     PORT_RXTX_RXTX11_Msk

#define PORT_RXTX_RXTX12_Pos 12
#define PORT_RXTX_RXTX12_Msk (0x1UL << PORT_RXTX_RXTX12_Pos)
#define PORT_RXTX_RXTX12     PORT_RXTX_RXTX12_Msk

#define PORT_RXTX_RXTX13_Pos 13
#define PORT_RXTX_RXTX13_Msk (0x1UL << PORT_RXTX_RXTX13_Pos)
#define PORT_RXTX_RXTX13     PORT_RXTX_RXTX13_Msk

#define PORT_RXTX_RXTX14_Pos 14
#define PORT_RXTX_RXTX14_Msk (0x1UL << PORT_RXTX_RXTX14_Pos)
#define PORT_RXTX_RXTX14     PORT_RXTX_RXTX14_Msk

#define PORT_RXTX_RXTX15_Pos 15
#define PORT_RXTX_RXTX15_Msk (0x1UL << PORT_RXTX_RXTX15_Pos)
#define PORT_RXTX_RXTX15     PORT_RXTX_RXTX15_Msk

/** @} */ /* End of group MDR32VF0xI_PORT_RXTX */

/** @defgroup MDR32VF0xI_PORT_OE PORT OE
 * @{
 */

#define PORT_OE_OE_Pos   0
#define PORT_OE_OE_Msk   (0xFFFFUL << PORT_OE_OE_Pos)

#define PORT_OE_OE0_Pos  0
#define PORT_OE_OE0_Msk  (0x1UL << PORT_OE_OE0_Pos)
#define PORT_OE_OE0      PORT_OE_OE0_Msk

#define PORT_OE_OE1_Pos  1
#define PORT_OE_OE1_Msk  (0x1UL << PORT_OE_OE1_Pos)
#define PORT_OE_OE1      PORT_OE_OE1_Msk

#define PORT_OE_OE2_Pos  2
#define PORT_OE_OE2_Msk  (0x1UL << PORT_OE_OE2_Pos)
#define PORT_OE_OE2      PORT_OE_OE2_Msk

#define PORT_OE_OE3_Pos  3
#define PORT_OE_OE3_Msk  (0x1UL << PORT_OE_OE3_Pos)
#define PORT_OE_OE3      PORT_OE_OE3_Msk

#define PORT_OE_OE4_Pos  4
#define PORT_OE_OE4_Msk  (0x1UL << PORT_OE_OE4_Pos)
#define PORT_OE_OE4      PORT_OE_OE4_Msk

#define PORT_OE_OE5_Pos  5
#define PORT_OE_OE5_Msk  (0x1UL << PORT_OE_OE5_Pos)
#define PORT_OE_OE5      PORT_OE_OE5_Msk

#define PORT_OE_OE6_Pos  6
#define PORT_OE_OE6_Msk  (0x1UL << PORT_OE_OE6_Pos)
#define PORT_OE_OE6      PORT_OE_OE6_Msk

#define PORT_OE_OE7_Pos  7
#define PORT_OE_OE7_Msk  (0x1UL << PORT_OE_OE7_Pos)
#define PORT_OE_OE7      PORT_OE_OE7_Msk

#define PORT_OE_OE8_Pos  8
#define PORT_OE_OE8_Msk  (0x1UL << PORT_OE_OE8_Pos)
#define PORT_OE_OE8      PORT_OE_OE8_Msk

#define PORT_OE_OE9_Pos  9
#define PORT_OE_OE9_Msk  (0x1UL << PORT_OE_OE9_Pos)
#define PORT_OE_OE9      PORT_OE_OE9_Msk

#define PORT_OE_OE10_Pos 10
#define PORT_OE_OE10_Msk (0x1UL << PORT_OE_OE10_Pos)
#define PORT_OE_OE10     PORT_OE_OE10_Msk

#define PORT_OE_OE11_Pos 11
#define PORT_OE_OE11_Msk (0x1UL << PORT_OE_OE11_Pos)
#define PORT_OE_OE11     PORT_OE_OE11_Msk

#define PORT_OE_OE12_Pos 12
#define PORT_OE_OE12_Msk (0x1UL << PORT_OE_OE12_Pos)
#define PORT_OE_OE12     PORT_OE_OE12_Msk

#define PORT_OE_OE13_Pos 13
#define PORT_OE_OE13_Msk (0x1UL << PORT_OE_OE13_Pos)
#define PORT_OE_OE13     PORT_OE_OE13_Msk

#define PORT_OE_OE14_Pos 14
#define PORT_OE_OE14_Msk (0x1UL << PORT_OE_OE14_Pos)
#define PORT_OE_OE14     PORT_OE_OE14_Msk

#define PORT_OE_OE15_Pos 15
#define PORT_OE_OE15_Msk (0x1UL << PORT_OE_OE15_Pos)
#define PORT_OE_OE15     PORT_OE_OE15_Msk

/** @} */ /* End of group MDR32VF0xI_PORT_OE */

/** @defgroup MDR32VF0xI_PORT_FUNC PORT FUNC
 * @{
 */

