piborisovich/microcontrollers/Milandr/Libraries/CMSIS/MDR32VF0xI/DeviceSupport/inc/MDR32VF0xI.h
#define PORT_FUNC_MODE_Pos           0
#define PORT_FUNC_MODE_Msk           (0xFFFFFFFFUL)

#define PORT_FUNC_MODE0_Pos          0
#define PORT_FUNC_MODE0_Msk          (0x3UL << PORT_FUNC_MODE0_Pos)
#define PORT_FUNC_MODE0_PORT         (0x0UL << PORT_FUNC_MODE0_Pos)
#define PORT_FUNC_MODE0_MAIN         (0x1UL << PORT_FUNC_MODE0_Pos)
#define PORT_FUNC_MODE0_ALTERNATIVE  (0x2UL << PORT_FUNC_MODE0_Pos)
#define PORT_FUNC_MODE0_OVERRIDDEN   (0x3UL << PORT_FUNC_MODE0_Pos)

#define PORT_FUNC_MODE1_Pos          2
#define PORT_FUNC_MODE1_Msk          (0x3UL << PORT_FUNC_MODE1_Pos)
#define PORT_FUNC_MODE1_PORT         (0x0UL << PORT_FUNC_MODE1_Pos)
#define PORT_FUNC_MODE1_MAIN         (0x1UL << PORT_FUNC_MODE1_Pos)
#define PORT_FUNC_MODE1_ALTERNATIVE  (0x2UL << PORT_FUNC_MODE1_Pos)
#define PORT_FUNC_MODE1_OVERRIDDEN   (0x3UL << PORT_FUNC_MODE1_Pos)

#define PORT_FUNC_MODE2_Pos          4
#define PORT_FUNC_MODE2_Msk          (0x3UL << PORT_FUNC_MODE2_Pos)
#define PORT_FUNC_MODE2_PORT         (0x0UL << PORT_FUNC_MODE2_Pos)
#define PORT_FUNC_MODE2_MAIN         (0x1UL << PORT_FUNC_MODE2_Pos)
#define PORT_FUNC_MODE2_ALTERNATIVE  (0x2UL << PORT_FUNC_MODE2_Pos)
#define PORT_FUNC_MODE2_OVERRIDDEN   (0x3UL << PORT_FUNC_MODE2_Pos)

#define PORT_FUNC_MODE3_Pos          6
#define PORT_FUNC_MODE3_Msk          (0x3UL << PORT_FUNC_MODE3_Pos)
#define PORT_FUNC_MODE3_PORT         (0x0UL << PORT_FUNC_MODE3_Pos)
#define PORT_FUNC_MODE3_MAIN         (0x1UL << PORT_FUNC_MODE3_Pos)
#define PORT_FUNC_MODE3_ALTERNATIVE  (0x2UL << PORT_FUNC_MODE3_Pos)
#define PORT_FUNC_MODE3_OVERRIDDEN   (0x3UL << PORT_FUNC_MODE3_Pos)

#define PORT_FUNC_MODE4_Pos          8
#define PORT_FUNC_MODE4_Msk          (0x3UL << PORT_FUNC_MODE4_Pos)
#define PORT_FUNC_MODE4_PORT         (0x0UL << PORT_FUNC_MODE4_Pos)
#define PORT_FUNC_MODE4_MAIN         (0x1UL << PORT_FUNC_MODE4_Pos)
#define PORT_FUNC_MODE4_ALTERNATIVE  (0x2UL << PORT_FUNC_MODE4_Pos)
#define PORT_FUNC_MODE4_OVERRIDDEN   (0x3UL << PORT_FUNC_MODE4_Pos)

#define PORT_FUNC_MODE5_Pos          10
#define PORT_FUNC_MODE5_Msk          (0x3UL << PORT_FUNC_MODE5_Pos)
#define PORT_FUNC_MODE5_PORT         (0x0UL << PORT_FUNC_MODE5_Pos)
#define PORT_FUNC_MODE5_MAIN         (0x1UL << PORT_FUNC_MODE5_Pos)
#define PORT_FUNC_MODE5_ALTERNATIVE  (0x2UL << PORT_FUNC_MODE5_Pos)
#define PORT_FUNC_MODE5_OVERRIDDEN   (0x3UL << PORT_FUNC_MODE5_Pos)

#define PORT_FUNC_MODE6_Pos          12
#define PORT_FUNC_MODE6_Msk          (0x3UL << PORT_FUNC_MODE6_Pos)
#define PORT_FUNC_MODE6_PORT         (0x0UL << PORT_FUNC_MODE6_Pos)
#define PORT_FUNC_MODE6_MAIN         (0x1UL << PORT_FUNC_MODE6_Pos)
#define PORT_FUNC_MODE6_ALTERNATIVE  (0x2UL << PORT_FUNC_MODE6_Pos)
#define PORT_FUNC_MODE6_OVERRIDDEN   (0x3UL << PORT_FUNC_MODE6_Pos)

#define PORT_FUNC_MODE7_Pos          14
#define PORT_FUNC_MODE7_Msk          (0x3UL << PORT_FUNC_MODE7_Pos)
#define PORT_FUNC_MODE7_PORT         (0x0UL << PORT_FUNC_MODE7_Pos)
#define PORT_FUNC_MODE7_MAIN         (0x1UL << PORT_FUNC_MODE7_Pos)
#define PORT_FUNC_MODE7_ALTERNATIVE  (0x2UL << PORT_FUNC_MODE7_Pos)
#define PORT_FUNC_MODE7_OVERRIDDEN   (0x3UL << PORT_FUNC_MODE7_Pos)

#define PORT_FUNC_MODE8_Pos          16
#define PORT_FUNC_MODE8_Msk          (0x3UL << PORT_FUNC_MODE8_Pos)
#define PORT_FUNC_MODE8_PORT         (0x0UL << PORT_FUNC_MODE8_Pos)
#define PORT_FUNC_MODE8_MAIN         (0x1UL << PORT_FUNC_MODE8_Pos)
#define PORT_FUNC_MODE8_ALTERNATIVE  (0x2UL << PORT_FUNC_MODE8_Pos)
#define PORT_FUNC_MODE8_OVERRIDDEN   (0x3UL << PORT_FUNC_MODE8_Pos)

#define PORT_FUNC_MODE9_Pos          18
#define PORT_FUNC_MODE9_Msk          (0x3UL << PORT_FUNC_MODE9_Pos)
#define PORT_FUNC_MODE9_PORT         (0x0UL << PORT_FUNC_MODE9_Pos)
#define PORT_FUNC_MODE9_MAIN         (0x1UL << PORT_FUNC_MODE9_Pos)
#define PORT_FUNC_MODE9_ALTERNATIVE  (0x2UL << PORT_FUNC_MODE9_Pos)
#define PORT_FUNC_MODE9_OVERRIDDEN   (0x3UL << PORT_FUNC_MODE9_Pos)

#define PORT_FUNC_MODE10_Pos         20
#define PORT_FUNC_MODE10_Msk         (0x3UL << PORT_FUNC_MODE10_Pos)
#define PORT_FUNC_MODE10_PORT        (0x0UL << PORT_FUNC_MODE10_Pos)
#define PORT_FUNC_MODE10_MAIN        (0x1UL << PORT_FUNC_MODE10_Pos)
#define PORT_FUNC_MODE10_ALTERNATIVE (0x2UL << PORT_FUNC_MODE10_Pos)
#define PORT_FUNC_MODE10_OVERRIDDEN  (0x3UL << PORT_FUNC_MODE10_Pos)

#define PORT_FUNC_MODE11_Pos         22
#define PORT_FUNC_MODE11_Msk         (0x3UL << PORT_FUNC_MODE11_Pos)
#define PORT_FUNC_MODE11_PORT        (0x0UL << PORT_FUNC_MODE11_Pos)
#define PORT_FUNC_MODE11_MAIN        (0x1UL << PORT_FUNC_MODE11_Pos)
#define PORT_FUNC_MODE11_ALTERNATIVE (0x2UL << PORT_FUNC_MODE11_Pos)
#define PORT_FUNC_MODE11_OVERRIDDEN  (0x3UL << PORT_FUNC_MODE11_Pos)

#define PORT_FUNC_MODE12_Pos         24
#define PORT_FUNC_MODE12_Msk         (0x3UL << PORT_FUNC_MODE12_Pos)
#define PORT_FUNC_MODE12_PORT        (0x0UL << PORT_FUNC_MODE12_Pos)
#define PORT_FUNC_MODE12_MAIN        (0x1UL << PORT_FUNC_MODE12_Pos)
#define PORT_FUNC_MODE12_ALTERNATIVE (0x2UL << PORT_FUNC_MODE12_Pos)
#define PORT_FUNC_MODE12_OVERRIDDEN  (0x3UL << PORT_FUNC_MODE12_Pos)

#define PORT_FUNC_MODE13_Pos         26
#define PORT_FUNC_MODE13_Msk         (0x3UL << PORT_FUNC_MODE13_Pos)
#define PORT_FUNC_MODE13_PORT        (0x0UL << PORT_FUNC_MODE13_Pos)
#define PORT_FUNC_MODE13_MAIN        (0x1UL << PORT_FUNC_MODE13_Pos)
#define PORT_FUNC_MODE13_ALTERNATIVE (0x2UL << PORT_FUNC_MODE13_Pos)
#define PORT_FUNC_MODE13_OVERRIDDEN  (0x3UL << PORT_FUNC_MODE13_Pos)

#define PORT_FUNC_MODE14_Pos         28
#define PORT_FUNC_MODE14_Msk         (0x3UL << PORT_FUNC_MODE14_Pos)
#define PORT_FUNC_MODE14_PORT        (0x0UL << PORT_FUNC_MODE14_Pos)
#define PORT_FUNC_MODE14_MAIN        (0x1UL << PORT_FUNC_MODE14_Pos)
#define PORT_FUNC_MODE14_ALTERNATIVE (0x2UL << PORT_FUNC_MODE14_Pos)
#define PORT_FUNC_MODE14_OVERRIDDEN  (0x3UL << PORT_FUNC_MODE14_Pos)

#define PORT_FUNC_MODE15_Pos         30
#define PORT_FUNC_MODE15_Msk         (0x3UL << PORT_FUNC_MODE15_Pos)
#define PORT_FUNC_MODE15_PORT        (0x0UL << PORT_FUNC_MODE15_Pos)
#define PORT_FUNC_MODE15_MAIN        (0x1UL << PORT_FUNC_MODE15_Pos)
#define PORT_FUNC_MODE15_ALTERNATIVE (0x2UL << PORT_FUNC_MODE15_Pos)
#define PORT_FUNC_MODE15_OVERRIDDEN  (0x3UL << PORT_FUNC_MODE15_Pos)

/** @} */ /* End of group MDR32VF0xI_PORT_FUNC */

/** @defgroup MDR32VF0xI_PORT_ANALOG PORT ANALOG
 * @{
 */

