piborisovich/microcontrollers/Milandr/Libraries/CMSIS/MDR32VF0xI/DeviceSupport/inc/MDR32VF0xI.h
#define PORT_ANALOG_ANALOG_EN_Pos   0
#define PORT_ANALOG_ANALOG_EN_Msk   (0xFFFFUL << PORT_ANALOG_ANALOG_EN_Pos)

#define PORT_ANALOG_ANALOG_EN0_Pos  0
#define PORT_ANALOG_ANALOG_EN0_Msk  (0x1UL << PORT_ANALOG_ANALOG_EN0_Pos)
#define PORT_ANALOG_ANALOG_EN0      PORT_ANALOG_ANALOG_EN0_Msk

#define PORT_ANALOG_ANALOG_EN1_Pos  1
#define PORT_ANALOG_ANALOG_EN1_Msk  (0x1UL << PORT_ANALOG_ANALOG_EN1_Pos)
#define PORT_ANALOG_ANALOG_EN1      PORT_ANALOG_ANALOG_EN1_Msk

#define PORT_ANALOG_ANALOG_EN2_Pos  2
#define PORT_ANALOG_ANALOG_EN2_Msk  (0x1UL << PORT_ANALOG_ANALOG_EN2_Pos)
#define PORT_ANALOG_ANALOG_EN2      PORT_ANALOG_ANALOG_EN2_Msk

#define PORT_ANALOG_ANALOG_EN3_Pos  3
#define PORT_ANALOG_ANALOG_EN3_Msk  (0x1UL << PORT_ANALOG_ANALOG_EN3_Pos)
#define PORT_ANALOG_ANALOG_EN3      PORT_ANALOG_ANALOG_EN3_Msk

#define PORT_ANALOG_ANALOG_EN4_Pos  4
#define PORT_ANALOG_ANALOG_EN4_Msk  (0x1UL << PORT_ANALOG_ANALOG_EN4_Pos)
#define PORT_ANALOG_ANALOG_EN4      PORT_ANALOG_ANALOG_EN4_Msk

#define PORT_ANALOG_ANALOG_EN5_Pos  5
#define PORT_ANALOG_ANALOG_EN5_Msk  (0x1UL << PORT_ANALOG_ANALOG_EN5_Pos)
#define PORT_ANALOG_ANALOG_EN5      PORT_ANALOG_ANALOG_EN5_Msk

#define PORT_ANALOG_ANALOG_EN6_Pos  6
#define PORT_ANALOG_ANALOG_EN6_Msk  (0x1UL << PORT_ANALOG_ANALOG_EN6_Pos)
#define PORT_ANALOG_ANALOG_EN6      PORT_ANALOG_ANALOG_EN6_Msk

#define PORT_ANALOG_ANALOG_EN7_Pos  7
#define PORT_ANALOG_ANALOG_EN7_Msk  (0x1UL << PORT_ANALOG_ANALOG_EN7_Pos)
#define PORT_ANALOG_ANALOG_EN7      PORT_ANALOG_ANALOG_EN7_Msk

#define PORT_ANALOG_ANALOG_EN8_Pos  8
#define PORT_ANALOG_ANALOG_EN8_Msk  (0x1UL << PORT_ANALOG_ANALOG_EN8_Pos)
#define PORT_ANALOG_ANALOG_EN8      PORT_ANALOG_ANALOG_EN8_Msk

#define PORT_ANALOG_ANALOG_EN9_Pos  9
#define PORT_ANALOG_ANALOG_EN9_Msk  (0x1UL << PORT_ANALOG_ANALOG_EN9_Pos)
#define PORT_ANALOG_ANALOG_EN9      PORT_ANALOG_ANALOG_EN9_Msk

#define PORT_ANALOG_ANALOG_EN10_Pos 10
#define PORT_ANALOG_ANALOG_EN10_Msk (0x1UL << PORT_ANALOG_ANALOG_EN10_Pos)
#define PORT_ANALOG_ANALOG_EN10     PORT_ANALOG_ANALOG_EN10_Msk

#define PORT_ANALOG_ANALOG_EN11_Pos 11
#define PORT_ANALOG_ANALOG_EN11_Msk (0x1UL << PORT_ANALOG_ANALOG_EN11_Pos)
#define PORT_ANALOG_ANALOG_EN11     PORT_ANALOG_ANALOG_EN11_Msk

#define PORT_ANALOG_ANALOG_EN12_Pos 12
#define PORT_ANALOG_ANALOG_EN12_Msk (0x1UL << PORT_ANALOG_ANALOG_EN12_Pos)
#define PORT_ANALOG_ANALOG_EN12     PORT_ANALOG_ANALOG_EN12_Msk

#define PORT_ANALOG_ANALOG_EN13_Pos 13
#define PORT_ANALOG_ANALOG_EN13_Msk (0x1UL << PORT_ANALOG_ANALOG_EN13_Pos)
#define PORT_ANALOG_ANALOG_EN13     PORT_ANALOG_ANALOG_EN13_Msk

#define PORT_ANALOG_ANALOG_EN14_Pos 14
#define PORT_ANALOG_ANALOG_EN14_Msk (0x1UL << PORT_ANALOG_ANALOG_EN14_Pos)
#define PORT_ANALOG_ANALOG_EN14     PORT_ANALOG_ANALOG_EN14_Msk

#define PORT_ANALOG_ANALOG_EN15_Pos 15
#define PORT_ANALOG_ANALOG_EN15_Msk (0x1UL << PORT_ANALOG_ANALOG_EN15_Pos)
#define PORT_ANALOG_ANALOG_EN15     PORT_ANALOG_ANALOG_EN15_Msk

/** @} */ /* End of group MDR32VF0xI_PORT_ANALOG */

/** @defgroup MDR32VF0xI_PORT_PULL PORT PULL
 * @{
 */

#define PORT_PULL_PULL_DOWN_Pos   0
#define PORT_PULL_PULL_DOWN_Msk   (0xFFFFUL << PORT_PULL_PULL_DOWN_Pos)

#define PORT_PULL_PULL_DOWN0_Pos  0
#define PORT_PULL_PULL_DOWN0_Msk  (0x1UL << PORT_PULL_PULL_DOWN0_Pos)
#define PORT_PULL_PULL_DOWN0      PORT_PULL_PULL_DOWN0_Msk

#define PORT_PULL_PULL_DOWN1_Pos  1
#define PORT_PULL_PULL_DOWN1_Msk  (0x1UL << PORT_PULL_PULL_DOWN1_Pos)
#define PORT_PULL_PULL_DOWN1      PORT_PULL_PULL_DOWN1_Msk

#define PORT_PULL_PULL_DOWN2_Pos  2
#define PORT_PULL_PULL_DOWN2_Msk  (0x1UL << PORT_PULL_PULL_DOWN2_Pos)
#define PORT_PULL_PULL_DOWN2      PORT_PULL_PULL_DOWN2_Msk

#define PORT_PULL_PULL_DOWN3_Pos  3
#define PORT_PULL_PULL_DOWN3_Msk  (0x1UL << PORT_PULL_PULL_DOWN3_Pos)
#define PORT_PULL_PULL_DOWN3      PORT_PULL_PULL_DOWN3_Msk

#define PORT_PULL_PULL_DOWN4_Pos  4
#define PORT_PULL_PULL_DOWN4_Msk  (0x1UL << PORT_PULL_PULL_DOWN4_Pos)
#define PORT_PULL_PULL_DOWN4      PORT_PULL_PULL_DOWN4_Msk

#define PORT_PULL_PULL_DOWN5_Pos  5
#define PORT_PULL_PULL_DOWN5_Msk  (0x1UL << PORT_PULL_PULL_DOWN5_Pos)
#define PORT_PULL_PULL_DOWN5      PORT_PULL_PULL_DOWN5_Msk

#define PORT_PULL_PULL_DOWN6_Pos  6
#define PORT_PULL_PULL_DOWN6_Msk  (0x1UL << PORT_PULL_PULL_DOWN6_Pos)
#define PORT_PULL_PULL_DOWN6      PORT_PULL_PULL_DOWN6_Msk

#define PORT_PULL_PULL_DOWN7_Pos  7
#define PORT_PULL_PULL_DOWN7_Msk  (0x1UL << PORT_PULL_PULL_DOWN7_Pos)
#define PORT_PULL_PULL_DOWN7      PORT_PULL_PULL_DOWN7_Msk

#define PORT_PULL_PULL_DOWN8_Pos  8
#define PORT_PULL_PULL_DOWN8_Msk  (0x1UL << PORT_PULL_PULL_DOWN8_Pos)
#define PORT_PULL_PULL_DOWN8      PORT_PULL_PULL_DOWN8_Msk

#define PORT_PULL_PULL_DOWN9_Pos  9
#define PORT_PULL_PULL_DOWN9_Msk  (0x1UL << PORT_PULL_PULL_DOWN9_Pos)
#define PORT_PULL_PULL_DOWN9      PORT_PULL_PULL_DOWN9_Msk

#define PORT_PULL_PULL_DOWN10_Pos 10
#define PORT_PULL_PULL_DOWN10_Msk (0x1UL << PORT_PULL_PULL_DOWN10_Pos)
#define PORT_PULL_PULL_DOWN10     PORT_PULL_PULL_DOWN10_Msk

#define PORT_PULL_PULL_DOWN11_Pos 11
#define PORT_PULL_PULL_DOWN11_Msk (0x1UL << PORT_PULL_PULL_DOWN11_Pos)
#define PORT_PULL_PULL_DOWN11     PORT_PULL_PULL_DOWN11_Msk

#define PORT_PULL_PULL_DOWN12_Pos 12
#define PORT_PULL_PULL_DOWN12_Msk (0x1UL << PORT_PULL_PULL_DOWN12_Pos)
#define PORT_PULL_PULL_DOWN12     PORT_PULL_PULL_DOWN12_Msk

#define PORT_PULL_PULL_DOWN13_Pos 13
#define PORT_PULL_PULL_DOWN13_Msk (0x1UL << PORT_PULL_PULL_DOWN13_Pos)
#define PORT_PULL_PULL_DOWN13     PORT_PULL_PULL_DOWN13_Msk

#define PORT_PULL_PULL_DOWN14_Pos 14
#define PORT_PULL_PULL_DOWN14_Msk (0x1UL << PORT_PULL_PULL_DOWN14_Pos)
#define PORT_PULL_PULL_DOWN14     PORT_PULL_PULL_DOWN14_Msk

#define PORT_PULL_PULL_DOWN15_Pos 15
#define PORT_PULL_PULL_DOWN15_Msk (0x1UL << PORT_PULL_PULL_DOWN15_Pos)
#define PORT_PULL_PULL_DOWN15     PORT_PULL_PULL_DOWN15_Msk

#if defined(USE_MDR32F02_REV_2) || defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)

#define PORT_PULL_PULL_UP_Pos   16
#define PORT_PULL_PULL_UP_Msk   (0xFFFFUL << PORT_PULL_PULL_UP_Pos)

#define PORT_PULL_PULL_UP0_Pos  16
#define PORT_PULL_PULL_UP0_Msk  (0x1UL << PORT_PULL_PULL_UP0_Pos)
#define PORT_PULL_PULL_UP0      PORT_PULL_PULL_UP0_Msk

