piborisovich/microcontrollers/Milandr/Libraries/CMSIS/MDR32VF0xI/DeviceSupport/inc/MDR32VF0xI.h
#define PORT_PULL_PULL_UP1_Pos  17
#define PORT_PULL_PULL_UP1_Msk  (0x1UL << PORT_PULL_PULL_UP1_Pos)
#define PORT_PULL_PULL_UP1      PORT_PULL_PULL_UP1_Msk

#define PORT_PULL_PULL_UP2_Pos  18
#define PORT_PULL_PULL_UP2_Msk  (0x1UL << PORT_PULL_PULL_UP2_Pos)
#define PORT_PULL_PULL_UP2      PORT_PULL_PULL_UP2_Msk

#define PORT_PULL_PULL_UP3_Pos  19
#define PORT_PULL_PULL_UP3_Msk  (0x1UL << PORT_PULL_PULL_UP3_Pos)
#define PORT_PULL_PULL_UP3      PORT_PULL_PULL_UP3_Msk

#define PORT_PULL_PULL_UP4_Pos  20
#define PORT_PULL_PULL_UP4_Msk  (0x1UL << PORT_PULL_PULL_UP4_Pos)
#define PORT_PULL_PULL_UP4      PORT_PULL_PULL_UP4_Msk

#define PORT_PULL_PULL_UP5_Pos  21
#define PORT_PULL_PULL_UP5_Msk  (0x1UL << PORT_PULL_PULL_UP5_Pos)
#define PORT_PULL_PULL_UP5      PORT_PULL_PULL_UP5_Msk

#define PORT_PULL_PULL_UP6_Pos  22
#define PORT_PULL_PULL_UP6_Msk  (0x1UL << PORT_PULL_PULL_UP6_Pos)
#define PORT_PULL_PULL_UP6      PORT_PULL_PULL_UP6_Msk

#define PORT_PULL_PULL_UP7_Pos  23
#define PORT_PULL_PULL_UP7_Msk  (0x1UL << PORT_PULL_PULL_UP7_Pos)
#define PORT_PULL_PULL_UP7      PORT_PULL_PULL_UP7_Msk

#define PORT_PULL_PULL_UP8_Pos  24
#define PORT_PULL_PULL_UP8_Msk  (0x1UL << PORT_PULL_PULL_UP8_Pos)
#define PORT_PULL_PULL_UP8      PORT_PULL_PULL_UP8_Msk

#define PORT_PULL_PULL_UP9_Pos  25
#define PORT_PULL_PULL_UP9_Msk  (0x1UL << PORT_PULL_PULL_UP9_Pos)
#define PORT_PULL_PULL_UP9      PORT_PULL_PULL_UP9_Msk

#define PORT_PULL_PULL_UP10_Pos 26
#define PORT_PULL_PULL_UP10_Msk (0x1UL << PORT_PULL_PULL_UP10_Pos)
#define PORT_PULL_PULL_UP10     PORT_PULL_PULL_UP10_Msk

#define PORT_PULL_PULL_UP11_Pos 27
#define PORT_PULL_PULL_UP11_Msk (0x1UL << PORT_PULL_PULL_UP11_Pos)
#define PORT_PULL_PULL_UP11     PORT_PULL_PULL_UP11_Msk

#define PORT_PULL_PULL_UP12_Pos 28
#define PORT_PULL_PULL_UP12_Msk (0x1UL << PORT_PULL_PULL_UP12_Pos)
#define PORT_PULL_PULL_UP12     PORT_PULL_PULL_UP12_Msk

#define PORT_PULL_PULL_UP13_Pos 29
#define PORT_PULL_PULL_UP13_Msk (0x1UL << PORT_PULL_PULL_UP13_Pos)
#define PORT_PULL_PULL_UP13     PORT_PULL_PULL_UP13_Msk

#define PORT_PULL_PULL_UP14_Pos 30
#define PORT_PULL_PULL_UP14_Msk (0x1UL << PORT_PULL_PULL_UP14_Pos)
#define PORT_PULL_PULL_UP14     PORT_PULL_PULL_UP14_Msk

#define PORT_PULL_PULL_UP15_Pos 31
#define PORT_PULL_PULL_UP15_Msk (0x1UL << PORT_PULL_PULL_UP15_Pos)
#define PORT_PULL_PULL_UP15     PORT_PULL_PULL_UP15_Msk

#endif

/** @} */ /* End of group MDR32VF0xI_PORT_PULL */

/** @defgroup MDR32VF0xI_PORT_PWR PORT PWR
 * @{
 */

#define PORT_PWR_PWR_Pos   0
#define PORT_PWR_PWR_Msk   (0xFFFFUL << PORT_PWR_PWR_Pos)

#define PORT_PWR_PWR0_Pos  0
#define PORT_PWR_PWR0_Msk  (0x1UL << PORT_PWR_PWR0_Pos)
#define PORT_PWR_PWR0      PORT_PWR_PWR0_Msk

#define PORT_PWR_PWR1_Pos  1
#define PORT_PWR_PWR1_Msk  (0x1UL << PORT_PWR_PWR1_Pos)
#define PORT_PWR_PWR1      PORT_PWR_PWR1_Msk

#define PORT_PWR_PWR2_Pos  2
#define PORT_PWR_PWR2_Msk  (0x1UL << PORT_PWR_PWR2_Pos)
#define PORT_PWR_PWR2      PORT_PWR_PWR2_Msk

#define PORT_PWR_PWR3_Pos  3
#define PORT_PWR_PWR3_Msk  (0x1UL << PORT_PWR_PWR3_Pos)
#define PORT_PWR_PWR3      PORT_PWR_PWR3_Msk

#define PORT_PWR_PWR4_Pos  4
#define PORT_PWR_PWR4_Msk  (0x1UL << PORT_PWR_PWR4_Pos)
#define PORT_PWR_PWR4      PORT_PWR_PWR4_Msk

#define PORT_PWR_PWR5_Pos  5
#define PORT_PWR_PWR5_Msk  (0x1UL << PORT_PWR_PWR5_Pos)
#define PORT_PWR_PWR5      PORT_PWR_PWR5_Msk

#define PORT_PWR_PWR6_Pos  6
#define PORT_PWR_PWR6_Msk  (0x1UL << PORT_PWR_PWR6_Pos)
#define PORT_PWR_PWR6      PORT_PWR_PWR6_Msk

#define PORT_PWR_PWR7_Pos  7
#define PORT_PWR_PWR7_Msk  (0x1UL << PORT_PWR_PWR7_Pos)
#define PORT_PWR_PWR7      PORT_PWR_PWR7_Msk

#define PORT_PWR_PWR8_Pos  8
#define PORT_PWR_PWR8_Msk  (0x1UL << PORT_PWR_PWR8_Pos)
#define PORT_PWR_PWR8      PORT_PWR_PWR8_Msk

#define PORT_PWR_PWR9_Pos  9
#define PORT_PWR_PWR9_Msk  (0x1UL << PORT_PWR_PWR9_Pos)
#define PORT_PWR_PWR9      PORT_PWR_PWR9_Msk

#define PORT_PWR_PWR10_Pos 10
#define PORT_PWR_PWR10_Msk (0x1UL << PORT_PWR_PWR10_Pos)
#define PORT_PWR_PWR10     PORT_PWR_PWR10_Msk

#define PORT_PWR_PWR11_Pos 11
#define PORT_PWR_PWR11_Msk (0x1UL << PORT_PWR_PWR11_Pos)
#define PORT_PWR_PWR11     PORT_PWR_PWR11_Msk

#define PORT_PWR_PWR12_Pos 12
#define PORT_PWR_PWR12_Msk (0x1UL << PORT_PWR_PWR12_Pos)
#define PORT_PWR_PWR12     PORT_PWR_PWR12_Msk

#define PORT_PWR_PWR13_Pos 13
#define PORT_PWR_PWR13_Msk (0x1UL << PORT_PWR_PWR13_Pos)
#define PORT_PWR_PWR13     PORT_PWR_PWR13_Msk

#define PORT_PWR_PWR14_Pos 14
#define PORT_PWR_PWR14_Msk (0x1UL << PORT_PWR_PWR14_Pos)
#define PORT_PWR_PWR14     PORT_PWR_PWR14_Msk

#define PORT_PWR_PWR15_Pos 15
#define PORT_PWR_PWR15_Msk (0x1UL << PORT_PWR_PWR15_Pos)
#define PORT_PWR_PWR15     PORT_PWR_PWR15_Msk

/** @} */ /* End of group MDR32VF0xI_PORT_PWR */

/** @defgroup MDR32VF0xI_PORT_SETTX PORT SETTX
 * @{
 */

#define PORT_SETTX_SETTX_Pos   0
#define PORT_SETTX_SETTX_Msk   (0xFFFFUL << PORT_SETTX_SETTX_Pos)

#define PORT_SETTX_SETTX0_Pos  0
#define PORT_SETTX_SETTX0_Msk  (0x1UL << PORT_SETTX_SETTX0_Pos)
#define PORT_SETTX_SETTX0      PORT_SETTX_SETTX0_Msk

#define PORT_SETTX_SETTX1_Pos  1
#define PORT_SETTX_SETTX1_Msk  (0x1UL << PORT_SETTX_SETTX1_Pos)
#define PORT_SETTX_SETTX1      PORT_SETTX_SETTX1_Msk

#define PORT_SETTX_SETTX2_Pos  2
#define PORT_SETTX_SETTX2_Msk  (0x1UL << PORT_SETTX_SETTX2_Pos)
#define PORT_SETTX_SETTX2      PORT_SETTX_SETTX2_Msk

#define PORT_SETTX_SETTX3_Pos  3
#define PORT_SETTX_SETTX3_Msk  (0x1UL << PORT_SETTX_SETTX3_Pos)
#define PORT_SETTX_SETTX3      PORT_SETTX_SETTX3_Msk

#define PORT_SETTX_SETTX4_Pos  4
#define PORT_SETTX_SETTX4_Msk  (0x1UL << PORT_SETTX_SETTX4_Pos)
#define PORT_SETTX_SETTX4      PORT_SETTX_SETTX4_Msk

#define PORT_SETTX_SETTX5_Pos  5
#define PORT_SETTX_SETTX5_Msk  (0x1UL << PORT_SETTX_SETTX5_Pos)
#define PORT_SETTX_SETTX5      PORT_SETTX_SETTX5_Msk

#define PORT_SETTX_SETTX6_Pos  6
#define PORT_SETTX_SETTX6_Msk  (0x1UL << PORT_SETTX_SETTX6_Pos)
#define PORT_SETTX_SETTX6      PORT_SETTX_SETTX6_Msk

#define PORT_SETTX_SETTX7_Pos  7
#define PORT_SETTX_SETTX7_Msk  (0x1UL << PORT_SETTX_SETTX7_Pos)
#define PORT_SETTX_SETTX7      PORT_SETTX_SETTX7_Msk

