piborisovich/microcontrollers/Milandr/Libraries/CMSIS/MDR32VF0xI/DeviceSupport/inc/MDR32VF0xI.h
#define PORT_SETTX_SETTX8_Pos  8
#define PORT_SETTX_SETTX8_Msk  (0x1UL << PORT_SETTX_SETTX8_Pos)
#define PORT_SETTX_SETTX8      PORT_SETTX_SETTX8_Msk

#define PORT_SETTX_SETTX9_Pos  9
#define PORT_SETTX_SETTX9_Msk  (0x1UL << PORT_SETTX_SETTX9_Pos)
#define PORT_SETTX_SETTX9      PORT_SETTX_SETTX9_Msk

#define PORT_SETTX_SETTX10_Pos 10
#define PORT_SETTX_SETTX10_Msk (0x1UL << PORT_SETTX_SETTX10_Pos)
#define PORT_SETTX_SETTX10     PORT_SETTX_SETTX10_Msk

#define PORT_SETTX_SETTX11_Pos 11
#define PORT_SETTX_SETTX11_Msk (0x1UL << PORT_SETTX_SETTX11_Pos)
#define PORT_SETTX_SETTX11     PORT_SETTX_SETTX11_Msk

#define PORT_SETTX_SETTX12_Pos 12
#define PORT_SETTX_SETTX12_Msk (0x1UL << PORT_SETTX_SETTX12_Pos)
#define PORT_SETTX_SETTX12     PORT_SETTX_SETTX12_Msk

#define PORT_SETTX_SETTX13_Pos 13
#define PORT_SETTX_SETTX13_Msk (0x1UL << PORT_SETTX_SETTX13_Pos)
#define PORT_SETTX_SETTX13     PORT_SETTX_SETTX13_Msk

#define PORT_SETTX_SETTX14_Pos 14
#define PORT_SETTX_SETTX14_Msk (0x1UL << PORT_SETTX_SETTX14_Pos)
#define PORT_SETTX_SETTX14     PORT_SETTX_SETTX14_Msk

#define PORT_SETTX_SETTX15_Pos 15
#define PORT_SETTX_SETTX15_Msk (0x1UL << PORT_SETTX_SETTX15_Pos)
#define PORT_SETTX_SETTX15     PORT_SETTX_SETTX15_Msk

/** @} */ /* End of group MDR32VF0xI_PORT_SETTX */

/** @defgroup MDR32VF0xI_PORT_CLRTX PORT CLRTX
 * @{
 */

#define PORT_CLRTX_CLRTX_Pos   0
#define PORT_CLRTX_CLRTX_Msk   (0xFFFFUL << PORT_CLRTX_CLRTX_Pos)

#define PORT_CLRTX_CLRTX0_Pos  0
#define PORT_CLRTX_CLRTX0_Msk  (0x1UL << PORT_CLRTX_CLRTX0_Pos)
#define PORT_CLRTX_CLRTX0      PORT_CLRTX_CLRTX0_Msk

#define PORT_CLRTX_CLRTX1_Pos  1
#define PORT_CLRTX_CLRTX1_Msk  (0x1UL << PORT_CLRTX_CLRTX1_Pos)
#define PORT_CLRTX_CLRTX1      PORT_CLRTX_CLRTX1_Msk

#define PORT_CLRTX_CLRTX2_Pos  2
#define PORT_CLRTX_CLRTX2_Msk  (0x1UL << PORT_CLRTX_CLRTX2_Pos)
#define PORT_CLRTX_CLRTX2      PORT_CLRTX_CLRTX2_Msk

#define PORT_CLRTX_CLRTX3_Pos  3
#define PORT_CLRTX_CLRTX3_Msk  (0x1UL << PORT_CLRTX_CLRTX3_Pos)
#define PORT_CLRTX_CLRTX3      PORT_CLRTX_CLRTX3_Msk

#define PORT_CLRTX_CLRTX4_Pos  4
#define PORT_CLRTX_CLRTX4_Msk  (0x1UL << PORT_CLRTX_CLRTX4_Pos)
#define PORT_CLRTX_CLRTX4      PORT_CLRTX_CLRTX4_Msk

#define PORT_CLRTX_CLRTX5_Pos  5
#define PORT_CLRTX_CLRTX5_Msk  (0x1UL << PORT_CLRTX_CLRTX5_Pos)
#define PORT_CLRTX_CLRTX5      PORT_CLRTX_CLRTX5_Msk

#define PORT_CLRTX_CLRTX6_Pos  6
#define PORT_CLRTX_CLRTX6_Msk  (0x1UL << PORT_CLRTX_CLRTX6_Pos)
#define PORT_CLRTX_CLRTX6      PORT_CLRTX_CLRTX6_Msk

#define PORT_CLRTX_CLRTX7_Pos  7
#define PORT_CLRTX_CLRTX7_Msk  (0x1UL << PORT_CLRTX_CLRTX7_Pos)
#define PORT_CLRTX_CLRTX7      PORT_CLRTX_CLRTX7_Msk

#define PORT_CLRTX_CLRTX8_Pos  8
#define PORT_CLRTX_CLRTX8_Msk  (0x1UL << PORT_CLRTX_CLRTX8_Pos)
#define PORT_CLRTX_CLRTX8      PORT_CLRTX_CLRTX8_Msk

#define PORT_CLRTX_CLRTX9_Pos  9
#define PORT_CLRTX_CLRTX9_Msk  (0x1UL << PORT_CLRTX_CLRTX9_Pos)
#define PORT_CLRTX_CLRTX9      PORT_CLRTX_CLRTX9_Msk

#define PORT_CLRTX_CLRTX10_Pos 10
#define PORT_CLRTX_CLRTX10_Msk (0x1UL << PORT_CLRTX_CLRTX10_Pos)
#define PORT_CLRTX_CLRTX10     PORT_CLRTX_CLRTX10_Msk

#define PORT_CLRTX_CLRTX11_Pos 11
#define PORT_CLRTX_CLRTX11_Msk (0x1UL << PORT_CLRTX_CLRTX11_Pos)
#define PORT_CLRTX_CLRTX11     PORT_CLRTX_CLRTX11_Msk

#define PORT_CLRTX_CLRTX12_Pos 12
#define PORT_CLRTX_CLRTX12_Msk (0x1UL << PORT_CLRTX_CLRTX12_Pos)
#define PORT_CLRTX_CLRTX12     PORT_CLRTX_CLRTX12_Msk

#define PORT_CLRTX_CLRTX13_Pos 13
#define PORT_CLRTX_CLRTX13_Msk (0x1UL << PORT_CLRTX_CLRTX13_Pos)
#define PORT_CLRTX_CLRTX13     PORT_CLRTX_CLRTX13_Msk

#define PORT_CLRTX_CLRTX14_Pos 14
#define PORT_CLRTX_CLRTX14_Msk (0x1UL << PORT_CLRTX_CLRTX14_Pos)
#define PORT_CLRTX_CLRTX14     PORT_CLRTX_CLRTX14_Msk

#define PORT_CLRTX_CLRTX15_Pos 15
#define PORT_CLRTX_CLRTX15_Msk (0x1UL << PORT_CLRTX_CLRTX15_Pos)
#define PORT_CLRTX_CLRTX15     PORT_CLRTX_CLRTX15_Msk

/** @} */ /* End of group MDR32VF0xI_PORT_CLRTX */

/** @defgroup MDR32VF0xI_PORT_RDTX PORT RDTX
 * @{
 */

#define PORT_RDTX_RDTX_Pos   0
#define PORT_RDTX_RDTX_Msk   (0xFFFFUL << PORT_RDTX_RDTX_Pos)

#define PORT_RDTX_RDTX0_Pos  0
#define PORT_RDTX_RDTX0_Msk  (0x1UL << PORT_RDTX_RDTX0_Pos)
#define PORT_RDTX_RDTX0      PORT_RDTX_RDTX0_Msk

#define PORT_RDTX_RDTX1_Pos  1
#define PORT_RDTX_RDTX1_Msk  (0x1UL << PORT_RDTX_RDTX1_Pos)
#define PORT_RDTX_RDTX1      PORT_RDTX_RDTX1_Msk

#define PORT_RDTX_RDTX2_Pos  2
#define PORT_RDTX_RDTX2_Msk  (0x1UL << PORT_RDTX_RDTX2_Pos)
#define PORT_RDTX_RDTX2      PORT_RDTX_RDTX2_Msk

#define PORT_RDTX_RDTX3_Pos  3
#define PORT_RDTX_RDTX3_Msk  (0x1UL << PORT_RDTX_RDTX3_Pos)
#define PORT_RDTX_RDTX3      PORT_RDTX_RDTX3_Msk

#define PORT_RDTX_RDTX4_Pos  4
#define PORT_RDTX_RDTX4_Msk  (0x1UL << PORT_RDTX_RDTX4_Pos)
#define PORT_RDTX_RDTX4      PORT_RDTX_RDTX4_Msk

#define PORT_RDTX_RDTX5_Pos  5
#define PORT_RDTX_RDTX5_Msk  (0x1UL << PORT_RDTX_RDTX5_Pos)
#define PORT_RDTX_RDTX5      PORT_RDTX_RDTX5_Msk

#define PORT_RDTX_RDTX6_Pos  6
#define PORT_RDTX_RDTX6_Msk  (0x1UL << PORT_RDTX_RDTX6_Pos)
#define PORT_RDTX_RDTX6      PORT_RDTX_RDTX6_Msk

#define PORT_RDTX_RDTX7_Pos  7
#define PORT_RDTX_RDTX7_Msk  (0x1UL << PORT_RDTX_RDTX7_Pos)
#define PORT_RDTX_RDTX7      PORT_RDTX_RDTX7_Msk

#define PORT_RDTX_RDTX8_Pos  8
#define PORT_RDTX_RDTX8_Msk  (0x1UL << PORT_RDTX_RDTX8_Pos)
#define PORT_RDTX_RDTX8      PORT_RDTX_RDTX8_Msk

#define PORT_RDTX_RDTX9_Pos  9
#define PORT_RDTX_RDTX9_Msk  (0x1UL << PORT_RDTX_RDTX9_Pos)
#define PORT_RDTX_RDTX9      PORT_RDTX_RDTX9_Msk

#define PORT_RDTX_RDTX10_Pos 10
#define PORT_RDTX_RDTX10_Msk (0x1UL << PORT_RDTX_RDTX10_Pos)
#define PORT_RDTX_RDTX10     PORT_RDTX_RDTX10_Msk

#define PORT_RDTX_RDTX11_Pos 11
#define PORT_RDTX_RDTX11_Msk (0x1UL << PORT_RDTX_RDTX11_Pos)
#define PORT_RDTX_RDTX11     PORT_RDTX_RDTX11_Msk

#define PORT_RDTX_RDTX12_Pos 12
#define PORT_RDTX_RDTX12_Msk (0x1UL << PORT_RDTX_RDTX12_Pos)
#define PORT_RDTX_RDTX12     PORT_RDTX_RDTX12_Msk

#define PORT_RDTX_RDTX13_Pos 13
#define PORT_RDTX_RDTX13_Msk (0x1UL << PORT_RDTX_RDTX13_Pos)
#define PORT_RDTX_RDTX13     PORT_RDTX_RDTX13_Msk

