piborisovich/microcontrollers/Milandr/Libraries/CMSIS/MDR32VF0xI/DeviceSupport/inc/MDR32VF0xI.h
#define PORT_RDTX_RDTX14_Pos 14
#define PORT_RDTX_RDTX14_Msk (0x1UL << PORT_RDTX_RDTX14_Pos)
#define PORT_RDTX_RDTX14     PORT_RDTX_RDTX14_Msk

#define PORT_RDTX_RDTX15_Pos 15
#define PORT_RDTX_RDTX15_Msk (0x1UL << PORT_RDTX_RDTX15_Pos)
#define PORT_RDTX_RDTX15     PORT_RDTX_RDTX15_Msk

/** @} */ /* End of group MDR32VF0xI_PORT_RDTX */

/** @} */ /* End of group MDR32VF0xI_PORT_Defines */

/** @} */ /* End of group MDR32VF0xI_PORT */

/** @defgroup MDR32VF0xI_CRC MDR_CRC
 * @{
 */

/**
 * @brief MDR32VF0xI CRC control structure.
 */
typedef struct {
    __IO uint32_t CTRL;  /*!<CRC Control Register */
    __IO uint32_t STAT;  /*!<CRC Status Register */
    __O uint32_t  DATAI; /*!<CRC Input Fifo Data Register */
    __IO uint32_t VAL;   /*!<CRC Value Register */
    __IO uint32_t POL;   /*!<CRC Polynomial Register */
} MDR_CRC_TypeDef;

/** @defgroup MDR32VF0xI_CRC_Defines CRC Defines
 * @{
 */

/** @defgroup MDR32VF0xI_CRC_CTRL CRC CTRL
 * @{
 */

#define CRC_CTRL_CRCEN_Pos    0
#define CRC_CTRL_CRCEN_Msk    (0x1UL << CRC_CTRL_CRCEN_Pos)
#define CRC_CTRL_CRCEN        CRC_CTRL_CRCEN_Msk

#define CRC_CTRL_DATAINV_Pos  1
#define CRC_CTRL_DATAINV_Msk  (0x1UL << CRC_CTRL_DATAINV_Pos)
#define CRC_CTRL_DATAINV      CRC_CTRL_DATAINV_Msk

#define CRC_CTRL_DMAEN_Pos    2
#define CRC_CTRL_DMAEN_Msk    (0x1UL << CRC_CTRL_DMAEN_Pos)
#define CRC_CTRL_DMAEN        CRC_CTRL_DMAEN_Msk

#define CRC_CTRL_DLSIZE_Pos   3
#define CRC_CTRL_DLSIZE_Msk   (0x3UL << CRC_CTRL_DLSIZE_Pos)
#define CRC_CTRL_DLSIZE_8BIT  (0x0UL << CRC_CTRL_DLSIZE_Pos)
#define CRC_CTRL_DLSIZE_16BIT (0x1UL << CRC_CTRL_DLSIZE_Pos)
#define CRC_CTRL_DLSIZE_32BIT (0x2UL << CRC_CTRL_DLSIZE_Pos)

#define CRC_CTRL_DCSIZE_Pos   5
#define CRC_CTRL_DCSIZE_Msk   (0x3UL << CRC_CTRL_DCSIZE_Pos)
#define CRC_CTRL_DCSIZE_8BIT  (0x0UL << CRC_CTRL_DCSIZE_Pos)
#define CRC_CTRL_DCSIZE_16BIT (0x1UL << CRC_CTRL_DCSIZE_Pos)
#define CRC_CTRL_DCSIZE_32BIT (0x2UL << CRC_CTRL_DCSIZE_Pos)

/** @} */ /* End of group MDR32VF0xI_CRC_CTRL */

/** @defgroup MDR32VF0xI_CRC_STAT CRC STAT
 * @{
 */

/* Bit field positions: */
#define CRC_STAT_CONVCOMP_Pos  0
#define CRC_STAT_CONVCOMP_Msk  (0x1UL << CRC_STAT_CONVCOMP_Pos)
#define CRC_STAT_CONVCOMP      CRC_STAT_CONVCOMP_Msk

#define CRC_STAT_FIFOFULL_Pos  1
#define CRC_STAT_FIFOFULL_Msk  (0x1UL << CRC_STAT_FIFOFULL_Pos)
#define CRC_STAT_FIFOFULL      CRC_STAT_FIFOFULL_Msk

#define CRC_STAT_FIFOEMPTY_Pos 2
#define CRC_STAT_FIFOEMPTY_Msk (0x1UL << CRC_STAT_FIFOEMPTY_Pos)
#define CRC_STAT_FIFOEMPTY     CRC_STAT_FIFOEMPTY_Msk

#define CRC_STAT_FIFOOVER_Pos  3
#define CRC_STAT_FIFOOVER_Msk  (0x1UL << CRC_STAT_FIFOOVER_Pos)
#define CRC_STAT_FIFOOVER      CRC_STAT_FIFOOVER_Msk

/** @} */ /* End of group MDR32VF0xI_CRC_STAT */

/** @defgroup MDR32VF0xI_CRC_DATAI CRC DATAI
 * @{
 */

#define CRC_DATAI_DATA_IN_Pos 0
#define CRC_DATAI_DATA_IN_Msk (0xFFFFFFFFUL << CRC_DATAI_DATA_IN_Pos)

/** @} */ /* End of group MDR32VF0xI_CRC_DATAI */

/** @defgroup MDR32VF0xI_CRC_VAL CRC VAL
 * @{
 */

#define CRC_VAL_CRCOUT_Pos 0
#define CRC_VAL_CRCOUT_Msk (0xFFFFUL << CRC_VAL_CRCOUT_Pos)

/** @} */ /* End of group MDR32VF0xI_CRC_VAL */

/** @defgroup MDR32VF0xI_CRC_POL CRC POL
 * @{
 */

#define CRC_POL_CRC_POL_Pos 0
#define CRC_POL_CRC_POL_Msk (0x1FFFFUL << CRC_POL_CRC_POL_Pos)

/** @} */ /* End of group MDR32VF0xI_CRC_POL */

/** @} */ /* End of group MDR32VF0xI_CRC_Defines */

/** @} */ /* End of group MDR32VF0xI_CRC */

#if defined(USE_MDR32F02)

/** @defgroup MDR32VF0xI_SENSORS MDR_SENSORS
 * @{
 */

/**
 * @brief MDR32VF0xI SENSORS control structure.
 */
typedef struct {
    __IO uint32_t STATE_REG;  /*!<SENSORS State Register */
    __I uint32_t  REAL_TIME;  /*!<SENSORS Real-Time State Monitoring Register */
    __I uint32_t  RESERVED0;  /*!<Reserved */
    __IO uint32_t INT_MASK;   /*!<SENSORS Interrupt Mask Register */
    __IO uint32_t K_RES_MASK; /*!<SENSORS Key Reset Signal Mask Register */
    __I uint32_t  RESERVED1;  /*!<Reserved */
    __IO uint32_t ENABLE;     /*!<SENSORS Enable Register */
    __IO uint32_t MESH_KEY7;  /*!<SENSORS Active Mesh Key Register 7 (bits [255 ... 224]) */
    __IO uint32_t MESH_KEY6;  /*!<SENSORS Active Mesh Key Register 6 (bits [223 ... 192]) */
    __IO uint32_t MESH_KEY5;  /*!<SENSORS Active Mesh Key Register 5 (bits [191 ... 160]) */
    __IO uint32_t MESH_KEY4;  /*!<SENSORS Active Mesh Key Register 4 (bits [159 ... 128]) */
    __IO uint32_t MESH_KEY3;  /*!<SENSORS Active Mesh Key Register 3 (bits [127 ... 96]) */
    __IO uint32_t MESH_KEY2;  /*!<SENSORS Active Mesh Key Register 2 (bits [95 ... 64]) */
    __IO uint32_t MESH_KEY1;  /*!<SENSORS Active Mesh Key Register 1 (bits [63 ... 32]) */
    __IO uint32_t MESH_KEY0;  /*!<SENSORS Active Mesh Key Register 0 (bits [31 ... 0]) */
    __IO uint32_t MESH_INIT1; /*!<SENSORS Active Mesh Init Value Register 1 (bits [63 ... 32]) */
    __IO uint32_t MESH_INIT0; /*!<SENSORS Active Mesh init value Register 0 (bits [31 ... 0])  */
    __IO uint32_t MESHCNTR;   /*!<SENSORS Active Mesh Control Register */
} MDR_SENSORS_TypeDef;

/** @defgroup MDR32VF0xI_SENSORS_Defines SENSORS Defines
 * @{
 */

/** @defgroup MDR32VF0xI_SENSORS_STATE_REG SENSORS STATE_REG
 * @{
 */

#define SENSORS_STATE_REG_LIGHT_SENSOR_ALARM_Pos 0
#define SENSORS_STATE_REG_LIGHT_SENSOR_ALARM_Msk (0x1UL << SENSORS_STATE_REG_LIGHT_SENSOR_ALARM_Pos)
#define SENSORS_STATE_REG_LIGHT_SENSOR_ALARM     SENSORS_STATE_REG_LIGHT_SENSOR_ALARM_Msk

#define SENSORS_STATE_REG_MESH_EMFI_ALARM1_Pos   1
#define SENSORS_STATE_REG_MESH_EMFI_ALARM1_Msk   (0x1UL << SENSORS_STATE_REG_MESH_EMFI_ALARM1_Pos)
#define SENSORS_STATE_REG_MESH_EMFI_ALARM1       SENSORS_STATE_REG_MESH_EMFI_ALARM1_Msk

#define SENSORS_STATE_REG_MESH_EMFI_ALARM2_Pos   2
#define SENSORS_STATE_REG_MESH_EMFI_ALARM2_Msk   (0x1UL << SENSORS_STATE_REG_MESH_EMFI_ALARM2_Pos)
#define SENSORS_STATE_REG_MESH_EMFI_ALARM2       SENSORS_STATE_REG_MESH_EMFI_ALARM2_Msk

#define SENSORS_STATE_REG_MESH_EMFI_ALARM3_Pos   3
#define SENSORS_STATE_REG_MESH_EMFI_ALARM3_Msk   (0x1UL << SENSORS_STATE_REG_MESH_EMFI_ALARM3_Pos)
#define SENSORS_STATE_REG_MESH_EMFI_ALARM3       SENSORS_STATE_REG_MESH_EMFI_ALARM3_Msk

#define SENSORS_STATE_REG_MESH_ACTIVE_ALARM_Pos  4
#define SENSORS_STATE_REG_MESH_ACTIVE_ALARM_Msk  (0x1UL << SENSORS_STATE_REG_MESH_ACTIVE_ALARM_Pos)
#define SENSORS_STATE_REG_MESH_ACTIVE_ALARM      SENSORS_STATE_REG_MESH_ACTIVE_ALARM_Msk

/** @} */ /* End of group MDR32VF0xI_SENSORS_STATE_REG */

/** @defgroup MDR32VF0xI_SENSORS_REAL_TIME SENSORS REAL_TIME
 * @{
 */

#define SENSORS_REAL_TIME_LIGHT_SENSOR_ALARM_Pos 0
#define SENSORS_REAL_TIME_LIGHT_SENSOR_ALARM_Msk (0x1UL << SENSORS_REAL_TIME_LIGHT_SENSOR_ALARM_Pos)
#define SENSORS_REAL_TIME_LIGHT_SENSOR_ALARM     SENSORS_REAL_TIME_LIGHT_SENSOR_ALARM_Msk

#define SENSORS_REAL_TIME_MESH_EMFI_ALARM1_Pos   1
#define SENSORS_REAL_TIME_MESH_EMFI_ALARM1_Msk   (0x1UL << SENSORS_REAL_TIME_MESH_EMFI_ALARM1_Pos)
#define SENSORS_REAL_TIME_MESH_EMFI_ALARM1       SENSORS_REAL_TIME_MESH_EMFI_ALARM1_Msk

#define SENSORS_REAL_TIME_MESH_EMFI_ALARM2_Pos   2
#define SENSORS_REAL_TIME_MESH_EMFI_ALARM2_Msk   (0x1UL << SENSORS_REAL_TIME_MESH_EMFI_ALARM2_Pos)
#define SENSORS_REAL_TIME_MESH_EMFI_ALARM2       SENSORS_REAL_TIME_MESH_EMFI_ALARM2_Msk

#define SENSORS_REAL_TIME_MESH_EMFI_ALARM3_Pos   3
#define SENSORS_REAL_TIME_MESH_EMFI_ALARM3_Msk   (0x1UL << SENSORS_REAL_TIME_MESH_EMFI_ALARM3_Pos)
#define SENSORS_REAL_TIME_MESH_EMFI_ALARM3       SENSORS_REAL_TIME_MESH_EMFI_ALARM3_Msk

#define SENSORS_REAL_TIME_MESH_ACTIVE_ALARM_Pos  4
#define SENSORS_REAL_TIME_MESH_ACTIVE_ALARM_Msk  (0x1UL << SENSORS_REAL_TIME_MESH_ACTIVE_ALARM_Pos)
#define SENSORS_REAL_TIME_MESH_ACTIVE_ALARM      SENSORS_REAL_TIME_MESH_ACTIVE_ALARM_Msk

/** @} */ /* End of group MDR32VF0xI_SENSORS_REAL_TIME */

/** @defgroup MDR32VF0xI_SENSORS_INT_MASK SENSORS INT_MASK
 * @{
 */

#define SENSORS_INT_MASK_LIGHT_SENSOR_ALARM_Pos 0
#define SENSORS_INT_MASK_LIGHT_SENSOR_ALARM_Msk (0x1UL << SENSORS_INT_MASK_LIGHT_SENSOR_ALARM_Pos)
#define SENSORS_INT_MASK_LIGHT_SENSOR_ALARM     SENSORS_INT_MASK_LIGHT_SENSOR_ALARM_Msk

#define SENSORS_INT_MASK_MESH_EMFI_ALARM1_Pos   1
#define SENSORS_INT_MASK_MESH_EMFI_ALARM1_Msk   (0x1UL << SENSORS_INT_MASK_MESH_EMFI_ALARM1_Pos)
#define SENSORS_INT_MASK_MESH_EMFI_ALARM1       SENSORS_INT_MASK_MESH_EMFI_ALARM1_Msk

#define SENSORS_INT_MASK_MESH_EMFI_ALARM2_Pos   2
#define SENSORS_INT_MASK_MESH_EMFI_ALARM2_Msk   (0x1UL << SENSORS_INT_MASK_MESH_EMFI_ALARM2_Pos)
#define SENSORS_INT_MASK_MESH_EMFI_ALARM2       SENSORS_INT_MASK_MESH_EMFI_ALARM2_Msk

#define SENSORS_INT_MASK_MESH_EMFI_ALARM3_Pos   3
#define SENSORS_INT_MASK_MESH_EMFI_ALARM3_Msk   (0x1UL << SENSORS_INT_MASK_MESH_EMFI_ALARM3_Pos)
#define SENSORS_INT_MASK_MESH_EMFI_ALARM3       SENSORS_INT_MASK_MESH_EMFI_ALARM3_Msk

#define SENSORS_INT_MASK_MESH_ACTIVE_ALARM_Pos  4
#define SENSORS_INT_MASK_MESH_ACTIVE_ALARM_Msk  (0x1UL << SENSORS_INT_MASK_MESH_ACTIVE_ALARM_Pos)
#define SENSORS_INT_MASK_MESH_ACTIVE_ALARM      SENSORS_INT_MASK_MESH_ACTIVE_ALARM_Msk

