piborisovich/microcontrollers/Milandr/Libraries/CMSIS/MDR32VF0xI/DeviceSupport/inc/MDR32VF0xI.h
/** @} */ /* End of group MDR32VF0xI_SENSORS_INT_MASK */

/** @defgroup MDR32VF0xI_SENSORS_K_RES_MASK SENSORS K_RES_MASK
 * @{
 */

#define SENSORS_K_RES_MASK_LIGHT_SENSOR_ALARM_Pos 0
#define SENSORS_K_RES_MASK_LIGHT_SENSOR_ALARM_Msk (0x1UL << SENSORS_K_RES_MASK_LIGHT_SENSOR_ALARM_Pos)
#define SENSORS_K_RES_MASK_LIGHT_SENSOR_ALARM     SENSORS_K_RES_MASK_LIGHT_SENSOR_ALARM_Msk

#define SENSORS_K_RES_MASK_MESH_EMFI_ALARM1_Pos   1
#define SENSORS_K_RES_MASK_MESH_EMFI_ALARM1_Msk   (0x1UL << SENSORS_K_RES_MASK_MESH_EMFI_ALARM1_Pos)
#define SENSORS_K_RES_MASK_MESH_EMFI_ALARM1       SENSORS_K_RES_MASK_MESH_EMFI_ALARM1_Msk

#define SENSORS_K_RES_MASK_MESH_EMFI_ALARM2_Pos   2
#define SENSORS_K_RES_MASK_MESH_EMFI_ALARM2_Msk   (0x1UL << SENSORS_K_RES_MASK_MESH_EMFI_ALARM2_Pos)
#define SENSORS_K_RES_MASK_MESH_EMFI_ALARM2       SENSORS_K_RES_MASK_MESH_EMFI_ALARM2_Msk

#define SENSORS_K_RES_MASK_MESH_EMFI_ALARM3_Pos   3
#define SENSORS_K_RES_MASK_MESH_EMFI_ALARM3_Msk   (0x1UL << SENSORS_K_RES_MASK_MESH_EMFI_ALARM3_Pos)
#define SENSORS_K_RES_MASK_MESH_EMFI_ALARM3       SENSORS_K_RES_MASK_MESH_EMFI_ALARM3_Msk

#define SENSORS_K_RES_MASK_MESH_ACTIVE_ALARM_Pos  4
#define SENSORS_K_RES_MASK_MESH_ACTIVE_ALARM_Msk  (0x1UL << SENSORS_K_RES_MASK_MESH_ACTIVE_ALARM_Pos)
#define SENSORS_K_RES_MASK_MESH_ACTIVE_ALARM      SENSORS_K_RES_MASK_MESH_ACTIVE_ALARM_Msk

/** @} */ /* End of group MDR32VF0xI_SENSORS_K_RES_MASK */

/** @defgroup MDR32VF0xI_SENSORS_ENABLE SENSORS ENABLE
 * @{
 */

#define SENSORS_ENABLE_LIGHT_SENSOR_ALARM_Pos 0
#define SENSORS_ENABLE_LIGHT_SENSOR_ALARM_Msk (0x1UL << SENSORS_ENABLE_LIGHT_SENSOR_ALARM_Pos)
#define SENSORS_ENABLE_LIGHT_SENSOR_ALARM     SENSORS_ENABLE_LIGHT_SENSOR_ALARM_Msk

#define SENSORS_ENABLE_MESH_EMFI_ALARM1_Pos   1
#define SENSORS_ENABLE_MESH_EMFI_ALARM1_Msk   (0x1UL << SENSORS_ENABLE_MESH_EMFI_ALARM1_Pos)
#define SENSORS_ENABLE_MESH_EMFI_ALARM1       SENSORS_ENABLE_MESH_EMFI_ALARM1_Msk

#define SENSORS_ENABLE_MESH_EMFI_ALARM2_Pos   2
#define SENSORS_ENABLE_MESH_EMFI_ALARM2_Msk   (0x1UL << SENSORS_ENABLE_MESH_EMFI_ALARM2_Pos)
#define SENSORS_ENABLE_MESH_EMFI_ALARM2       SENSORS_ENABLE_MESH_EMFI_ALARM2_Msk

#define SENSORS_ENABLE_MESH_EMFI_ALARM3_Pos   3
#define SENSORS_ENABLE_MESH_EMFI_ALARM3_Msk   (0x1UL << SENSORS_ENABLE_MESH_EMFI_ALARM3_Pos)
#define SENSORS_ENABLE_MESH_EMFI_ALARM3       SENSORS_ENABLE_MESH_EMFI_ALARM3_Msk

#define SENSORS_ENABLE_MESH_ACTIVE_ALARM_Pos  4
#define SENSORS_ENABLE_MESH_ACTIVE_ALARM_Msk  (0x1UL << SENSORS_ENABLE_MESH_ACTIVE_ALARM_Pos)
#define SENSORS_ENABLE_MESH_ACTIVE_ALARM      SENSORS_ENABLE_MESH_ACTIVE_ALARM_Msk

/** @} */ /* End of group MDR32VF0xI_SENSORS_ENABLE */

/** @defgroup MDR32VF0xI_SENSORS_MESHCNTR SENSORS ENABLE
 * @{
 */

#define SENSORS_MESHCNTR_MESH_CLK_DIV_Pos 0
#define SENSORS_MESHCNTR_MESH_CLK_DIV_Msk (0x7UL << SENSORS_MESHCNTR_MESH_CLK_DIV_Pos)
#define SENSORS_MESHCNTR_MESH_CLK_DIV_3   (0x0UL << SENSORS_MESHCNTR_MESH_CLK_DIV_Pos)
#define SENSORS_MESHCNTR_MESH_CLK_DIV_4   (0x1UL << SENSORS_MESHCNTR_MESH_CLK_DIV_Pos)
#define SENSORS_MESHCNTR_MESH_CLK_DIV_8   (0x2UL << SENSORS_MESHCNTR_MESH_CLK_DIV_Pos)
#define SENSORS_MESHCNTR_MESH_CLK_DIV_16  (0x3UL << SENSORS_MESHCNTR_MESH_CLK_DIV_Pos)
#define SENSORS_MESHCNTR_MESH_CLK_DIV_32  (0x4UL << SENSORS_MESHCNTR_MESH_CLK_DIV_Pos)
#define SENSORS_MESHCNTR_MESH_CLK_DIV_64  (0x5UL << SENSORS_MESHCNTR_MESH_CLK_DIV_Pos)
#define SENSORS_MESHCNTR_MESH_CLK_DIV_128 (0x6UL << SENSORS_MESHCNTR_MESH_CLK_DIV_Pos)
#define SENSORS_MESHCNTR_MESH_CLK_DIV_265 (0x7UL << SENSORS_MESHCNTR_MESH_CLK_DIV_Pos)

/** @} */ /* End of group MDR32VF0xI_SENSORS_MESHCNTR */

/** @} */ /* End of group MDR32VF0xI_SENSORS_Defines */

/** @} */ /* End of group MDR32VF0xI_SENSORS */

/** @defgroup MDR32VF0xI_CLK_MEASURE MDR_CLK_MEASURE
 * @{
 */

/**
 * @brief MDR32VF0xI CLK_MEASURE control structure.
 */
typedef struct {
    __IO uint32_t CNTR_STAT;       /*!<CLK_MEASURE State and Control Register */
    __IO uint32_t ALARM_SHIFT_RST; /*!<CLK_MEASURE Alarm Threshold Register for Key Reset */
    __IO uint32_t ALARM_SHIFT_INT; /*!<CLK_MEASURE Alarm Threshold Register for Interrupt Generation */
    __IO uint32_t ALARM_PREG_0;    /*!<CLK_MEASURE Counters Reset Setup Register */
    __IO uint32_t ALARM_PREG_1;    /*!<CLK_MEASURE Counters Reset Setup Register */
    __IO uint32_t STAT;            /*!<CLK_MEASURE SHIFT_REG Max Value Register */
} MDR_CLK_MEASURE_TypeDef;

/** @defgroup MDR32VF0xI_CLK_MEASURE_Defines CLK_MEASURE Defines
 * @{
 */

/** @defgroup MDR32VF0xI_CLK_MEASURE_CNTR_STAT CLK_MEASURE CNTR_STAT
 * @{
 */

#define CLK_MEASURE_CNTR_STAT_EN_Pos        0
#define CLK_MEASURE_CNTR_STAT_EN_Msk        (0x1UL << CLK_MEASURE_CNTR_STAT_EN_Pos)
#define CLK_MEASURE_CNTR_STAT_EN            CLK_MEASURE_CNTR_STAT_EN_Msk

#define CLK_MEASURE_CNTR_STAT_INTERRUPT_Pos 4
#define CLK_MEASURE_CNTR_STAT_INTERRUPT_Msk (0x1UL << CLK_MEASURE_CNTR_STAT_INTERRUPT_Pos)
#define CLK_MEASURE_CNTR_STAT_INTERRUPT     CLK_MEASURE_CNTR_STAT_INTERRUPT_Msk

#define CLK_MEASURE_CNTR_STAT_KEY_RESET_Pos 5
#define CLK_MEASURE_CNTR_STAT_KEY_RESET_Msk (0x1UL << CLK_MEASURE_CNTR_STAT_KEY_RESET_Pos)
#define CLK_MEASURE_CNTR_STAT_KEY_RESET     CLK_MEASURE_CNTR_STAT_KEY_RESET_Msk

/** @} */ /* End of group MDR32VF0xI_CLK_MEASURE_CNTR_STAT */

/** @defgroup MDR32VF0xI_CLK_MEASURE_ALARM_SHIFT_RST CLK_MEASURE ALARM_SHIFT_RST
 * @{
 */

#define CLK_MEASURE_ALARM_SHIFT_RST_BASE_REG0_Pos 0
#define CLK_MEASURE_ALARM_SHIFT_RST_BASE_REG0_Msk (0xFFFFUL << CLK_MEASURE_ALARM_SHIFT_RST_BASE_REG0_Pos)

#define CLK_MEASURE_ALARM_SHIFT_RST_BASE_REG2_Pos 16
#define CLK_MEASURE_ALARM_SHIFT_RST_BASE_REG2_Msk (0xFFFFUL << CLK_MEASURE_ALARM_SHIFT_RST_BASE_REG2_Pos)

/** @} */ /* End of group MDR32VF0xI_CLK_MEASURE_ALARM_SHIFT_RST */

/** @defgroup MDR32VF0xI_CLK_MEASURE_ALARM_SHIFT_INT CLK_MEASURE ALARM_SHIFT_INT
 * @{
 */

#define CLK_MEASURE_ALARM_SHIFT_INT_BASE_REG1_Pos 0
#define CLK_MEASURE_ALARM_SHIFT_INT_BASE_REG1_Msk (0xFFFFUL << CLK_MEASURE_ALARM_SHIFT_INT_BASE_REG1_Pos)

#define CLK_MEASURE_ALARM_SHIFT_INT_BASE_REG3_Pos 16
#define CLK_MEASURE_ALARM_SHIFT_INT_BASE_REG3_Msk (0xFFFFUL << CLK_MEASURE_ALARM_SHIFT_INT_BASE_REG3_Pos)

/** @} */ /* End of group MDR32VF0xI_CLK_MEASURE_ALARM_SHIFT_INT */

/** @defgroup MDR32VF0xI_CLK_MEASURE_ALARM_PREG_0 CLK_MEASURE ALARM_PREG_0
 * @{
 */

