piborisovich/microcontrollers/Milandr/Libraries/CMSIS/MDR32VF0xI/DeviceSupport/inc/MDR32VF0xI.h
#define CLK_MEASURE_ALARM_PREG_0_PREG1_Pos 0
#define CLK_MEASURE_ALARM_PREG_0_PREG1_Msk (0xFFFFUL << CLK_MEASURE_ALARM_PREG_0_PREG1_Pos)

#define CLK_MEASURE_ALARM_PREG_0_PREG0_Pos 16
#define CLK_MEASURE_ALARM_PREG_0_PREG0_Msk (0xFFFFUL << CLK_MEASURE_ALARM_PREG_0_PREG0_Pos)

/** @} */ /* End of group MDR32VF0xI_CLK_MEASURE_ALARM_PREG_0 */

/** @defgroup MDR32VF0xI_CLK_MEASURE_ALARM_PREG_1 CLK_MEASURE ALARM_PREG_1
 * @{
 */

#define CLK_MEASURE_ALARM_PREG_1_PREG3_Pos 0
#define CLK_MEASURE_ALARM_PREG_1_PREG3_Msk (0xFFFFUL << CLK_MEASURE_ALARM_PREG_1_PREG3_Pos)

#define CLK_MEASURE_ALARM_PREG_1_PREG2_Pos 16
#define CLK_MEASURE_ALARM_PREG_1_PREG2_Msk (0xFFFFUL << CLK_MEASURE_ALARM_PREG_1_PREG2_Pos)

/** @} */ /* End of group MDR32VF0xI_CLK_MEASURE_ALARM_PREG_1 */

/** @defgroup MDR32VF0xI_CLK_MEASURE_STAT CLK_MEASURE STAT
 * @{
 */

#define CLK_MEASURE_STAT_MAX_SHIFT1_Pos 0
#define CLK_MEASURE_STAT_MAX_SHIFT1_Msk (0xFFFFUL << CLK_MEASURE_STAT_MAX_SHIFT1_Pos)

#define CLK_MEASURE_STAT_MAX_SHIFT0_Pos 16
#define CLK_MEASURE_STAT_MAX_SHIFT0_Msk (0xFFFFUL << CLK_MEASURE_STAT_MAX_SHIFT0_Pos)

/** @} */ /* End of group MDR32VF0xI_CLK_MEASURE_STAT */

/** @} */ /* End of group MDR32VF0xI_CLK_MEASURE_Defines */

/** @} */ /* End of group MDR32VF0xI_CLK_MEASURE */

#endif

/** @defgroup MDR32VF0xI_RANDOM MDR_RANDOM
 * @{
 */

/**
 * @brief MDR32VF0xI RANDOM control structure.
 */
typedef struct {
    __IO uint32_t STAT_CTRL; /*!<RANDOM State and Control Register */
    __IO uint32_t INT_CTRL;  /*!<RANDOM Interrupt Control Register */
    __IO uint32_t CLK_DIV;   /*!<RANDOM Clock Prescaler Register */
    __IO uint32_t PAUSE;     /*!<RANDOM Startup Pause Register */
    __I uint32_t  OUTPUT;    /*!<RANDOM Value Register */
    __I uint32_t  PAUSE_CNT; /*!<RANDOM Pause Counter Register */
    __I uint32_t  TEMP;      /*!<RANDOM Temporary Value Register */
} MDR_RANDOM_TypeDef;

/** @defgroup MDR32VF0xI_RANDOM_Defines RANDOM Defines
 * @{
 */

/** @defgroup MDR32VF0xI_RANDOM_STAT_CTRL RANDOM STAT_CTRL
 * @{
 */

#define RANDOM_STAT_CTRL_EN_STATE_Pos            1
#define RANDOM_STAT_CTRL_EN_STATE_Msk            (0x1UL << RANDOM_STAT_CTRL_EN_STATE_Pos)
#define RANDOM_STAT_CTRL_EN_STATE                RANDOM_STAT_CTRL_EN_STATE_Msk

#define RANDOM_STAT_CTRL_BUSY_Pos                2
#define RANDOM_STAT_CTRL_BUSY_Msk                (0x1UL << RANDOM_STAT_CTRL_BUSY_Pos)
#define RANDOM_STAT_CTRL_BUSY                    RANDOM_STAT_CTRL_BUSY_Msk

#define RANDOM_STAT_CTRL_UNREAD_DATA_Pos         3
#define RANDOM_STAT_CTRL_UNREAD_DATA_Msk         (0x1UL << RANDOM_STAT_CTRL_UNREAD_DATA_Pos)
#define RANDOM_STAT_CTRL_UNREAD_DATA             RANDOM_STAT_CTRL_UNREAD_DATA_Msk

#define RANDOM_STAT_CTRL_MASK_Pos                4
#define RANDOM_STAT_CTRL_MASK_Msk                (0x3UL << RANDOM_STAT_CTRL_MASK_Pos)
#define RANDOM_STAT_CTRL_MASK_GEN0               (0x1UL << RANDOM_STAT_CTRL_MASK_Pos)
#define RANDOM_STAT_CTRL_MASK_GEN1               (0x2UL << RANDOM_STAT_CTRL_MASK_Pos)

#define RANDOM_STAT_CTRL_WORK_MODE_Pos           8
#define RANDOM_STAT_CTRL_WORK_MODE_Msk           (0x3UL << RANDOM_STAT_CTRL_WORK_MODE_Pos)
#define RANDOM_STAT_CTRL_WORK_MODE_STOP          (0x0UL << RANDOM_STAT_CTRL_WORK_MODE_Pos)
#define RANDOM_STAT_CTRL_WORK_MODE_SINGLE        (0x1UL << RANDOM_STAT_CTRL_WORK_MODE_Pos)
#define RANDOM_STAT_CTRL_WORK_MODE_START_ON_READ (0x2UL << RANDOM_STAT_CTRL_WORK_MODE_Pos)
#define RANDOM_STAT_CTRL_WORK_MODE_CONTINUOUS    (0x3UL << RANDOM_STAT_CTRL_WORK_MODE_Pos)

#define RANDOM_STAT_CTRL_BIT_CNT_Pos             12
#define RANDOM_STAT_CTRL_BIT_CNT_Msk             (0x3FUL << RANDOM_STAT_CTRL_BIT_CNT_Pos)

/** @} */ /* End of group MDR32VF0xI_RANDOM_STAT_CTRL */

/** @defgroup MDR32VF0xI_RANDOM_INT_CTRL RANDOM INT_CTRL
 * @{
 */

#define RANDOM_INT_CTRL_INT_EN_Pos      0
#define RANDOM_INT_CTRL_INT_EN_Msk      (0x1UL << RANDOM_INT_CTRL_INT_EN_Pos)
#define RANDOM_INT_CTRL_INT_EN          RANDOM_INT_CTRL_INT_EN_Msk

#define RANDOM_INT_CTRL_UNREAD_DATA_Pos 1
#define RANDOM_INT_CTRL_UNREAD_DATA_Msk (0x1UL << RANDOM_INT_CTRL_UNREAD_DATA_Pos)
#define RANDOM_INT_CTRL_UNREAD_DATA     RANDOM_INT_CTRL_UNREAD_DATA_Msk

/** @} */ /* End of group MDR32VF0xI_RANDOM_INT_CTRL */

/** @defgroup MDR32VF0xI_RANDOM_CLK_DIV RANDOM CLK_DIV
 * @{
 */

#define RANDOM_CLK_DIV_DIV_Pos 0
#define RANDOM_CLK_DIV_DIV_Msk (0xFFFFUL << RANDOM_CLK_DIV_DIV_Pos)

/** @} */ /* End of group MDR32VF0xI_RANDOM_CLK_DIV */

/** @defgroup MDR32VF0xI_RANDOM_PAUSE RANDOM PAUSE
 * @{
 */

#define RANDOM_PAUSE_PAUSE_Pos 0
#define RANDOM_PAUSE_PAUSE_Msk (0xFFFFFFFFUL << RANDOM_PAUSE_PAUSE_Pos)

/** @} */ /* End of group MDR32VF0xI_RANDOM_PAUSE */

/** @defgroup MDR32VF0xI_RANDOM_OUTPUT RANDOM OUTPUT
 * @{
 */

#define RANDOM_OUTPUT_DATA_Pos 0
#define RANDOM_OUTPUT_DATA_Msk (0xFFFFFFFFUL << RANDOM_OUTPUT_DATA_Pos)

/** @} */ /* End of group MDR32VF0xI_RANDOM_OUTPUT */

/** @defgroup MDR32VF0xI_RANDOM_PAUSE_CNT RANDOM PAUSE_CNT
 * @{
 */

#define RANDOM_PAUSE_CNT_CUR_PAUSE_Pos 0
#define RANDOM_PAUSE_CNT_CUR_PAUSE_Msk (0xFFFFFFFFUL << RANDOM_PAUSE_CNT_CUR_PAUSE_Pos)

/** @} */ /* End of group MDR32VF0xI_RANDOM_PAUSE_CNT */

/** @defgroup MDR32VF0xI_RANDOM_TEMP RANDOM TEMP
 * @{
 */

#define RANDOM_TEMP_TEMP_DATA_Pos 0
#define RANDOM_TEMP_TEMP_DATA_Msk (0xFFFFFFFFUL << RANDOM_TEMP_TEMP_DATA_Pos)

/** @} */ /* End of group MDR32VF0xI_RANDOM_TEMP */

/** @} */ /* End of group MDR32VF0xI_RANDOM_Defines */

/** @} */ /* End of group MDR32VF0xI_RANDOM */

/** @defgroup MDR32VF0xI_USART MDR_USART
 * @{
 */

/**
 * @brief MDR32VF0xI USART control structure.
 */
typedef struct {
    __IO uint32_t SR;   /*!<USART Status Register */
    __IO uint32_t DR;   /*!<USART Data Register */
    __IO uint32_t BRR;  /*!<USART Baud Rate Control Register */
    __IO uint32_t CR1;  /*!<USART Control1 Register */
    __IO uint32_t CR2;  /*!<USART Control2 Register */
    __IO uint32_t CR3;  /*!<USART Control3 Register */
    __IO uint32_t GTPR; /*!<USART Guard Time and Prescaler Register */
} MDR_USART_TypeDef;

