piborisovich/microcontrollers/Milandr/Libraries/CMSIS/MDR32VF0xI/DeviceSupport/inc/MDR32VF0xI.h
/** @defgroup MDR32VF0xI_USART_Defines USART Defines
 * @{
 */

/** @defgroup MDR32VF0xI_USART_SR USART SR
 * @{
 */

#define USART_SR_PE_Pos   0
#define USART_SR_PE_Msk   (0x1UL << USART_SR_PE_Pos)
#define USART_SR_PE       USART_SR_PE_Msk

#define USART_SR_FE_Pos   1
#define USART_SR_FE_Msk   (0x1UL << USART_SR_FE_Pos)
#define USART_SR_FE       USART_SR_FE_Msk

#define USART_SR_NF_Pos   2
#define USART_SR_NF_Msk   (0x1UL << USART_SR_NF_Pos)
#define USART_SR_NF       USART_SR_NF_Msk

#define USART_SR_ORE_Pos  3
#define USART_SR_ORE_Msk  (0x1UL << USART_SR_ORE_Pos)
#define USART_SR_ORE      USART_SR_ORE_Msk

#define USART_SR_IDLE_Pos 4
#define USART_SR_IDLE_Msk (0x1UL << USART_SR_IDLE_Pos)
#define USART_SR_IDLE     USART_SR_IDLE_Msk

#define USART_SR_RXNE_Pos 5
#define USART_SR_RXNE_Msk (0x1UL << USART_SR_RXNE_Pos)
#define USART_SR_RXNE     USART_SR_RXNE_Msk

#define USART_SR_TC_Pos   6
#define USART_SR_TC_Msk   (0x1UL << USART_SR_TC_Pos)
#define USART_SR_TC       USART_SR_TC_Msk

#define USART_SR_TXE_Pos  7
#define USART_SR_TXE_Msk  (0x1UL << USART_SR_TXE_Pos)
#define USART_SR_TXE      USART_SR_TXE_Msk

#define USART_SR_CTS_Pos  9
#define USART_SR_CTS_Msk  (0x1UL << USART_SR_CTS_Pos)
#define USART_SR_CTS      USART_SR_CTS_Msk

/** @} */ /* End of group MDR32VF0xI_USART_SR */

/** @defgroup MDR32VF0xI_USART_DR USART DR
 * @{
 */

#define USART_DR_DR_Pos 0
#define USART_DR_DR_Msk (0x1FFUL << USART_DR_DR_Pos)

/** @} */ /* End of group MDR32VF0xI_USART_DR */

/** @defgroup MDR32VF0xI_USART_BRR USART BRR
 * @{
 */

#define USART_BRR_DIV_FRACTION_Pos 0
#define USART_BRR_DIV_FRACTION_Msk (0xFUL << USART_BRR_DIV_FRACTION_Pos)

#define USART_BRR_DIV_MANTISSA_Pos 4
#define USART_BRR_DIV_MANTISSA_Msk (0xFFFUL << USART_BRR_DIV_MANTISSA_Pos)

/** @} */ /* End of group MDR32VF0xI_USART_BRR */

/** @defgroup MDR32VF0xI_USART_CR1 USART CR1
 * @{
 */

#define USART_CR1_SBK_Pos    0
#define USART_CR1_SBK_Msk    (0x1UL << USART_CR1_SBK_Pos)
#define USART_CR1_SBK        USART_CR1_SBK_Msk

#define USART_CR1_RWU_Pos    1
#define USART_CR1_RWU_Msk    (0x1UL << USART_CR1_RWU_Pos)
#define USART_CR1_RWU        USART_CR1_RWU_Msk

#define USART_CR1_RE_Pos     2
#define USART_CR1_RE_Msk     (0x1UL << USART_CR1_RE_Pos)
#define USART_CR1_RE         USART_CR1_RE_Msk

#define USART_CR1_TE_Pos     3
#define USART_CR1_TE_Msk     (0x1UL << USART_CR1_TE_Pos)
#define USART_CR1_TE         USART_CR1_TE_Msk

#define USART_CR1_IDLEIE_Pos 4
#define USART_CR1_IDLEIE_Msk (0x1UL << USART_CR1_IDLEIE_Pos)
#define USART_CR1_IDLEIE     USART_CR1_IDLEIE_Msk

#define USART_CR1_RXNEIE_Pos 5
#define USART_CR1_RXNEIE_Msk (0x1UL << USART_CR1_RXNEIE_Pos)
#define USART_CR1_RXNEIE     USART_CR1_RXNEIE_Msk

#define USART_CR1_TCIE_Pos   6
#define USART_CR1_TCIE_Msk   (0x1UL << USART_CR1_TCIE_Pos)
#define USART_CR1_TCIE       USART_CR1_TCIE_Msk

#define USART_CR1_TXEIE_Pos  7
#define USART_CR1_TXEIE_Msk  (0x1UL << USART_CR1_TXEIE_Pos)
#define USART_CR1_TXEIE      USART_CR1_TXEIE_Msk

#define USART_CR1_PEIE_Pos   8
#define USART_CR1_PEIE_Msk   (0x1UL << USART_CR1_PEIE_Pos)
#define USART_CR1_PEIE       USART_CR1_PEIE_Msk

#define USART_CR1_PS_Pos     9
#define USART_CR1_PS_Msk     (0x1UL << USART_CR1_PS_Pos)
#define USART_CR1_PS         USART_CR1_PS_Msk

#define USART_CR1_PCE_Pos    10
#define USART_CR1_PCE_Msk    (0x1UL << USART_CR1_PCE_Pos)
#define USART_CR1_PCE        USART_CR1_PCE_Msk

#define USART_CR1_WAKE_Pos   11
#define USART_CR1_WAKE_Msk   (0x1UL << USART_CR1_WAKE_Pos)
#define USART_CR1_WAKE       USART_CR1_WAKE_Msk

#define USART_CR1_M_Pos      12
#define USART_CR1_M_Msk      (0x1UL << USART_CR1_M_Pos)
#define USART_CR1_M          USART_CR1_M_Msk

#define USART_CR1_UE_Pos     13
#define USART_CR1_UE_Msk     (0x1UL << USART_CR1_UE_Pos)
#define USART_CR1_UE         USART_CR1_UE_Msk

#define USART_CR1_OVER8_Pos  15
#define USART_CR1_OVER8_Msk  (0x1UL << USART_CR1_OVER8_Pos)
#define USART_CR1_OVER8      USART_CR1_OVER8_Msk

/** @} */ /* End of group MDR32VF0xI_USART_CR1 */

/** @defgroup MDR32VF0xI_USART_CR2 USART CR2
 * @{
 */

#define USART_CR2_ADD_Pos   0
#define USART_CR2_ADD_Msk   (0xFUL << USART_CR2_ADD_Pos)

#define USART_CR2_LBCL_Pos  8
#define USART_CR2_LBCL_Msk  (0x1UL << USART_CR2_LBCL_Pos)
#define USART_CR2_LBCL      USART_CR2_LBCL_Msk

#define USART_CR2_CPHA_Pos  9
#define USART_CR2_CPHA_Msk  (0x1UL << USART_CR2_CPHA_Pos)
#define USART_CR2_CPHA      USART_CR2_CPHA_Msk

#define USART_CR2_CPOL_Pos  10
#define USART_CR2_CPOL_Msk  (0x1UL << USART_CR2_CPOL_Pos)
#define USART_CR2_CPOL      USART_CR2_CPOL_Msk

#define USART_CR2_CLKEN_Pos 11
#define USART_CR2_CLKEN_Msk (0x1UL << USART_CR2_CLKEN_Pos)
#define USART_CR2_CLKEN     USART_CR2_CLKEN_Msk

#define USART_CR2_STOP_Pos  12
#define USART_CR2_STOP_Msk  (0x3UL << USART_CR2_STOP_Pos)

/** @} */ /* End of group MDR32VF0xI_USART_CR2 */

/** @defgroup MDR32VF0xI_USART_CR3 USART CR3
 * @{
 */

#define USART_CR3_EIE_Pos    0
#define USART_CR3_EIE_Msk    (0x1UL << USART_CR3_EIE_Pos)
#define USART_CR3_EIE        USART_CR3_EIE_Msk

#define USART_CR3_HDSEL_Pos  3
#define USART_CR3_HDSEL_Msk  (0x1UL << USART_CR3_HDSEL_Pos)
#define USART_CR3_HDSEL      USART_CR3_HDSEL_Msk

#define USART_CR3_NACK_Pos   4
#define USART_CR3_NACK_Msk   (0x1UL << USART_CR3_NACK_Pos)
#define USART_CR3_NACK       USART_CR3_NACK_Msk

#define USART_CR3_SCEN_Pos   5
#define USART_CR3_SCEN_Msk   (0x1UL << USART_CR3_SCEN_Pos)
#define USART_CR3_SCEN       USART_CR3_SCEN_Msk

#define USART_CR3_DMAR_Pos   6
#define USART_CR3_DMAR_Msk   (0x1UL << USART_CR3_DMAR_Pos)
#define USART_CR3_DMAR       USART_CR3_DMAR_Msk

#define USART_CR3_DMAT_Pos   7
#define USART_CR3_DMAT_Msk   (0x1UL << USART_CR3_DMAT_Pos)
#define USART_CR3_DMAT       USART_CR3_DMAT_Msk

#define USART_CR3_RTSE_Pos   8
#define USART_CR3_RTSE_Msk   (0x1UL << USART_CR3_RTSE_Pos)
#define USART_CR3_RTSE       USART_CR3_RTSE_Msk

#define USART_CR3_CTSE_Pos   9
#define USART_CR3_CTSE_Msk   (0x1UL << USART_CR3_CTSE_Pos)
#define USART_CR3_CTSE       USART_CR3_CTSE_Msk

#define USART_CR3_CSTIE_Pos  10
#define USART_CR3_CSTIE_Msk  (0x1UL << USART_CR3_CSTIE_Pos)
#define USART_CR3_CSTIE      USART_CR3_CSTIE_Msk

#define USART_CR3_ONEBIT_Pos 11
#define USART_CR3_ONEBIT_Msk (0x1UL << USART_CR3_ONEBIT_Pos)
#define USART_CR3_ONEBIT     USART_CR3_ONEBIT_Msk

