piborisovich/microcontrollers/Milandr/Libraries/CMSIS/MDR32VF0xI/DeviceSupport/inc/MDR32VF0xI.h
/** @} */ /* End of group MDR32VF0xI_USART_CR3 */

/** @defgroup MDR32VF0xI_USART_GTPR USART GTPR
 * @{
 */

#define USART_GTPR_PSC_Pos 0
#define USART_GTPR_PSC_Msk (0x1FUL << USART_GTPR_PSC_Pos)

#define USART_GTPR_GT_Pos  8
#define USART_GTPR_GT_Msk  (0xFFUL << USART_GTPR_GT_Pos)

/** @} */ /* End of group MDR32VF0xI_USART_GTPR */

/** @} */ /* End of group MDR32VF0xI_USART_Defines */

/** @} */ /* End of group MDR32VF0xI_USART */

#if defined(USE_MDR32F02)

/** @defgroup MDR32VF0xI_L_BLOCK MDR_L_BLOCK
 * @{
 */

/**
 * @brief MDR32VF0xI L_BLOCK control structure.
 */
typedef struct {
    __IO uint32_t TRANSFORM_0;    /*!<L_BLOCK Transformation Register 1 */
    __IO uint32_t TRANSFORM_1;    /*!<L_BLOCK Transformation Register 2 */
    __IO uint32_t TRANSFORM_2;    /*!<L_BLOCK Transformation Register 3 */
    __IO uint32_t TRANSFORM_3;    /*!<L_BLOCK Transformation Register 4 */
    __IO uint32_t TABLE_CHANGE_0; /*!<L_BLOCK Table Change Register 1 */
    __IO uint32_t TABLE_CHANGE_1; /*!<L_BLOCK Table Change Register 2 */
    __IO uint32_t TABLE_CHANGE_2; /*!<L_BLOCK Table Change Register 3 */
    __IO uint32_t TABLE_CHANGE_3; /*!<L_BLOCK Table Change Register 4 */
    __IO uint32_t SETUP;          /*!<L_BLOCK Transformation Setup Register */
} MDR_L_BLOCK_TypeDef;

/** @defgroup MDR32VF0xI_L_BLOCK_Defines L_BLOCK Defines
 * @{
 */

/** @defgroup MDR32VF0xI_L_BLOCK_TRANSFORM_N L_BLOCK TRANSFORM_N
 * @{
 */

#define L_BLOCK_TRANSFORM_N_DATA_Pos 0
#define L_BLOCK_TRANSFORM_N_DATA_Msk (0xFFFFFFFFUL << L_BLOCK_TRANSFORM_N_DATA_Pos)

/** @} */ /* End of group MDR32VF0xI_L_BLOCK_TRANSFORM_N */

/** @defgroup MDR32VF0xI_L_BLOCK_TABLE_CHANGE_N L_BLOCK TABLE_CHANGE_N
 * @{
 */

#define L_BLOCK_TABLE_CHANGE_N_TABLE_VAL_N0_Pos 0
#define L_BLOCK_TABLE_CHANGE_N_TABLE_VAL_N0_Msk (0xFFUL << L_BLOCK_TABLE_CHANGE_N_TABLE_VAL_N0_Pos)

#define L_BLOCK_TABLE_CHANGE_N_TABLE_VAL_N1_Pos 8
#define L_BLOCK_TABLE_CHANGE_N_TABLE_VAL_N1_Msk (0xFFUL << L_BLOCK_TABLE_CHANGE_N_TABLE_VAL_N1_Pos)

#define L_BLOCK_TABLE_CHANGE_N_TABLE_VAL_N2_Pos 16
#define L_BLOCK_TABLE_CHANGE_N_TABLE_VAL_N2_Msk (0xFFUL << L_BLOCK_TABLE_CHANGE_N_TABLE_VAL_N2_Pos)

#define L_BLOCK_TABLE_CHANGE_N_TABLE_VAL_N3_Pos 24
#define L_BLOCK_TABLE_CHANGE_N_TABLE_VAL_N3_Msk (0xFFUL << L_BLOCK_TABLE_CHANGE_N_TABLE_VAL_N3_Pos)

/** @} */ /* End of group MDR32VF0xI_L_BLOCK_TABLE_CHANGE_N */

/** @defgroup MDR32VF0xI_L_BLOCK_SETUP L_BLOCK SETUP
 * @{
 */

#define L_BLOCK_SETUP_SET_R_COUNT_Pos  0
#define L_BLOCK_SETUP_SET_R_COUNT_Msk  (0x1FUL << L_BLOCK_SETUP_SET_R_COUNT_Pos)

#define L_BLOCK_SETUP_CURR_R_COUNT_Pos 8
#define L_BLOCK_SETUP_CURR_R_COUNT_Msk (0x1FUL << L_BLOCK_SETUP_CURR_R_COUNT_Pos)

#define L_BLOCK_SETUP_SET_L_DIR_Pos    16
#define L_BLOCK_SETUP_SET_L_DIR_Msk    (0x1UL << L_BLOCK_SETUP_SET_L_DIR_Pos)
#define L_BLOCK_SETUP_SET_L_DIR        L_BLOCK_SETUP_SET_L_DIR_Msk

#define L_BLOCK_SETUP_CURR_L_DIR_Pos   17
#define L_BLOCK_SETUP_CURR_L_DIR_Msk   (0x1UL << L_BLOCK_SETUP_CURR_L_DIR_Pos)
#define L_BLOCK_SETUP_CURR_L_DIR       L_BLOCK_SETUP_CURR_L_DIR_Msk

/** @} */ /* End of group MDR32VF0xI_L_BLOCK_SETUP */

/** @} */ /* End of group MDR32VF0xI_L_BLOCK_Defines */

/** @} */ /* End of group MDR32VF0xI_L_BLOCK */

/** @defgroup MDR32VF0xI_S_BLOCK MDR_S_BLOCK
 * @{
 */

/**
 * @brief MDR32VF0xI S_BLOCK control structure.
 */
typedef struct {
    __IO uint32_t TRANSFORM_0;  /*!<S_BLOCK Transformation Register 1 */
    __IO uint32_t TRANSFORM_1;  /*!<S_BLOCK Transformation Register 2 */
    __IO uint32_t TRANSFORM_2;  /*!<S_BLOCK Transformation Register 3 */
    __IO uint32_t TRANSFORM_3;  /*!<S_BLOCK Transformation Register 4 */
    __IO uint32_t TRANSFORM_4;  /*!<S_BLOCK Transformation Register 5 */
    __IO uint32_t TRANSFORM_5;  /*!<S_BLOCK Transformation Register 6 */
    __IO uint32_t TRANSFORM_6;  /*!<S_BLOCK Transformation Register 7 */
    __IO uint32_t TRANSFORM_7;  /*!<S_BLOCK Transformation Register 8 */
    __IO uint32_t TABLE_CHANGE; /*!<S_BLOCK Table Change Register */
} MDR_S_BLOCK_TypeDef;

/** @defgroup MDR32VF0xI_S_BLOCK_Defines S_BLOCK Defines
 * @{
 */

/** @defgroup MDR32VF0xI_S_BLOCK_TRANSFORM_N S_BLOCK TRANSFORM_N
 * @{
 */

#define S_BLOCK_TRANSFORM_N_DATA_Pos 0
#define S_BLOCK_TRANSFORM_N_DATA_Msk (0xFFFFFFFFUL << S_BLOCK_TRANSFORM_N_DATA_Pos)

/** @} */ /* End of group MDR32VF0xI_S_BLOCK_TRANSFORM_N */

/** @defgroup MDR32VF0xI_S_BLOCK_TABLE_CHANGE S_BLOCK TABLE_CHANGE
 * @{
 */

#define S_BLOCK_TABLE_CHANGE_TABLE_VAL_0_Pos 0
#define S_BLOCK_TABLE_CHANGE_TABLE_VAL_0_Msk (0xFFUL << S_BLOCK_TABLE_CHANGE_TABLE_VAL_0_Pos)

#define S_BLOCK_TABLE_CHANGE_TABLE_VAL_1_Pos 8
#define S_BLOCK_TABLE_CHANGE_TABLE_VAL_1_Msk (0xFFUL << S_BLOCK_TABLE_CHANGE_TABLE_VAL_1_Pos)

#define S_BLOCK_TABLE_CHANGE_TABLE_VAL_2_Pos 16
#define S_BLOCK_TABLE_CHANGE_TABLE_VAL_2_Msk (0xFFUL << S_BLOCK_TABLE_CHANGE_TABLE_VAL_2_Pos)

#define S_BLOCK_TABLE_CHANGE_TABLE_VAL_3_Pos 24
#define S_BLOCK_TABLE_CHANGE_TABLE_VAL_3_Msk (0xFFUL << S_BLOCK_TABLE_CHANGE_TABLE_VAL_3_Pos)

/** @} */ /* End of group MDR32VF0xI_S_BLOCK_TABLE_CHANGE */

/** @} */ /* End of group MDR32VF0xI_S_BLOCK_Defines */

/** @} */ /* End of group MDR32VF0xI_S_BLOCK */

/** @defgroup MDR32VF0xI_P_BYTE MDR_P_BYTE
 * @{
 */

/**
 * @brief MDR32VF0xI P_BYTE control structure
 */
typedef struct {
    __IO uint32_t TRANSFORM_0;  /*!<P_BYTE Word Permutation Register 1 */
    __IO uint32_t TRANSFORM_1;  /*!<P_BYTE Word Permutation Register 2 */
    __IO uint32_t TRANSFORM_2;  /*!<P_BYTE Word Permutation Register 3 */
    __IO uint32_t TRANSFORM_3;  /*!<P_BYTE Word Permutation Register 4 */
    __IO uint32_t TRANSFORM_4;  /*!<P_BYTE Word Permutation Register 5 */
    __IO uint32_t TRANSFORM_5;  /*!<P_BYTE Word Permutation Register 6 */
    __IO uint32_t TRANSFORM_6;  /*!<P_BYTE Word Permutation Register 7 */
    __IO uint32_t TRANSFORM_7;  /*!<P_BYTE Word Permutation Register 8 */
    __IO uint32_t TRANSFORM_8;  /*!<P_BYTE Word Permutation Register 9 */
    __IO uint32_t TRANSFORM_9;  /*!<P_BYTE Word Permutation Register 10 */
    __IO uint32_t TRANSFORM_10; /*!<P_BYTE Word Permutation Register 11 */
    __IO uint32_t TRANSFORM_11; /*!<P_BYTE Word Permutation Register 12 */
    __IO uint32_t TRANSFORM_12; /*!<P_BYTE Word Permutation Register 13 */
    __IO uint32_t TRANSFORM_13; /*!<P_BYTE Word Permutation Register 14 */
    __IO uint32_t TRANSFORM_14; /*!<P_BYTE Word Permutation Register 15 */
    __IO uint32_t TRANSFORM_15; /*!<P_BYTE Word Permutation Register 16 */
    __IO uint32_t MUX_SET;      /*!<P_BYTE Permutation Setting Register */
    __IO uint32_t MUX_VAL;      /*!<P_BYTE Permutation Value Register */
} MDR_P_BYTE_TypeDef;

/** @defgroup MDR32VF0xI_P_BYTE_Defines P_BYTE Defines
 * @{
 */

