piborisovich/microcontrollers/Milandr/Libraries/CMSIS/MDR32VF0xI/DeviceSupport/inc/MDR32VF0xI.h
/** @defgroup MDR32VF0xI_P_BYTE_TRANSFORM_N P_BYTE TRANSFORM_N
 * @{
 */

#define P_BYTE_TRANSFORM_N_DATA_Pos 0
#define P_BYTE_TRANSFORM_N_DATA_Msk (0xFFFFFFFFUL << P_BYTE_TRANSFORM_N_DATA_Pos)

/** @} */ /* End of group MDR32VF0xI_P_BYTE_TRANSFORM_N */

/** @defgroup MDR32VF0xI_P_BYTE_MUX_SET P_BYTE MUX_SET
 * @{
 */

#define P_BYTE_MUX_SET_IN_SEL_Pos  0
#define P_BYTE_MUX_SET_IN_SEL_Msk  (0x3FUL << P_BYTE_MUX_SET_IN_SEL_Pos)

#define P_BYTE_MUX_SET_OUT_SEL_Pos 8
#define P_BYTE_MUX_SET_OUT_SEL_Msk (0x3FUL << P_BYTE_MUX_SET_OUT_SEL_Pos)

/** @} */ /* End of group MDR32VF0xI_P_BYTE_MUX_SET */

/** @defgroup MDR32VF0xI_P_BYTE_MUX_VAL P_BYTE MUX_VAL
 * @{
 */

#define P_BYTE_MUX_VAL_VAL_Pos 0
#define P_BYTE_MUX_VAL_VAL_Msk (0x3FUL << P_BYTE_MUX_VAL_VAL_Pos)

#define P_BYTE_MUX_VAL_SEL_Pos 8
#define P_BYTE_MUX_VAL_SEL_Msk (0x3FUL << P_BYTE_MUX_VAL_SEL_Pos)

/** @} */ /* End of group MDR32VF0xI_P_BYTE_MUX_VAL */

/** @} */ /* End of group MDR32VF0xI_P_BYTE_Defines */

/** @} */ /* End of group MDR32VF0xI_P_BYTE */

/** @defgroup MDR32VF0xI_P_BIT MDR_P_BIT
 * @{
 */

/**
 * @brief MDR32VF0xI P_BIT control structure
 */
typedef struct {
    __IO uint32_t TRANSFORM_0; /*!<P_BIT Word Permutation Register 1 */
    __IO uint32_t TRANSFORM_1; /*!<P_BIT Word Permutation Register 2 */
    __IO uint32_t TRANSFORM_2; /*!<P_BIT Word Permutation Register 3 */
    __IO uint32_t TRANSFORM_3; /*!<P_BIT Word Permutation Register 4 */
    __IO uint32_t MUX_SET;     /*!<P_BIT Permutation Setting Register */
    __IO uint32_t MUX_VAL;     /*!<P_BIT Permutation Value Register */
} MDR_P_BIT_TypeDef;

/** @defgroup MDR32VF0xI_P_BIT_Defines P_BIT Defines
 * @{
 */

/** @defgroup MDR32VF0xI_P_BIT_TRANSFORM_N P_BIT TRANSFORM_N
 * @{
 */

#define P_BIT_TRANSFORM_N_DATA_Pos 0
#define P_BIT_TRANSFORM_N_DATA_Msk (0xFFFFFFFFUL << P_BIT_TRANSFORM_N_DATA_Pos)

/** @} */ /* End of group MDR32VF0xI_P_BIT_TRANSFORM_N */

/** @defgroup MDR32VF0xI_P_BIT_MUX_SET P_BIT MUX_SET
 * @{
 */

#define P_BIT_MUX_SET_IN_SEL_Pos  0
#define P_BIT_MUX_SET_IN_SEL_Msk  (0x7FUL << P_BIT_MUX_SET_IN_SEL_Pos)

#define P_BIT_MUX_SET_OUT_SEL_Pos 8
#define P_BIT_MUX_SET_OUT_SEL_Msk (0x7FUL << P_BIT_MUX_SET_OUT_SEL_Pos)

/** @} */ /* End of group MDR32VF0xI_P_BIT_MUX_SET */

/** @defgroup MDR32VF0xI_P_BIT_MUX_VAL P_BIT MUX_VAL
 * @{
 */

#define P_BIT_MUX_VAL_VAL_Pos 0
#define P_BIT_MUX_VAL_VAL_Msk (0x7FUL << P_BIT_MUX_VAL_VAL_Pos)

#define P_BIT_MUX_VAL_SEL_Pos 8
#define P_BIT_MUX_VAL_SEL_Msk (0x7FUL << P_BIT_MUX_VAL_SEL_Pos)

/** @} */ /* End of group MDR32VF0xI_P_BIT_MUX_VAL */

/** @} */ /* End of group MDR32VF0xI_P_BIT_Defines */

/** @} */ /* End of group MDR32VF0xI_P_BIT */

/** @defgroup MDR32VF0xI_OTP MDR_OTP
 * @{
 */

/**
 * @brief MDR32VF0xI OTP control structure
 */
typedef struct {
    __IO uint32_t STAT_CTRL;     /*!<OTP Status and Control Register */
    __I uint32_t  STAT;          /*!<OTP Status Register */
    __IO uint32_t DELAY_0;       /*!<OTP Delay Register 0 */
    __IO uint32_t DELAY_1;       /*!<OTP Delay Register 1 */
    __IO uint32_t RW_CMD;        /*!<OTP Read-Write Command Register */
    __I uint32_t  READ_DATA;     /*!<OTP Read Data Register */
    __IO uint32_t WRITE_PROTECT; /*!<OTP Write Protection Register */
    __IO uint32_t READ_PROTECT;  /*!<OTP Read Protection Register */
    __IO uint32_t RESERVED0[2];  /*!<Reserved */
    __I uint32_t  TEST_OPT;      /*!<OTP Test Options Register */
} MDR_OTP_TypeDef;

/** @defgroup MDR32VF0xI_OTP_Defines OTP Defines
 * @{
 */

/** @defgroup MDR32VF0xI_OTP_STAT_CTRL OTP STAT_CTRL
 * @{
 */

#define OTP_STAT_CTRL_FSM_STATE_Pos           0
#define OTP_STAT_CTRL_FSM_STATE_Msk           (0x3UL << OTP_STAT_CTRL_FSM_STATE_Pos)
#define OTP_STAT_CTRL_FSM_STATE_IDLE          (0x0UL << OTP_STAT_CTRL_FSM_STATE_Pos)
#define OTP_STAT_CTRL_FSM_STATE_INIT          (0x1UL << OTP_STAT_CTRL_FSM_STATE_Pos)
#define OTP_STAT_CTRL_FSM_STATE_READY         (0x2UL << OTP_STAT_CTRL_FSM_STATE_Pos)
#define OTP_STAT_CTRL_FSM_STATE_WAIT_REG_READ (0x3UL << OTP_STAT_CTRL_FSM_STATE_Pos)
#define OTP_STAT_CTRL_FSM_STATE_WAIT_BUS_READ (0x4UL << OTP_STAT_CTRL_FSM_STATE_Pos)
#define OTP_STAT_CTRL_FSM_STATE_WAIT_WRITE    (0x5UL << OTP_STAT_CTRL_FSM_STATE_Pos)
#define OTP_STAT_CTRL_FSM_STATE_DIRECT        (0x6UL << OTP_STAT_CTRL_FSM_STATE_Pos)

#define OTP_STAT_CTRL_BUSY_Pos                3
#define OTP_STAT_CTRL_BUSY_Msk                (0x1UL << OTP_STAT_CTRL_BUSY_Pos)
#define OTP_STAT_CTRL_BUSY                    OTP_STAT_CTRL_BUSY_Msk

#define OTP_STAT_CTRL_OTP_LOCK_Pos            4
#define OTP_STAT_CTRL_OTP_LOCK_Msk            (0x1UL << OTP_STAT_CTRL_OTP_LOCK_Pos)
#define OTP_STAT_CTRL_OTP_LOCK                OTP_STAT_CTRL_OTP_LOCK_Msk

#define OTP_STAT_CTRL_OTP_PLOCK_Pos           5
#define OTP_STAT_CTRL_OTP_PLOCK_Msk           (0x1UL << OTP_STAT_CTRL_OTP_PLOCK_Pos)
#define OTP_STAT_CTRL_OTP_PLOCK               OTP_STAT_CTRL_OTP_PLOCK_Msk

#define OTP_STAT_CTRL_RW_ERROR_Pos            6
#define OTP_STAT_CTRL_RW_ERROR_Msk            (0x1UL << OTP_STAT_CTRL_RW_ERROR_Pos)
#define OTP_STAT_CTRL_RW_ERROR                OTP_STAT_CTRL_RW_ERROR_Msk

#define OTP_STAT_CTRL_TEST_CRC_Pos            7
#define OTP_STAT_CTRL_TEST_CRC_Msk            (0x1UL << OTP_STAT_CTRL_TEST_CRC_Pos)
#define OTP_STAT_CTRL_TEST_CRC                OTP_STAT_CTRL_TEST_CRC_Msk

#define OTP_STAT_CTRL_WRITE_PCRC_Pos          8
#define OTP_STAT_CTRL_WRITE_PCRC_Msk          (0x1UL << OTP_STAT_CTRL_WRITE_PCRC_Pos)
#define OTP_STAT_CTRL_WRITE_PCRC              OTP_STAT_CTRL_WRITE_PCRC_Msk

#define OTP_STAT_CTRL_READ_PCRC_Pos           9
#define OTP_STAT_CTRL_READ_PCRC_Msk           (0x1UL << OTP_STAT_CTRL_READ_PCRC_Pos)
#define OTP_STAT_CTRL_READ_PCRC               OTP_STAT_CTRL_READ_PCRC_Msk

#define OTP_STAT_CTRL_DIR_EN_Pos              10
#define OTP_STAT_CTRL_DIR_EN_Msk              (0x1UL << OTP_STAT_CTRL_DIR_EN_Pos)
#define OTP_STAT_CTRL_DIR_EN                  OTP_STAT_CTRL_DIR_EN_Msk

/** @} */ /* End of group MDR32VF0xI_OTP_STAT_CTRL */

/** @defgroup MDR32VF0xI_OTP_STAT OTP STAT
 * @{
 */

