piborisovich/microcontrollers/Milandr/Libraries/CMSIS/MDR32VF0xI/DeviceSupport/inc/MDR32VF0xI.h
#define OTP_STAT_OTP_FSM_STATE_Pos 0
#define OTP_STAT_OTP_FSM_STATE_Msk (0x1FUL << OTP_STAT_OTP_FSM_STATE_Pos)

#define OTP_STAT_OTP_LOCK_Pos      6
#define OTP_STAT_OTP_LOCK_Msk      (0x1UL << OTP_STAT_OTP_LOCK_Pos)
#define OTP_STAT_OTP_LOCK          OTP_STAT_OTP_LOCK_Msk

#define OTP_STAT_OTP_BUSY_Pos      7
#define OTP_STAT_OTP_BUSY_Msk      (0x1UL << OTP_STAT_OTP_BUSY_Pos)
#define OTP_STAT_OTP_BUSY          OTP_STAT_OTP_BUSY_Msk

/** @} */ /* End of group MDR32VF0xI_OTP_STAT */

/** @defgroup MDR32VF0xI_OTP_DELAY_0 OTP DELAY_0
 * @{
 */

#define OTP_DELAY_0_DELAY_20NS_Pos 0
#define OTP_DELAY_0_DELAY_20NS_Msk (0xFUL << OTP_DELAY_0_DELAY_20NS_Pos)

#define OTP_DELAY_0_DELAY_70NS_Pos 4
#define OTP_DELAY_0_DELAY_70NS_Msk (0xFUL << OTP_DELAY_0_DELAY_70NS_Pos)

#define OTP_DELAY_0_DELAY_50NS_Pos 8
#define OTP_DELAY_0_DELAY_50NS_Msk (0x1FUL << OTP_DELAY_0_DELAY_50NS_Pos)

#define OTP_DELAY_0_DELAY_1US_Pos  16
#define OTP_DELAY_0_DELAY_1US_Msk  (0x1FFUL << OTP_DELAY_0_DELAY_1US_Pos)

/** @} */ /* End of group MDR32VF0xI_OTP_DELAY_0 */

/** @defgroup MDR32VF0xI_OTP_DELAY_1 OTP DELAY_1
 * @{
 */

#define OTP_DELAY_1_DELAY_16US_Pos 0
#define OTP_DELAY_1_DELAY_16US_Msk (0x1FFFFUL << OTP_DELAY_1_DELAY_16US_Pos)

/** @} */ /* End of group MDR32VF0xI_OTP_DELAY_1 */

/** @defgroup MDR32VF0xI_OTP_RW_CMD OTP RW_CMD
 * @{
 */

#define OTP_RW_CMD_ADDR_Pos     0
#define OTP_RW_CMD_ADDR_Msk     (0x1FFFFUL << OTP_RW_CMD_ADDR_Pos)

#define OTP_RW_CMD_DATA_Pos     24
#define OTP_RW_CMD_DATA_Msk     (0x1UL << OTP_RW_CMD_DATA_Pos)
#define OTP_RW_CMD_DATA         OTP_RW_CMD_DATA_Msk

#define OTP_RW_CMD_READ_Pos     28
#define OTP_RW_CMD_READ_Msk     (0x1UL << OTP_RW_CMD_READ_Pos)
#define OTP_RW_CMD_READ         OTP_RW_CMD_READ_Msk

#define OTP_RW_CMD_WRITE_Pos    29
#define OTP_RW_CMD_WRITE_Msk    (0x1UL << OTP_RW_CMD_WRITE_Pos)
#define OTP_RW_CMD_WRITE        OTP_RW_CMD_WRITE_Msk

#define OTP_RW_CMD_RW_ERROR_Pos 31
#define OTP_RW_CMD_RW_ERROR_Msk (0x1UL << OTP_RW_CMD_RW_ERROR_Pos)
#define OTP_RW_CMD_RW_ERROR     OTP_RW_CMD_RW_ERROR_Msk

/** @} */ /* End of group MDR32VF0xI_OTP_RW_CMD */

/** @defgroup MDR32VF0xI_OTP_READ_DATA OTP READ_DATA
 * @{
 */

#define OTP_READ_DATA_DATA_Pos 0
#define OTP_READ_DATA_DATA_Msk (0xFFUL << OTP_READ_DATA_DATA_Pos)

/** @} */ /* End of group MDR32VF0xI_OTP_READ_DATA */

/** @defgroup MDR32VF0xI_OTP_WRITE_PROTECT OTP WRITE_PROTECT
 * @{
 */

#define OTP_WRITE_PROTECT_Pos 0
#define OTP_WRITE_PROTECT_Msk (0xFFUL << OTP_WRITE_PROTECT_Pos)
#define OTP_WRITE_PROTECT_0   (0x01UL << OTP_WRITE_PROTECT_Pos)
#define OTP_WRITE_PROTECT_1   (0x02UL << OTP_WRITE_PROTECT_Pos)
#define OTP_WRITE_PROTECT_2   (0x04UL << OTP_WRITE_PROTECT_Pos)
#define OTP_WRITE_PROTECT_3   (0x08UL << OTP_WRITE_PROTECT_Pos)
#define OTP_WRITE_PROTECT_4   (0x10UL << OTP_WRITE_PROTECT_Pos)
#define OTP_WRITE_PROTECT_5   (0x20UL << OTP_WRITE_PROTECT_Pos)
#define OTP_WRITE_PROTECT_6   (0x40UL << OTP_WRITE_PROTECT_Pos)
#define OTP_WRITE_PROTECT_7   (0x80UL << OTP_WRITE_PROTECT_Pos)

/** @} */ /* End of group MDR32VF0xI_OTP_WRITE_PROTECT */

/** @defgroup MDR32VF0xI_OTP_READ_PROTECT OTP READ_PROTECT
 * @{
 */

#define OTP_READ_PROTECT_Pos 0
#define OTP_READ_PROTECT_Msk (0xFFUL << OTP_READ_PROTECT_Pos)
#define OTP_READ_PROTECT_0   (0x01UL << OTP_READ_PROTECT_Pos)
#define OTP_READ_PROTECT_1   (0x02UL << OTP_READ_PROTECT_Pos)
#define OTP_READ_PROTECT_2   (0x04UL << OTP_READ_PROTECT_Pos)
#define OTP_READ_PROTECT_3   (0x08UL << OTP_READ_PROTECT_Pos)
#define OTP_READ_PROTECT_4   (0x10UL << OTP_READ_PROTECT_Pos)
#define OTP_READ_PROTECT_5   (0x20UL << OTP_READ_PROTECT_Pos)
#define OTP_READ_PROTECT_6   (0x40UL << OTP_READ_PROTECT_Pos)
#define OTP_READ_PROTECT_7   (0x80UL << OTP_READ_PROTECT_Pos)

/** @} */ /* End of group MDR32VF0xI_OTP_READ_PROTECT */

/** @defgroup MDR32VF0xI_OTP_TEST_OPT OTP TEST_OPT
 * @{
 */

#define OTP_TEST_OPT_DEBUG_Pos 0
#define OTP_TEST_OPT_DEBUG_Msk (0xFFUL << OTP_TEST_OPT_DEBUG_Pos)

/** @} */ /* End of group MDR32VF0xI_OTP_TEST_OPT */

/** @} */ /* End of group MDR32VF0xI_OTP_Defines */

/** @} */ /* End of group MDR32VF0xI_OTP */

/** @defgroup MDR32F02_OTP_SPECIAL_FIELDS OTP_SPECIAL_FIELDS
 * @{
 */

/**
 * @brief MDR32F02 OTP special fields structure.
 */
typedef struct {
    __I uint32_t  UNIQ_ID[5]; /*!<OTP_SPECIAL_FIELDS Unique Chip Identifier Fields */
    __I uint32_t  BG_TRIM;    /*!<OTP_SPECIAL_FIELDS BandGap Reference Voltage Trimming Field (unused) */
    __I uint32_t  HSI_TRIM;   /*!<OTP_SPECIAL_FIELDS HSI and LSI Trimming Field */
    __IO uint32_t PROTECTION; /*!<OTP_SPECIAL_FIELDS OTP Protection Word Field */
} OTP_SpecialFields_TypeDef;

/** @defgroup MDR32F02_OTP_SPECIAL_FIELDS_Defines MDR32F02_OTP_SPECIAL_FIELDS Defines
 * @{
 */

/** @defgroup MDR32F02_OTP_SPECIAL_FIELDS_UNIQUE_ID MDR32F02_OTP_SPECIAL_FIELDS UNIQUE_ID
 * @{
 */

#define OTP_SPECIAL_FIELDS_UNIQUE_IDx_UNIQUE_ID_Pos 0
#define OTP_SPECIAL_FIELDS_UNIQUE_IDx_UNIQUE_ID_Msk (0xFFFFFFFFUL << OTP_SPECIAL_FIELDS_UNIQUE_IDx_UNIQUE_ID_Pos)

/** @} */ /* End of group MDR32F02_OTP_SPECIAL_FIELDS_UNIQUE_ID */

/** @defgroup MDR32F02_OTP_SPECIAL_FIELDS_TRIM_HSI MDR32F02_OTP_SPECIAL_FIELDS TRIM_HSI
 * @{
 */

#define OTP_SPECIAL_FIELDS_TRIM_HSI_TRIM_HSI_Pos 0
#define OTP_SPECIAL_FIELDS_TRIM_HSI_TRIM_HSI_Msk (0x3FUL << OTP_SPECIAL_FIELDS_TRIM_HSI_TRIM_HSI_Pos)

/** @} */ /* End of group MDR32F02_OTP_SPECIAL_FIELDS_TRIM_HSI_TRIM_HSI_Pos */

/** @defgroup MDR32F02_OTP_SPECIAL_FIELDS_PROTECTION MDR32F02_OTP_SPECIAL_FIELDS PROTECTION
 * @{
 */

#define OTP_SPECIAL_FIELDS_PROTECTION_REGIONS_Pos 28
#define OTP_SPECIAL_FIELDS_PROTECTION_REGIONS_Msk (0xFUL << OTP_SPECIAL_FIELDS_PROTECTION_REGIONS_Pos)

/** @} */ /* End of group MDR32F02_OTP_SPECIAL_FIELDS_PROTECTION */

/** @} */ /* End of group MDR32F02_OTP_SPECIAL_FIELDS_Defines */

/** @} */ /* End of group MDR32F02_OTP_SPECIAL_FIELDS */

#endif

/** @defgroup MDR32VF0xI_Peripheral_Declaration MDR32VF0xI Peripheral Declaration
 * @{
 */

#define MDR_SSP1    ((MDR_SSP_TypeDef*)MDR_SSP1_BASE)
#define MDR_SSP2    ((MDR_SSP_TypeDef*)MDR_SSP2_BASE)
#define MDR_SSP3    ((MDR_SSP_TypeDef*)MDR_SSP3_BASE)
#define MDR_UART1   ((MDR_UART_TypeDef*)MDR_UART1_BASE)
#define MDR_UART2   ((MDR_UART_TypeDef*)MDR_UART2_BASE)
#define MDR_UART3   ((MDR_UART_TypeDef*)MDR_UART3_BASE)
#define MDR_UART4   ((MDR_UART_TypeDef*)MDR_UART4_BASE)
#define MDR_FLASH   ((MDR_FLASH_TypeDef*)MDR_FLASH_BASE)
#define MDR_RST_CLK ((MDR_RST_CLK_TypeDef*)MDR_RST_CLK_BASE)
#define MDR_DMA     ((MDR_DMA_TypeDef*)MDR_DMA_BASE)
#define MDR_I2C     ((MDR_I2C_TypeDef*)MDR_I2C_BASE)
#define MDR_ADC     ((MDR_ADC_TypeDef*)MDR_ADC_BASE)
#define MDR_WWDG    ((MDR_WWDG_TypeDef*)MDR_WWDG_BASE)
#define MDR_IWDG    ((MDR_IWDG_TypeDef*)MDR_IWDG_BASE)
#define MDR_POWER   ((MDR_POWER_TypeDef*)MDR_POWER_BASE)
#define MDR_BKP     ((MDR_BKP_TypeDef*)MDR_BKP_BASE)
#define MDR_ADCUI   ((MDR_ADCUI_TypeDef*)MDR_ADCUI_BASE)
#define MDR_TIMER1  ((MDR_TIMER_TypeDef*)MDR_TIMER1_BASE)
#define MDR_TIMER2  ((MDR_TIMER_TypeDef*)MDR_TIMER2_BASE)
#define MDR_TIMER3  ((MDR_TIMER_TypeDef*)MDR_TIMER3_BASE)
#define MDR_TIMER4  ((MDR_TIMER_TypeDef*)MDR_TIMER4_BASE)
#define MDR_PORTA   ((MDR_PORT_TypeDef*)MDR_PORTA_BASE)
#define MDR_PORTB   ((MDR_PORT_TypeDef*)MDR_PORTB_BASE)
#define MDR_PORTC   ((MDR_PORT_TypeDef*)MDR_PORTC_BASE)
#define MDR_PORTD   ((MDR_PORT_TypeDef*)MDR_PORTD_BASE)
#define MDR_CRC     ((MDR_CRC_TypeDef*)MDR_CRC_BASE)
#define MDR_RANDOM  ((MDR_RANDOM_TypeDef*)MDR_RANDOM_BASE)
#define MDR_USART   ((MDR_USART_TypeDef*)MDR_USART_BASE)
#if defined(USE_MDR32F02)
#define MDR_L_BLOCK     ((MDR_L_BLOCK_TypeDef*)MDR_L_BLOCK_BASE)
#define MDR_S_BLOCK0    ((MDR_S_BLOCK_TypeDef*)MDR_S_BLOCK0_BASE)
#define MDR_S_BLOCK1    ((MDR_S_BLOCK_TypeDef*)MDR_S_BLOCK1_BASE)
#define MDR_S_BLOCK2    ((MDR_S_BLOCK_TypeDef*)MDR_S_BLOCK2_BASE)
#define MDR_S_BLOCK3    ((MDR_S_BLOCK_TypeDef*)MDR_S_BLOCK3_BASE)
#define MDR_S_BLOCK4    ((MDR_S_BLOCK_TypeDef*)MDR_S_BLOCK4_BASE)
#define MDR_S_BLOCK5    ((MDR_S_BLOCK_TypeDef*)MDR_S_BLOCK5_BASE)
#define MDR_S_BLOCK6    ((MDR_S_BLOCK_TypeDef*)MDR_S_BLOCK6_BASE)
#define MDR_S_BLOCK7    ((MDR_S_BLOCK_TypeDef*)MDR_S_BLOCK7_BASE)
#define MDR_P_BYTE      ((MDR_P_BYTE_TypeDef*)MDR_P_BYTE_BASE)
#define MDR_P_BIT0      ((MDR_P_BIT_TypeDef*)MDR_P_BIT0_BASE)
#define MDR_P_BIT1      ((MDR_P_BIT_TypeDef*)MDR_P_BIT1_BASE)
#define MDR_P_BIT2      ((MDR_P_BIT_TypeDef*)MDR_P_BIT2_BASE)
#define MDR_P_BIT3      ((MDR_P_BIT_TypeDef*)MDR_P_BIT3_BASE)
#define MDR_SENSORS     ((MDR_SENSORS_TypeDef*)MDR_SENSORS_BASE)
#define MDR_CLK_MEASURE ((MDR_CLK_MEASURE_TypeDef*)MDR_CLK_MEASURE_BASE)
#define MDR_OTP         ((MDR_OTP_TypeDef*)MDR_OTP_REG_BASE)
#endif

#if defined(USE_MDR32F02)
#define OTP_SPECIAL_FIELDS ((OTP_SpecialFields_TypeDef*)(OTP_BASE + 0x3FE0))
#endif

#if defined(USE_MDR1206FI)
#define MDR_FLASH_SPECIAL_FIELDS ((MDR_FLASH_SpecialFields_TypeDef*)MDR_FLASH_SPECIAL_FIELDS_BASE)
#elif defined(USE_MDR1206AFI)
#define MDR_FLASH_SPECIAL_FIELDS ((MDR_FLASH_SpecialFields_TypeDef*)MDR_FLASH_SPECIAL_FIELDS_BASE)
#elif defined(USE_MDR1206)
#define MDR_FLASH_SPECIAL_FIELDS_MDR1206FI  ((MDR_FLASH_SpecialFields_TypeDef*)MDR_FLASH_SPECIAL_FIELDS_MDR1206FI_BASE)
#define MDR_FLASH_SPECIAL_FIELDS_MDR1206AFI ((MDR_FLASH_SpecialFields_TypeDef*)MDR_FLASH_SPECIAL_FIELDS_MDR1206AFI_BASE)
#endif

/** @} */ /* End of group MDR32VF0xI_Peripheral_Declaration */

#ifdef __cplusplus
} // extern "C" block end
#endif /* __cplusplus */

/** @} */ /* End of group MDR32VF0xI_DEVICE */

/** @} */ /* End of group DEVICE_SUPPORT */

#endif /* MDR32VF0xI_H */

/*********************** (C) COPYRIGHT 2025 Milandr ****************************
 *
 * END OF FILE MDR32VF0xI.h */

